var status = 0;
var itemList =
        Array(
                Array(3010044, 700, 1, 1), //红伞椅子
                Array(3010036, 800, 1, 1), //秋千
                Array(3010049, 800, 1, 1), //学房子
                Array(3010110, 800, 1, 1), //熊
                Array(3010131, 800, 1, 1), //熊猫
                Array(1022129, 800, 1, 1), //眼睛
                Array(3012001, 800, 1, 1), //篝火 
                Array(3012002, 800, 1, 1), //浴桶
                Array(3012003, 800, 1, 1), //爱心
                Array(3010013, 800, 1, 1), //遮阳椅
                Array(3010018, 800, 1, 1), //椰子树
                Array(3010021, 800, 1, 1), //暖暖桌
                Array(3010024, 800, 1, 1), //玩具熊
                Array(3010025, 800, 1, 1), //5周年枫叶纪念
                Array(3010026, 800, 1, 1), //恶灵附身
                Array(3010034, 800, 1, 1), //假期红
                Array(3010035, 800, 1, 1), //假期蓝
                Array(3010043, 800, 1, 1), //魔女扫把
                Array(3010051, 800, 1, 1), //沙漠兔兔1
                Array(3010052, 800, 1, 1), //沙漠兔兔2
                Array(3010054, 800, 1, 1), //呼噜床
                Array(3010057, 800, 1, 1), //血色玫瑰
                Array(3010058, 800, 1, 1), //世界末日
                Array(3010063, 800, 1, 1), //月亮星星
                Array(3010068, 800, 1, 1), //露水椅子
                Array(3010069, 800, 1, 1), //大黄蜂
                Array(3010071, 800, 1, 1), //神兽椅子
                Array(3010075, 800, 1, 1), //音乐狂
                Array(3010075, 800, 1, 1), //大熊猫
                Array(3010079, 800, 1, 1), //肥猫
                Array(3010085, 800, 1, 1), //鬼娃娃椅子
                Array(3010096, 800, 1, 1), //恐龙化石
                Array(3010099, 800, 1, 1), //北极熊椅子
                Array(3010109, 800, 1, 1), //暖炉椅子
                Array(3010110, 800, 1, 1), //白熊
                Array(3010129, 800, 1, 1), //酋长宝座
                Array(3010139, 800, 1, 1), //私密空间
                Array(3010140, 800, 1, 1), //早日康复
                Array(3010147, 800, 1, 1), //龙蛋椅子
                Array(3010149, 800, 1, 1), //风扇
                Array(3010151, 800, 1, 1), //无人岛
                Array(3010151, 800, 1, 1), //三角张峰
                Array(3010169, 800, 1, 1), //求领养
                Array(3010172, 800, 1, 1), //星空椅子
                Array(3010175, 800, 1, 1), //名画家椅子
                Array(3010193, 800, 1, 1), //炼金瓶
                Array(3010195, 800, 1, 1), //无价之宝
                Array(3010195, 800, 1, 1), //泡泡浴缸
                Array(3010289, 800, 1, 1), //老奶奶读通话
                Array(3010293, 800, 1, 1), //恶灵椅子
                Array(3010403, 800, 1, 1), //音乐会
                Array(3010410, 800, 1, 1), //珍妮
                Array(3010411, 800, 1, 1), //双鱼
                Array(3010412, 800, 1, 1), //双塔
                Array(3010428, 800, 1, 1), //水晶
                Array(3010437, 800, 1, 1), //魔法书
                Array(3010438, 800, 1, 1), //音符
                Array(3010453, 800, 1, 1), //兔子
                Array(3010454, 800, 1, 1), //爱心云朵
                Array(3010462, 800, 1, 1), //天文台
                Array(3010494, 800, 1, 1), //TV椅子
                Array(3010505, 800, 1, 1), //看球赛
                Array(3010515, 800, 1, 1), //奇石椅子
                Array(3010609, 800, 1, 1), //不是在做梦
                Array(3010622, 800, 1, 1), //丹真
                Array(3010632, 800, 1, 1), //印第安
                Array(3010633, 800, 1, 1), //印第安
                Array(3010659, 800, 1, 1), //巴士
                Array(3010716, 800, 1, 1), //超级蘑菇
                Array(3010729, 800, 1, 1), //孤独男子
                Array(3010730, 800, 1, 1), //小企鹅合唱团
                Array(3010733, 800, 1, 1), //电视椅子
                Array(3010738, 800, 1, 1), //闪电三人组
                Array(3010739, 800, 1, 1), //雪人香波
                Array(3010753, 800, 1, 1), //玫瑰鸟笼
                Array(3010767, 800, 1, 1), //雪人椅子
                Array(3010760, 800, 1, 1), //古代浴池
                Array(3010876, 800, 1, 1), //人鱼
                Array(3010879, 800, 1, 1), //繁星
                Array(3010937, 800, 1, 1), //异界
                Array(3010938, 800, 1, 1), //异界
                Array(3010939, 800, 1, 1), //异界
                Array(3010946, 800, 1, 1), //森林伙伴
                Array(3012007, 800, 1, 1), //石狮
                Array(3012008, 800, 1, 1), //稻荷神社
                Array(3012011, 800, 1, 1), //火锅
                Array(3012022, 800, 1, 1), //寿司
                Array(3015053, 800, 1, 1), //三重杨
                Array(3015120, 800, 1, 1), //枕头大战
                Array(3015264, 800, 1, 1), //美味厨房
                Array(3015158, 800, 1, 1), //印第安
                Array(3010291, 800, 1, 1), //病床
                Array(3010428, 800, 1, 1), //水晶
                Array(3010492, 800, 1, 1), //首脑
                Array(3010435, 800, 1, 1), //千年狐狸
                Array(3010494, 800, 1, 1), //TV
                Array(3010511, 800, 1, 1), //公园
                Array(3010512, 800, 1, 1), //半半
                Array(3010589, 800, 1, 1), //充电
                Array(3010600, 800, 1, 1), //福星
                Array(3010601, 800, 1, 1), //竹篮
                Array(3010620, 800, 1, 1), //泄愤
                Array(3010664, 800, 1, 1), //进化
                Array(3010678, 800, 1, 1), //还加吨
                Array(3010680, 800, 1, 1), //公主
                Array(3010739, 800, 1, 1), //香波
                Array(3010744, 800, 1, 1), //积木
                Array(3010795, 800, 1, 1), //栖息
                Array(3010806, 800, 1, 1), //放飞
                Array(3010894, 800, 1, 1), //咖啡
                Array(3012030, 800, 1, 1), //公主
                Array(3015100, 800, 1, 1), //公主
                Array(3015183, 800, 1, 1), //公主
                Array(3015312, 800, 1, 1), //公主
                Array(3012011, 800, 1, 1) //火锅
                );

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("那么请搜集完毕再来找我吧！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4000313, 30)) {
            cm.sendYesNo("#v4000313#看来你已经搜集完毕了.那么我来为您抽取#r[精美椅子].");
        } else {
            cm.sendOk("你背包里有30个#b#t4000313##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "周日寻宝福利抽奖", notice);
            if (item != -1) {
                cm.gainItem(4000313, -30);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有30个#b#t4170005##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。但是作为鼓励，送给你5颗#v4001322#作为奖励.");
            cm.gainItem(4000313, -30);
            cm.gainItem(41001322, 5);
            cm.safeDispose();
        }
    }
}