var status = 0;
var itemList = 
Array(     
			Array(2040001,800,1,1), //头盔防御卷轴60%
			Array(2040002,800,1,1), //头盔防御卷轴10%
			Array(2040004,800,1,1), //头盔体力卷轴60%
			Array(2040005,800,1,1), //头盔体力卷轴10%
			Array(2040016,800,1,1), //头盔命中卷轴10%
			Array(2040017,800,1,1), //头盔命中卷轴60%
			Array(2040025,800,1,1), //头盔智力卷轴60%
			Array(2040026,800,1,1), //头盔智力卷轴10%
			Array(2040029,800,1,1), //头盔敏捷卷轴60%
			Array(2040031,800,1,1), //头盔敏捷卷轴10%
			Array(2040005,800,1,1), //头盔体力卷轴10%
			Array(2040005,800,1,1), //头盔体力卷轴10%
			Array(2040105,800,1,1), //脸部装饰回避率卷轴10%
			Array(2040106,800,1,1), //脸部装饰回避率卷轴60%
			Array(2040200,800,1,1), //眼部装饰命中率卷轴10%
			Array(2040201,800,1,1), //眼部装饰命中率卷轴60%
			Array(2040205,800,1,1), //眼部装饰智力卷轴10%
			Array(2040206,800,1,1), //眼部装饰智力卷轴60%		
			Array(2040301,800,1,1), //耳环智力卷轴 60
			Array(2040302,800,1,1), //耳环智力卷轴 10
			Array(2040317,800,1,1), //耳环敏捷卷轴 60
			Array(2040318,800,1,1), //耳环敏捷卷轴 10
			Array(2040321,800,1,1), //耳环运气卷轴 60
			Array(2040323,800,1,1), //耳环运气卷轴 10
			Array(2040326,800,1,1), //耳环体力卷轴 60
			Array(2040328,800,1,1), //耳环体力卷轴 10
			Array(2040501,800,1,1), //全身铠甲敏捷卷轴60
			Array(2040502,800,1,1), //全身铠甲敏捷卷轴10
			Array(2040513,800,1,1), //全身铠甲智力卷轴60
			Array(2040514,800,1,1), //全身铠甲智力卷轴10
			Array(2040516,800,1,1), //全身铠甲运气卷轴60
			Array(2040517,800,1,1), //全身铠甲运气卷轴10
			Array(2040532,800,1,1), //全身铠甲力量卷轴60
			Array(2040534,800,1,1), //全身铠甲力量卷轴10
			Array(2040418,800,1,1), //上衣力量卷轴60%
			Array(2040419,800,1,1), //上衣力量卷轴10%
			Array(2040413,800,1,1), //上衣运气卷轴60%
			Array(2040412,800,1,1), //上衣运气卷轴10%
			Array(2040613,800,1,1), //裙裤敏捷卷轴60%
			Array(2040612,800,1,1), //裙裤敏捷卷轴10%
			Array(2040704,800,1,1), //鞋子跳跃卷轴60
			Array(2040705,800,1,1), //鞋子跳跃卷轴10
			Array(2040804,800,1,1), //手套攻击卷轴60
			Array(2040805,800,1,1), //手套攻击卷轴10
			Array(2040816,800,1,1), //手套魔力卷轴10%
			Array(2040817,800,1,1), //手套魔力卷轴60%
			Array(2040914,800,1,1), //盾牌攻击卷轴60%
			Array(2041013,800,1,1), //披风力量卷轴60
			Array(2041014,800,1,1), //披风力量卷轴10
			Array(2041016,800,1,1), //披风智力卷轴60
			Array(2041017,800,1,1), //披风智力卷轴10
			Array(2041019,800,1,1), //披风敏捷卷轴60
			Array(2041020,800,1,1), //披风敏捷卷轴10
			Array(2041022,800,1,1), //披风运气卷轴60
			Array(2041023,800,1,1), //披风运气卷轴10
			Array(2041201,800,1,1), //项链运气卷轴10
			Array(2041202,800,1,1), //项链运气卷轴60
			Array(2041206,800,1,1), //项链力量卷轴10
			Array(2041207,800,1,1), //项链力量卷轴60
			Array(2041301,800,1,1), //腰带力量卷轴60
			Array(2041304,800,1,1), //腰带智力卷轴60
			Array(2041307,800,1,1), //腰带敏捷卷轴60
			Array(2041310,800,1,1), //腰带运气卷轴60
			Array(2041302,800,1,1), //腰带力量卷轴10
			Array(2041305,800,1,1), //腰带智力卷轴10
			Array(2041308,800,1,1), //腰带敏捷卷轴10
			Array(2041311,800,1,1), //腰带力量卷轴10
			Array(2043002,800,1,1), //单手剑10
			Array(2043001,800,1,1), //单手剑60
			Array(2044002,800,1,1), //双手剑10
			Array(2044001,800,1,1), //双手剑60
			Array(2044302,800,1,1), //枪10
			Array(2044301,800,1,1), //枪60
			Array(2044502,800,1,1), //弓10
			Array(2044501,800,1,1), //弓60
			Array(2044602,800,1,1), //弩10
			Array(2044601,800,1,1), //弩60
			Array(2044702,800,1,1), //拳套10
			Array(2044701,800,1,1), //拳套60
			Array(2043802,800,1,1), //长杖10
			Array(2043801,800,1,1), //长杖60
			Array(2043702,800,1,1), //短杖10
			Array(2043701,800,1,1), //短杖60
			Array(2044402,800,1,1), //矛10
			Array(2044401,800,1,1), //矛60
			Array(2043302,800,1,1), //短剑10
			Array(2043301,800,1,1), //短剑60
			Array(1102041,600,1,1), //PF
			Array(1102042,600,1,1), //PF
			Array(3010044,700,1,1), //红伞椅子
			Array(3010036,800,1,1), //秋千
			Array(3010049,800,1,1), //学房子
			Array(3010110,800,1,1), //熊
			Array(3010131,800,1,1), //熊猫
			Array(1022129,800,1,1), //眼睛
			Array(3012001,800,1,1), //篝火 
			Array(3012002,800,1,1), //浴桶
			Array(3012003,800,1,1), //爱心
			Array(3010013,800,1,1), //遮阳椅
			Array(3010018,800,1,1), //椰子树
			Array(3010021,800,1,1), //暖暖桌
			Array(3010024,800,1,1), //玩具熊
			Array(3010025,800,1,1), //5周年枫叶纪念
			Array(3010026,800,1,1), //恶灵附身
			Array(3010034,800,1,1), //假期红
			Array(3010035,800,1,1), //假期蓝
			Array(3010043,800,1,1), //魔女扫把
			Array(3010051,800,1,1), //沙漠兔兔1
			Array(3010052,800,1,1), //沙漠兔兔2
			Array(3010054,800,1,1), //呼噜床
			Array(3010057,800,1,1), //血色玫瑰
			Array(3010058,800,1,1), //世界末日
			Array(3010063,800,1,1), //月亮星星
			Array(3010068,800,1,1), //露水椅子
			Array(3010069,800,1,1), //大黄蜂
			Array(3010071,800,1,1), //神兽椅子
			Array(3010075,800,1,1), //音乐狂
			Array(3010075,800,1,1), //大熊猫
			Array(3010079,800,1,1), //肥猫
			Array(3010085,800,1,1), //鬼娃娃椅子
			Array(3010096,800,1,1), //恐龙化石
			Array(3010099,800,1,1), //北极熊椅子
			Array(3010109,800,1,1), //暖炉椅子
			Array(3010110,800,1,1), //白熊
			Array(3010129,800,1,1), //酋长宝座
			Array(3010139,800,1,1), //私密空间
			Array(3010140,800,1,1), //早日康复
			Array(3010147,800,1,1), //龙蛋椅子
			Array(3010149,800,1,1), //风扇
			Array(3010151,800,1,1), //无人岛
			Array(3010151,800,1,1), //三角张峰
			Array(3010169,800,1,1), //求领养
			Array(3010172,800,1,1), //星空椅子
			Array(3010175,800,1,1), //名画家椅子
			Array(3010193,800,1,1), //炼金瓶
			Array(3010195,800,1,1), //无价之宝
			Array(3010195,800,1,1), //泡泡浴缸
			Array(3010289,800,1,1), //老奶奶读通话
			Array(3010293,800,1,1), //恶灵椅子
			Array(3010403,800,1,1), //音乐会
			Array(1102041,600,1,1), //PF
			Array(1102042,600,1,1), //PF
			Array(3010410,800,1,1), //珍妮
			Array(3010411,800,1,1), //双鱼
			Array(3010412,800,1,1), //双塔
			Array(3010428,800,1,1), //水晶
			Array(3010437,800,1,1), //魔法书
			Array(3010438,800,1,1), //音符
			Array(3010453,800,1,1), //兔子
			Array(3010454,800,1,1), //爱心云朵
			Array(3010462,800,1,1), //天文台
			Array(3010494,800,1,1), //TV椅子
			Array(3010505,800,1,1), //看球赛
			Array(3010515,800,1,1), //奇石椅子
			Array(3010609,800,1,1), //不是在做梦
			Array(3010622,800,1,1), //丹真
			Array(1102041,600,1,1), //PF
			Array(1102042,600,1,1), //PF
			Array(3010632,800,1,1), //印第安
			Array(3010633,800,1,1), //印第安
			Array(3010659,800,1,1), //巴士
			Array(3010716,800,1,1), //超级蘑菇
			Array(3010729,800,1,1), //孤独男子
			Array(3010730,800,1,1), //小企鹅合唱团
			Array(3010733,800,1,1), //电视椅子
			Array(3010738,800,1,1), //闪电三人组
			Array(3010739,800,1,1), //雪人香波
			Array(3010753,800,1,1), //玫瑰鸟笼
			Array(3010767,800,1,1), //雪人椅子
			Array(3010760,800,1,1), //古代浴池
			Array(3010876,800,1,1), //人鱼
			Array(3010879,800,1,1), //繁星
			Array(3010937,800,1,1), //异界
			Array(3010938,800,1,1), //异界
			Array(3010939,800,1,1), //异界
			Array(3010946,800,1,1), //森林伙伴
			Array(3012007,800,1,1), //石狮
			Array(3012008,800,1,1), //稻荷神社
			Array(3012011,800,1,1), //火锅
			Array(3012022,800,1,1), //寿司
			Array(3015053,800,1,1), //三重杨
			Array(3015120,800,1,1), //枕头大战
			Array(3015264,800,1,1), //美味厨房
			Array(3015158,800,1,1), //印第安
			Array(3015158,800,1,1), //印第安
			Array(1102041,700,1,1), //PF
			Array(1102042,700,1,1), //PF
			Array(3015158,800,1,1) //划痕眼睛
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("玩具副本主要出产：#v1102041#,#v1102042#,各种卷轴，以及上百种椅子.等奖励.");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4170005, 1)) {
            cm.sendYesNo("玩具副本主要出产：#v1102041#,#v1102042#,各种卷轴，以及上百种椅子.等奖励.");
        } else {
            cm.sendOk("玩具副本主要出产：#v1102041#,#v1102042#,各种卷轴，以及上百种椅子.等奖励.你背包里有1个#b#t4170005##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 900);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "玩具副本福利抽奖", notice);
            if (item != -1) {
                cm.gainItem(4170005, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4170005##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。但是作为鼓励，送给你5颗#v4001322#作为奖励.");
            cm.gainItem(4170005, -1);
            cm.gainItem(4001322, 5);
            cm.safeDispose();
        }
    }
}