//load("nashorn:mozilla_compat.js");

//importPackage(Packages.java.util);
//importPackage(Packages.client);
//importPackage(Packages.server);


var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var item;


var jmsz = Array(
    Array(2000005, 20, "未定义", "永久"), //背带短裤套装 
    Array(2340000, 500, "未定义", "永久"), //奥兹魔法长袍
    Array(2049100, 300, "未定义", "永久"), //胡克的船长长袍
    Array(2022154, 100, "未定义", "永久")//草莓巧克力短裤
    );


var jmwq = Array(
    Array(3015155, 5000, "未定义", "永久"), //祝福卷轴
    Array(3015312, 4000, "未定义", "永久"), //混沌卷轴60%
    Array(3015374, 3000, "未定义", "永久"), //祝福卷轴
    Array(3015225, 8000, "未定义", "永久")//混沌卷轴60%
    );


var jzmp = Array(
    Array(1402063, 6000, "未定义", "永久"), //钻石聊天戒指
    Array(1402014, 10000, "未定义", "永久"), //钻石聊天戒指
    Array(1442039, 6000, "未定义", "永久"), //黄金聊天戒指
    Array(1402037, 10000, "未定义", "永久"), //小熊猫聊天戒指
    Array(1332053, 3000, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1092022, 3000, "未定义", "永久")//小竹林名片戒指
    );

var tjId = Array(
    Array(3010163, 2000, "未定义", "10天", 60000 * 60 * 24 * 10, 1)//满月椅子
    );

var syxh = Array(
    Array(4004000, 500, "未定义", 10), //祝福卷轴
    Array(4004001, 500, "未定义", 10), //混沌卷轴60%
    Array(4004002, 500, "未定义", 10), //祝福卷轴
    Array(4004003, 500, "未定义", 10), //祝福卷轴
    Array(4004004, 500, "未定义", 10)//混沌卷轴60%
    );

var tscl = Array(
    Array(4000151, 1000, 100), //时间门神的轴标
    Array(4001109, 1000, 5)//强化玻璃瓶
    );

var xswp = Array(
    Array(5000191, 66666, "神马", 60000 * 60 * 90 * 1, 1),
    Array(5000212, 20000, "火红小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000213, 20000, "幽青小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000214, 20000, "雷黄小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000244, 20000, "冰龙", 60000 * 60 * 90 * 1, 1),
    Array(5000013, 10000, "大象", 60000 * 60 * 90 * 1, 1),
    Array(5000014, 10000, "圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000055, 10000, "水晶银圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000053, 10000, "大猩猩机器人", 60000 * 60 * 90 * 1, 1),
    Array(5000038, 10000, "萌太郎", 60000 * 60 * 90 * 1, 1),
    Array(5000072, 10000, "臭鼬", 60000 * 60 * 90 * 1, 1),
    Array(5000075, 10000, "小象宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000076, 10000, "威尔士柯基狗", 60000 * 60 * 90 * 1, 1),
    Array(5000077, 10000, "波斯猫", 60000 * 60 * 90 * 1, 1),
    Array(5000081, 10000, "飞行小鲸鱼", 60000 * 60 * 90 * 1, 1),
    Array(5000084, 10000, "独角兽安塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000085, 10000, "蛋糕宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000086, 10000, "馅饼宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000089, 10000, "独角兽迪埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000090, 10000, "独角兽吉尼", 60000 * 60 * 90 * 1, 1),
    Array(5000091, 10000, "独角兽埃塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000096, 10000, "稀有白色小象", 60000 * 60 * 90 * 1, 1),
    Array(5000250, 10000, "粉小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000251, 10000, "蓝小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000252, 10000, "艾克索", 60000 * 60 * 90 * 1, 1),
    Array(5000253, 10000, "阿黛尔", 60000 * 60 * 90 * 1, 1),
    Array(5000264, 10000, "跳跳袋鼠", 60000 * 60 * 90 * 1, 1),
    Array(5000271, 10000, "绿色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000272, 10000, "黄色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000273, 10000, "粉色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000274, 10000, "豆豆蛇", 60000 * 60 * 90 * 1, 1),
    Array(5000284, 20000, "冰骑士", 60000 * 60 * 90 * 1, 1),
    Array(5000287, 20000, "血腥皇后", 60000 * 60 * 90 * 1, 1),
    Array(5000288, 20000, "半半", 60000 * 60 * 90 * 1, 1),
    Array(5000289, 20000, "皮埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000290, 20000, "天使提尔", 60000 * 60 * 90 * 1, 1),
    Array(5000291, 20000, "天使拉尔", 60000 * 60 * 90 * 1, 1),
    Array(5000292, 20000, "天使米尔", 60000 * 60 * 90 * 1, 1),
    Array(5000293, 20000, "蜜桃鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000294, 20000, "薄荷鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000295, 20000, "紫色鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000320, 20000, "铠鼠爱因", 60000 * 60 * 90 * 1, 1),
    Array(5000321, 20000, "铠鼠居里", 60000 * 60 * 90 * 1, 1),
    Array(5000322, 20000, "铠鼠牛顿", 60000 * 60 * 90 * 1, 1),
    Array(5000324, 20000, "火柴人宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000330, 20000, "MINI班雷昂", 60000 * 60 * 90 * 1, 1),
    Array(5000331, 20000, "MINI奥尔卡", 60000 * 60 * 90 * 1, 1),
    Array(5000332, 20000, "MINI希拉", 60000 * 60 * 90 * 1, 1),
    Array(5000369, 20000, "小拉伊", 60000 * 60 * 90 * 1, 1),
    Array(5000370, 20000, "小波波", 60000 * 60 * 90 * 1, 1),
    Array(5000371, 20000, "小阿尔", 60000 * 60 * 90 * 1, 1),
    Array(5000391, 20000, "黄金虾", 60000 * 60 * 90 * 1, 1),
    Array(5000528, 60000, "猫鼬家族", 60000 * 60 * 90 * 1, 1),
    Array(5000402, 20000, "芭蕾女孩丽恩", 60000 * 60 * 90 * 1, 1)
    );


var jmpf = Array(
    Array(1102665, 3000, "未定义", "永久"), //狐狸围脖
    Array(1102217, 3000, "未定义", "永久"), //九尾披风
    Array(1102625, 3000, "未定义", "永久"), //红色蜗牛壳
    Array(1102651, 13000, "未定义", "永久"), //小浣熊尾巴
    Array(1102652, 13000, "未定义", "永久"), //松鼠尾巴
    Array(1102654, 13000, "未定义", "永久"), //狗狗尾巴
    Array(1102655, 13000, "未定义", "永久"), //熊熊尾巴
    Array(1102188, 3000, "未定义", "永久"), //银色狐狸尾巴
    Array(1102187, 3000, "未定义", "永久"), //金色狐狸尾巴
    Array(1102648, 3000, "未定义", "永久"), //K君的猫尾巴
    Array(1102387, 3000, "未定义", "永久"), //海龙尾巴
    Array(1102388, 3000, "未定义", "永久"), //炎龙尾巴
    Array(1102292, 3000, "未定义", "永久"), //尾巴
    Array(1102296, 3000, "未定义", "永久"), //夜叉尾巴（黑色）
    Array(1102656, 3000, "未定义", "永久"), //动物尾巴6
    Array(1102622, 3000, "未定义", "永久"), //时间旅行者的怀表
    Array(1102692, 3000, "未定义", "永久"), //寿司团
    Array(1102574, 3000, "未定义", "永久"), //小鸡叽叽叽
    Array(1102380, 3000, "未定义", "永久"), //我的朋友青蛙酱
    Array(1102549, 3000, "未定义", "永久"), //管家的猫咪
    Array(1102705, 3000, "未定义", "永久"), //企鹅书包
    Array(1102683, 3000, "未定义", "永久"), //兔兔熊背包
    Array(1102684, 3000, "未定义", "永久"), //未来医生听诊器
    Array(1102682, 3000, "未定义", "永久"), //未来天使注射器
    Array(1102593, 3000, "未定义", "永久"), //浮漾的翅膀
    Array(1102668, 3000, "未定义", "永久"), //夜天使之翼
    Array(1102353, 3000, "未定义", "永久"), //自由的翅膀
    Array(1102554, 3000, "未定义", "永久"), //女妖之翼
    Array(1102391, 3000, "未定义", "永久"), //小蜜蜂翅膀
    Array(1102325, 3000, "未定义", "永久"), //紫天使羽翼
    Array(1102326, 3000, "未定义", "永久"), //蓝天使羽翼
    Array(1102389, 3000, "未定义", "永久"), //金色天使
    Array(1102390, 3000, "未定义", "永久"), //银色天使
    Array(1102273, 3000, "未定义", "永久"), //路西法之翼
    Array(1102349, 3000, "未定义", "永久"), //发光精灵翅膀
    Array(1102293, 3000, "未定义", "永久"), //羁绊之翼
    Array(1102152, 3000, "未定义", "永久"), //黑骷髅海盗旗
    Array(1102300, 3000, "未定义", "永久"), //派对舞会灯
    Array(1102288, 3000, "未定义", "永久"), //背背雪人
    Array(1102274, 3000, "未定义", "永久"), //刺柏刀
    Array(1102310, 3000, "未定义", "永久"), //精灵披风
    Array(1102461, 3000, "未定义", "永久"), //粉嫩披风
    Array(1102222, 3000, "未定义", "永久"), //死神披风
    Array(1102583, 3000, "未定义", "永久"), //宝贝龙波比
    Array(1102232, 3000, "未定义", "永久"), //小王子的星星
    Array(1102218, 3000, "未定义", "永久"), //仙女飘飘
    Array(1102356, 3000, "未定义", "永久"), //天使祖母绿
    Array(1102270, 3000, "未定义", "永久"), //风和日丽
    Array(1102261, 3000, "未定义", "永久"), //音符围脖
    Array(1102251, 3000, "未定义", "永久"), //世界杯手巾
    Array(1102373, 3000, "未定义", "永久"), //露西娅披风
    Array(1102301, 3000, "未定义", "永久"), //旅行者披风
    Array(1102255, 3000, "未定义", "永久"), //唤灵斗师披风
    Array(1102254, 3000, "未定义", "永久"), //豹弩游侠披风
    Array(1102242, 3000, "未定义", "永久"), //胡克的船长披风
    Array(1102249, 3000, "未定义", "永久"), //奥兹魔法披风
    Array(1102239, 3000, "未定义", "永久"), //暗影双刀披风
    Array(1102355, 3000, "未定义", "永久"), //怪盗幻影披风
    Array(1102673, 3000, "未定义", "永久"), //僵尸新娘披风
    Array(1102324, 3000, "未定义", "永久"), //传说双层气球
    Array(1102212, 3000, "未定义", "永久"), //丢失的小孩
    Array(1102233, 3000, "未定义", "永久"), //雪娃娃披风
    Array(1102230, 3000, "未定义", "永久"), //企企雪橇披风
    Array(1102245, 3000, "未定义", "永久"), //太阳披风
    Array(1102258, 3000, "未定义", "永久"), //玩具熊气球
    Array(1102215, 3000, "未定义", "永久"), //气球串
    Array(1102271, 3000, "未定义", "永久"), //可爱巧克力棒气球
    Array(1102488, 3000, "未定义", "永久"), //蛋糕杯气球
    Array(1102285, 3000, "未定义", "永久"), //晴天娃娃(粉色)
    Array(1102286, 3000, "未定义", "永久"), //晴天娃娃(天蓝色)
    Array(1102287, 3000, "未定义", "永久")//晴天娃娃(淡黄色)
    );


var jmmz = Array(
    Array(1002960, 3000, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1004639, 3000, "未定义", "永久"), //北极罩帽
    Array(1004636, 3000, "未定义", "永久"), //香蕉郊游帽
    Array(1004628, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004629, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004630, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004631, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004632, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004602, 3000, "未定义", "永久"), //农夫的瑰宝
    Array(1004601, 3000, "未定义", "永久"), //小企鹅帽子
    Array(1004589, 3000, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570, 3000, "未定义", "永久"), //黑色海魂帽
    Array(1004571, 3000, "未定义", "永久"), //海贼团贝雷帽
    Array(1004568, 3000, "未定义", "永久"), //呆萌鼠鼠帽
    Array(1004543, 3000, "未定义", "永久"), //复古头巾
    Array(1004544, 3000, "未定义", "永久"), //棒球帽
    Array(1004545, 3000, "未定义", "永久"), //棒球帽
    Array(1004546, 3000, "未定义", "永久"), //棒球帽
    Array(1004547, 3000, "未定义", "永久"), //棒球帽
    Array(1004548, 3000, "未定义", "永久"), //棒球帽
    Array(1004532, 3000, "未定义", "永久"), //女皇关注
    Array(1004533, 3000, "未定义", "永久"), //女皇关注
    Array(1004535, 3000, "未定义", "永久"), //女皇关注
    Array(1004540, 3000, "未定义", "永久"), //女皇关注
    Array(1004541, 3000, "未定义", "永久"), //女皇关注
    Array(1004542, 3000, "未定义", "永久"), //女皇关注
    Array(1004530, 3000, "未定义", "永久"), //蓝色熊猫玩偶帽子
    Array(1004510, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004511, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004512, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004513, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004514, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004503, 3000, "未定义", "永久"), //黑猫
    Array(1004504, 3000, "未定义", "永久"), //黑猫
    Array(1004505, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1004499, 3000, "未定义", "永久"), //蓝鱼帽子
    Array(1004500, 3000, "未定义", "永久"), //黑猫
    Array(1004491, 3000, "未定义", "永久"), //西红柿
    Array(1004486, 3000, "未定义", "永久"), //春之主人
    Array(1004463, 3000, "未定义", "永久"), //方块兔子
    Array(1004467, 3000, "未定义", "永久"), //方块兔子
    Array(1004469, 3000, "未定义", "永久"), //方块兔子
    Array(1004470, 3000, "未定义", "永久"), //方块兔子
    Array(1004471, 3000, "未定义", "永久"), //方块兔子
    Array(1004472, 3000, "未定义", "永久"), //黑猫
    Array(1004473, 3000, "未定义", "永久"), //黑猫
    Array(1004478, 3000, "未定义", "永久"), //黑猫
    Array(1004480, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1003084, 3000, "未定义", "永久"), //帝国皇冠
    Array(1003861, 3000, "未定义", "永久"), //明星小皇冠
    Array(1003401, 3000, "未定义", "永久"), //黑暗伊卡尔特
    Array(1003402, 3000, "未定义", "永久"), //黑暗胡克
    Array(1003458, 3000, "未定义", "永久"), //茅山道士帽
    Array(1003104, 3000, "未定义", "永久"), //巨型蛋糕帽
    Array(1003246, 3000, "未定义", "永久"), //可爱兔子帽
    Array(1004112, 3000, "未定义", "永久"), //刀马旦花帽
    Array(1003776, 3000, "未定义", "永久"), //海豹白白帽
    Array(1003392, 3000, "未定义", "永久"), //小蜜蜂帽子
    Array(1003802, 3000, "未定义", "永久"), //小恐龙绿豆帽子
    Array(1003803, 3000, "未定义", "永久"), //小恐龙云豆帽子
    Array(1003728, 3000, "未定义", "永久"), //蓝色精灵帽
    Array(1003727, 3000, "未定义", "永久"), //红色精灵帽
    Array(1003509, 3000, "未定义", "永久"), //时尚香肠帽
    Array(1003508, 3000, "未定义", "永久"), //西红柿帽子
    Array(1004124, 3000, "未定义", "永久"), //恋爱小草莓帽
    Array(1004125, 3000, "未定义", "永久"), //歌唱大菠萝帽
    Array(1003829, 3000, "未定义", "永久"), //兔耳管家礼帽
    Array(1003541, 3000, "未定义", "永久"), //逆转兔帽子
    Array(1004126, 3000, "未定义", "永久"), //彩塘熊耳帽
    Array(1004092, 3000, "未定义", "永久"), //小马乖乖帽
    Array(1003842, 3000, "未定义", "永久"), //女妖帽子
    Array(1003921, 3000, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003588, 3000, "未定义", "永久"), //玩具粉熊帽子
    Array(1003909, 3000, "未定义", "永久"), //活力苏打帽
    Array(1003596, 3000, "未定义", "永久"), //金属粉色棒球帽
    Array(1003597, 3000, "未定义", "永久"), //金属冠棒球帽
    Array(1003462, 3000, "未定义", "永久"), //Kitty猫猫帽
    Array(1003268, 3000, "未定义", "永久"), //按键狂人糖果帽
    Array(1003269, 3000, "未定义", "永久"), //按键狂人玩具帽
    Array(1003241, 3000, "未定义", "永久"), //摇滚歌手帽
    Array(1003533, 3000, "未定义", "永久"), //黑暗奥尔卡军官帽
    Array(1002524, 3000, "未定义", "永久"), //可乐帽
    Array(1003790, 3000, "未定义", "永久"), //高尔夫遮阳帽
    Array(1004137, 3000, "未定义", "永久"), //兔兔熊帽
    Array(1003919, 3000, "未定义", "永久"), //花花绒线帽
    Array(1003077, 3000, "未定义", "永久"), //花别针尼龙帽
    Array(1003215, 3000, "未定义", "永久"), //粉色雪花帽
    Array(1003387, 3000, "未定义", "永久"), //耳机毛线帽
    Array(1003210, 3000, "未定义", "永久"), //绒球遮耳帽
    Array(1002422, 3000, "未定义", "永久"), //点点星光帽
    Array(1003920, 3000, "未定义", "永久"), //夏威夷草帽
    Array(1003519, 3000, "未定义", "永久"), //霞光草帽
    Array(1003141, 3000, "未定义", "永久"), //稻草编织帽
    Array(1003531, 3000, "未定义", "永久"), //西式风情帽
    Array(1003539, 3000, "未定义", "永久"), //蓝色天使帽
    Array(1004136, 3000, "未定义", "永久"), //未来天使帽
    Array(1003793, 3000, "未定义", "永久"), //杜鹃花发簪
    Array(1004203, 3000, "未定义", "永久"), //喵星人的秘密
    Array(1004014, 3000, "未定义", "永久"), //阿宅守护精灵
    Array(1003967, 3000, "未定义", "永久"), //巧可羊帽子
    Array(1004204, 3000, "未定义", "永久"), //小蓝马
    Array(1004205, 3000, "未定义", "永久"), //小红马
    Array(1003234, 3000, "未定义", "永久"), //粉色卓别林帽子
    Array(1003235, 3000, "未定义", "永久"), //珠宝蓝卓别林帽子
    Array(1002920, 3000, "未定义", "永久"), //粉红淑女帽
    Array(1001042, 3000, "未定义", "永久"), //紫环头纱
    Array(1004113, 3000, "未定义", "永久"), //僵尸新娘的面纱
    Array(1004123, 3000, "未定义", "永久"), //时尚小圆帽
    Array(1002885, 3000, "未定义", "永久"), //新型蝴蝶结
    Array(1003133, 3000, "未定义", "永久"), //雪姬蝴蝶结
    Array(1003233, 3000, "未定义", "永久"), //最爱兔子发夹
    Array(1003222, 3000, "未定义", "永久"), //冰蓝蝴蝶卡子
    Array(1003362, 3000, "未定义", "永久"), //玫瑰粉双蝴蝶结
    Array(1003862, 3000, "未定义", "永久"), //熊宝宝发带
    Array(1003132, 3000, "未定义", "永久"), //红色精致丝带
    Array(1004111, 3000, "未定义", "永久"), //粉色波点发箍
    Array(1004110, 3000, "未定义", "永久"), //蓝色波点发箍
    Array(1003071, 3000, "未定义", "永久"), //淘气女孩粉色发箍
    Array(1003072, 3000, "未定义", "永久"), //黑蕾丝蝴蝶发箍
    Array(1003459, 3000, "未定义", "永久"), //露西娅帽子
    Array(1003750, 3000, "未定义", "永久"), //绸带猫耳
    Array(1003760, 3000, "未定义", "永久"), //猫咪耳机
    Array(1003505, 3000, "未定义", "永久"), //炎龙角
    Array(1003278, 3000, "未定义", "永久"), //孔雀羽毛
    Array(1003503, 3000, "未定义", "永久"), //爱丽丝的茶杯
    Array(1003223, 3000, "未定义", "永久"), //寻找妈咪的小鸡
    Array(1003510, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003202, 3000, "未定义", "永久"), //黄金甲壳虫
    Array(1003367, 3000, "未定义", "永久"), //彩色花环
    Array(1003761, 3000, "未定义", "永久"), //圣洁天使帽
    Array(1003461, 3000, "未定义", "永久"), //秀秀
    Array(1003277, 3000, "未定义", "永久"), //草业妖精帽
    Array(1000051, 3000, "未定义", "永久"), //精灵精神发带
    Array(1003520, 3000, "未定义", "永久"), //可爱丝线发带
    Array(1003860, 3000, "未定义", "永久"), //赛利亚假发
    Array(1003807, 3000, "未定义", "永久"), //桃心太阳眼镜
    Array(1003264, 3000, "未定义", "永久"), //太阳镜
    Array(1003265, 3000, "未定义", "永久"), //水手太阳镜
    Array(1003594, 3000, "未定义", "永久"), //凉爽夏日潜水镜
    Array(1003043, 3000, "未定义", "永久"), //叮当鹿角
    Array(1003078, 3000, "未定义", "永久"), //灵异蝴蝶
    Array(1003581, 3000, "未定义", "永久"), //蝴蝶伴舞头饰
    Array(1003586, 3000, "未定义", "永久"), //薄荷海军帽
    Array(1003587, 3000, "未定义", "永久"), //粉红丝带海军帽
    Array(1003079, 3000, "未定义", "永久"), //小嫩叶帽
    Array(1003083, 3000, "未定义", "永久"), //小嫩苗
    Array(1002888, 3000, "未定义", "永久"), //丝带发箍（红色）
    Array(1002890, 3000, "未定义", "永久"), //丝带发箍（蓝色）
    Array(1003639, 3000, "未定义", "永久"), //荧光发箍-粉色
    Array(1003640, 3000, "未定义", "永久"), //荧光发箍-蓝色
    Array(1003641, 3000, "未定义", "永久"), //荧光发箍-绿色
    Array(1003642, 3000, "未定义", "永久"), //荧光发箍-金色
    Array(1003249, 3000, "未定义", "永久"), //8周年音符黄晶
    Array(1003250, 3000, "未定义", "永久"), //8周年音符红宝石
    Array(1003251, 3000, "未定义", "永久"), //8周年音符黄水晶
    Array(1003252, 3000, "未定义", "永久"), //8周年音符紫水晶
    Array(1003548, 3000, "未定义", "永久"), //魔术师黑色礼帽
    Array(1003549, 3000, "未定义", "永久"), //魔术师黑色缎带
    Array(1003607, 3000, "未定义", "永久"), //蓝宝石羽毛发饰
    Array(1003636, 3000, "未定义", "永久"), //水神帽
    Array(1003865, 3000, "未定义", "永久"), //星光飘带帽子
    Array(1003516, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003461, 3000, "未定义", "永久"), //玫瑰秀秀
    Array(1000053, 3000, "未定义", "永久"), //贵族晚宴帽(男)
    Array(1000050, 3000, "未定义", "永久"), //薄荷雪水晶(男)
    Array(1000045, 3000, "未定义", "永久"), //军团长假发-男
    Array(1000046, 3000, "未定义", "永久"), //精灵王假发-男
    Array(1000071, 3000, "未定义", "永久"), //蓝色蝴蝶结礼帽（男）
    Array(1003460, 3000, "未定义", "永久"), //奶油巧克力帽子
    Array(1003796, 3000, "未定义", "永久"), //甜蜜冰淇淋帽
    Array(1003542, 3000, "未定义", "永久"), //草莓杏仁饼发卡
    Array(1003543, 3000, "未定义", "永久"), //杏仁饼发卡
    Array(1003544, 3000, "未定义", "永久"), //草莓纸杯蛋糕发卡
    Array(1003545, 3000, "未定义", "永久"), //哈密瓜纸杯蛋糕发卡
    Array(1003546, 3000, "未定义", "永久"), //巧克力纸杯蛋糕发卡
    Array(1003547, 3000, "未定义", "永久"), //冰激淋纸杯蛋糕发卡
    Array(1003595, 3000, "未定义", "永久")//卷发兔子
    );



var jmsp = Array(
    Array(1022184, 3000, "未定义", "永久"), //烈焰之瞳(蓝)
    Array(1022183, 3000, "未定义", "永久"), //烈焰之瞳(红) 
    Array(1012450, 3000, "未定义", "永久"), //巧克力彩豆曲奇
    Array(1012412, 3000, "未定义", "永久"), //血泪 
    Array(1012099, 3000, "未定义", "永久"), //蓝色腮红 
    Array(1012253, 3000, "未定义", "永久"), //心跳唇彩
    Array(1012160, 3000, "未定义", "永久"), //烈焰红唇
    Array(1012208, 3000, "未定义", "永久"), //害羞了 
    Array(1012131, 3000, "未定义", "永久"), //好白的牙
    Array(1012165, 3000, "未定义", "永久"), //小丑鼻子
    Array(1012176, 3000, "未定义", "永久"), //娃娃脸
    Array(1012179, 3000, "未定义", "永久"), //鹿鼻子
    Array(1012135, 3000, "未定义", "永久"), //吐舌头
    Array(1022059, 3000, "未定义", "永久"), //经典黑色墨镜
    Array(1022057, 3000, "未定义", "永久"), //POP眼镜
    Array(1022064, 3000, "未定义", "永久"), //时尚大太阳镜
    Array(1022063, 3000, "未定义", "永久"), //无框小圆眼镜
    Array(1022104, 3000, "未定义", "永久"), //3D炫彩眼镜
    Array(1022102, 3000, "未定义", "永久"), //LED炫光眼镜
    Array(1022108, 3000, "未定义", "永久"), //柠檬黄潮流眼镜
    Array(1022109, 3000, "未定义", "永久"), //玫瑰红潮流眼镜
    Array(1003265, 3000, "未定义", "永久"), //爱心天蓝墨镜
    Array(1022110, 3000, "未定义", "永久"), //非主流墨镜
    Array(1022122, 3000, "未定义", "永久"), //DJ眼镜
    Array(1032029, 3000, "未定义", "永久"), //925银耳环
    Array(1032181, 3000, "未定义", "永久"), //杜鹃花耳环
    Array(1032034, 3000, "未定义", "永久"), //可乐耳环
    Array(1032094, 3000, "未定义", "永久"), //胡萝卜耳环
    Array(1032088, 3000, "未定义", "永久"), //体力猎犬耳环
    Array(1032145, 3000, "未定义", "永久")//螃蟹耳环
    );


var qtwp = Array(
    Array(5010082, 5000, "未定义", "永久"), //新星效果
    Array(4290004, 5000, "未定义", "永久"), //2010庚延年纪念品
    Array(4290003, 5000, "未定义", "永久"), //幻想妖精
    Array(4290001, 5000, "未定义", "永久"), //倒霉效果 
    Array(4290000, 5000, "未定义", "永久"), //金鸡效果
    Array(5010080, 5000, "未定义", "永久"), //（效果）下雨
    Array(5160017, 5000, "未定义", "永久"), //哼哼
    Array(5160015, 5000, "未定义", "永久"), //晕乎乎
    Array(5010015, 5000, "未定义", "永久"), //777效果
    Array(5010008, 5000, "未定义", "永久"), //幸运儿效果
    Array(5021011, 3000, "未定义", "永久"), //骷髅飞镖
    Array(5021012, 3000, "未定义", "永久"), //南瓜派
    Array(5021013, 3000, "未定义", "永久"), //海盗炸弹
    Array(5021026, 3000, "未定义", "永久")//开心的圣诞老人
    );

var gfs = Array(
    Array(1003393, 15000, "未定义", "永久"), //帝国伯爵冠
    Array(1102381, 15000, "未定义", "永久"), //皇家公爵翅膀
    Array(1032233, 5000, "未定义", "永久"), //粉色桃心耳环
    Array(1002839, 6666, "未定义", "永久"), //南瓜棒球帽
    Array(1112928, 5000, "未定义", "永久"), //粉色流星戒指90天
    Array(1112924, 5000, "未定义", "永久"), //黄色流星戒指90天
    Array(1112930, 5000, "未定义", "永久"), //西红柿效果-90天
    Array(1112937, 5000, "未定义", "永久"), //催眠曲戒指(90天)
    Array(1112916, 5000, "未定义", "永久"), //寂寞单身戒指
    Array(1112148, 5000, "未定义", "永久"), //胡子先生名片戒指
    Array(1112266, 5000, "未定义", "永久"), //胡子先生对话框戒指
    Array(1112154, 5000, "未定义", "永久"), //压岁钱防御战名片戒指
    Array(1112259, 5000, "未定义", "永久"), //压岁钱防御战聊天戒指
    Array(1112274, 5000, "未定义", "永久"), //鸥巴聊天戒指
    Array(1112162, 5000, "未定义", "永久"), //鸥巴名片戒指
    Array(1112276, 5000, "未定义", "永久"), //夏日甜心聊天戒指
    Array(1112164, 5000, "未定义", "永久"), //夏日甜心名片戒指
    Array(1112273, 5000, "未定义", "永久"), //黄小丫聊天戒指
    Array(1112161, 5000, "未定义", "永久"), //黄小丫名片戒指
    Array(1112271, 5000, "未定义", "永久"), //非洲之星聊天戒指
    Array(1112159, 5000, "未定义", "永久"), //非洲之星名片戒指
    Array(1112252, 5000, "未定义", "永久"), //红玫瑰聊天戒指
    Array(1112141, 5000, "未定义", "永久"), //红玫瑰名片戒指
    Array(1112135, 5000, "未定义", "永久"), //水墨花名片戒指
    Array(1112238, 5000, "未定义", "永久"), //水墨花聊天戒指
    Array(1112143, 5000, "未定义", "永久"), //豪华珍珠名片戒指
    Array(1112254, 5000, "未定义", "永久"), //豪华珍珠聊天戒指
    Array(1112262, 5000, "未定义", "永久"), //天使降临聊天戒指
    Array(1112150, 5000, "未定义", "永久"), //天使降临名片戒指
    Array(5010069, 5000, "未定义", "永久"), //死神之翼
    Array(1042271, 5000, "未定义", "永久"), //外星人拼色T恤
    Array(1042321, 5000, "未定义", "永久"), //心花怒放T恤
    Array(1042260, 5000, "未定义", "永久"), //点点星光羊毛上衣
    Array(1050284, 5000, "未定义", "永久"), //派对公子服(男)
    Array(1050302, 5000, "未定义", "永久"), //执事之品格(男)
    Array(1000052, 5000, "未定义", "永久"), //公主冠（男）
    Array(1052731, 5000, "未定义", "永久"), //黑色可爱游泳服
    Array(1052634, 5000, "未定义", "永久"), //简洁白衬衫
    Array(1052209, 5000, "未定义", "永久"), //皇家海军制服
    Array(1050152, 5000, "未定义", "永久"), //水兵服男
    Array(1052201, 5000, "未定义", "永久"), //闪亮水手外套
    Array(1004108, 5000, "未定义", "永久"), //幻夜蝶华礼帽
    Array(1003247, 5000, "未定义", "永久"), //杂技团老板帽
    Array(1003272, 5000, "未定义", "永久"), //格莱特帽
    Array(1003276, 5000, "未定义", "永久"), //蓝心透明帽子
    Array(1003271, 5000, "未定义", "永久"), //红心透明帽子
    Array(1003918, 5000, "未定义", "永久"), //翅膀帽
    Array(1004029, 5000, "未定义", "永久"), //小白熊便帽
    Array(1004026, 5000, "未定义", "永久"), //小黑猫便帽
    Array(1004028, 5000, "未定义", "永久"), //小花猫便帽
    Array(1004027, 5000, "未定义", "永久"), //白猫无边帽 
    Array(1003955, 5000, "未定义", "永久"), //浪漫玫瑰
    Array(1004094, 5000, "未定义", "永久"), //白巧克力兔子发箍
    Array(1004193, 5000, "未定义", "永久"), //护目镜帽子
    Array(1003892, 5000, "未定义", "永久"), //树叶钻石
    Array(1002846, 5000, "未定义", "永久"), //蓝天贝雷帽
    Array(1002995, 5000, "未定义", "永久"), //皇家海军帽
    Array(1003748, 5000, "未定义", "永久"), //皇家天使帽
    Array(1702168, 5000, "未定义", "永久"), //闪亮圣诞树
    Array(1702278, 5000, "未定义", "永久"), //枫之武器
    Array(1702211, 5000, "未定义", "永久"), //亮丽雪片
    Array(1702289, 5000, "未定义", "永久"), //皇家海军旗帜
    Array(1702287, 5000, "未定义", "永久"), //唤灵斗师长杖
    Array(1702277, 5000, "未定义", "永久"), //密码签字笔
    Array(1702309, 5000, "未定义", "永久"), //多味棒棒糖
    Array(1702155, 5000, "未定义", "永久"), //绚丽彩虹
    Array(1102605, 5000, "未定义", "永久"), //暗炎赎罪者
    Array(1102671, 5000, "未定义", "永久"), //肃清者的荆翼
    Array(1102564, 5000, "未定义", "永久"), //天衣无缝
    Array(1102653, 15000, "未定义", "永久"), //兔尾巴
    Array(1102267, 5000, "未定义", "永久")//我的朋友九尾狐尾巴

    );



var ns = Array(
    Array(1051311, 5000, "未定义", "永久"), //黑暗力量连身衣(女)
    Array(1051199, 5000, "未定义", "永久"), //樱花服
    Array(1051173, 5000, "未定义", "永久"), //条纹淑女连衣裙
    Array(1051118, 5000, "未定义", "永久"), //粉红可爱游泳服
    Array(1051189, 5000, "未定义", "永久"), //怦然心动装
    Array(1051233, 5000, "未定义", "永久"), //车模装
    Array(1052410, 5000, "未定义", "永久"), //粉嫩花仙裙
    Array(1051350, 5000, "未定义", "永久"), //派对名媛裙
    Array(1051376, 5000, "未定义", "永久"), //万圣节机器人裙
    Array(1051375, 5000, "未定义", "永久"), //欧迪尔芭蕾裙
    Array(1051349, 5000, "未定义", "永久"), //女妖
    Array(1051387, 5000, "未定义", "永久"), //春游连衣裙
    Array(1051296, 5000, "未定义", "永久"), //玩世不恭裙装
    Array(1051295, 5000, "未定义", "永久"), //魔法裙装
    Array(1051294, 5000, "未定义", "永久"), //抒情裙装 
    Array(1051192, 5000, "未定义", "永久"), //海洋裹裹短裙  
    Array(1051160, 5000, "未定义", "永久"), //裹裹短裙
    Array(1052593, 5000, "未定义", "永久"), //粉红缎带冰淇淋服
    Array(1051303, 5000, "未定义", "永久"), //抹胸礼裙
    Array(1051261, 5000, "未定义", "永久"), //童话幻想
    Array(1052419, 5000, "未定义", "永久"), //粉娃娃群
    Array(1051180, 5000, "未定义", "永久"), //水兵服女
    Array(1051363, 5000, "未定义", "永久"), //开场天使
    Array(1051278, 5000, "未定义", "永久"), //樱桃雪套服
    Array(1051219, 5000, "未定义", "永久"), //彩虹mini连衣裙
    Array(1051211, 5000, "未定义", "永久"), //伊丽莎白礼服
    Array(1051221, 5000, "未定义", "永久"), //圣诞节套服-女
    Array(1051228, 5000, "未定义", "永久"), //粉红色雪花休闲装
    Array(1051229, 5000, "未定义", "永久"), //花少女韩服
    Array(1051231, 5000, "未定义", "永久"), //阿尔卑斯山少女装
    Array(1051232, 5000, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1052656, 5000, "未定义", "永久"), //白天鹅芭蕾服
    Array(1051235, 5000, "未定义", "永久"), //橙色小鸡裙子
    Array(1051252, 5000, "未定义", "永久"), //粉红天使制服
    Array(1051253, 5000, "未定义", "永久"), //红帽迷你裙
    Array(1051254, 5000, "未定义", "永久"), //萝莉学生装
    Array(1052295, 5000, "未定义", "永久"), //粉红色女仆装
    Array(1052296, 5000, "未定义", "永久"), //天蓝色女仆装
    Array(1052298, 5000, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052225, 5000, "未定义", "永久"), //暗夜娃娃服
    Array(1052306, 5000, "未定义", "永久"), //雪姬和服
    Array(1041142, 5000, "未定义", "永久"), //巨星蛋糕吊带
    Array(1041127, 5000, "未定义", "永久"), //爱心背心
    Array(1041189, 5000, "未定义", "永久"), //女牛仔衬衫
    Array(1001076, 5000, "未定义", "永久"), //樱桃雪水晶
    Array(1001064, 5000, "未定义", "永久"), //闪耀Girl帽子
    Array(1001083, 5000, "未定义", "永久"), //爆莉萌天使发卡
    Array(1001044, 5000, "未定义", "永久"), //绿色婚纱头纱
    Array(1001061, 5000, "未定义", "永久"), //伊丽莎白假发(女)
    Array(1001068, 5000, "未定义", "永久"), //军团长假发-女
    Array(1001069, 5000, "未定义", "永久"), //精灵王假发-女
    Array(1001094, 5000, "未定义", "永久"), //蓝色蕾丝头巾
    Array(1001089, 5000, "未定义", "永久"), //兔子胡萝卜绒线帽
    Array(1001085, 5000, "未定义", "永久"), //粉蝴蝶发卡
    Array(1061148, 5000, "未定义", "永久"), //巨星粉色短裙
    Array(1061001, 5000, "未定义", "永久"), //蓝超短裙
    Array(1061007, 5000, "未定义", "永久"), //红超短裙 
    Array(1061126, 5000, "未定义", "永久"), //白色超短裙
    Array(1061067, 5000, "未定义", "永久"), //热裤
    Array(1081007, 5000, "未定义", "永久")//伊丽莎白手套
    );

var qltz = Array(
    Array(1051200, 20000, "未定义", "永久"), //邦妮女孩套服
    Array(1050161, 20000, "未定义", "永久"), //邦妮男孩套服
    Array(1050177, 20000, "未定义", "永久"), //MapleBoy套服
    Array(1051218, 20000, "未定义", "永久"), //MapleGirl套服
    Array(1052727, 20000, "未定义", "永久"), //快乐连体衫
    Array(1052728, 20000, "未定义", "永久"), //快乐连衣裙
    Array(1051357, 20000, "未定义", "永久"), //可爱棒球服（女）
    Array(1050291, 20000, "未定义", "永久"), //可爱棒球服（男）
    Array(1000072, 20000, "未定义", "永久"), //蓝色钱包君（男）
    Array(1001095, 20000, "未定义", "永久"), //粉色钱包君（女）
    Array(1050299, 20000, "未定义", "永久"), //小娃娃普卡（男）
    Array(1051366, 20000, "未定义", "永久"), //小娃娃皮卡（女）
    Array(1050293, 20000, "未定义", "永久"), //海滩帅锅装（男）
    Array(1051359, 20000, "未定义", "永久"), //海滩美眉装
    Array(1050293, 20000, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 20000, "未定义", "永久"), //蓝色小背带服
    Array(1051256, 20000, "未定义", "永久"), //蓝色小背带裙
    Array(1050209, 20000, "未定义", "永久"), //黄色晚礼服-男款
    Array(1051255, 20000, "未定义", "永久"), //黄色晚礼服-女款
    Array(1042213, 3000, "未定义", "永久"), //粉色雪花卫衣
    Array(1042212, 3000, "未定义", "永久"), //蓝色点点外套
    Array(1042216, 20000, "未定义", "永久"), //红色枫叶网球服
    Array(1042217, 20000, "未定义", "永久"), //黑色枫叶网球服
    Array(1048001, 20000, "未定义", "永久"), //兔兔情侣衫  
    Array(1048002, 20000, "未定义", "永久"), //胡萝卜情侣衫 
    Array(1042313, 20000, "未定义", "永久"), //魔蘑菇T恤（柠檬黄）
    Array(1042312, 20000, "未定义", "永久"), //魔蘑菇T恤（冰雪蓝）
    Array(1042316, 20000, "未定义", "永久"), //粉色萌萌象
    Array(1042315, 20000, "未定义", "永久"), //蓝色萌萌象
    Array(1050190, 20000, "未定义", "永久"), //闪烁之星男生礼服
    Array(1051232, 20000, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1050310, 20000, "未定义", "永久"), //天生购物狂（男）
    Array(1051382, 20000, "未定义", "永久"), //天生购物狂（女）
    Array(1050318, 20000, "未定义", "永久"), //纯白礼服（男）
    Array(1051389, 20000, "未定义", "永久"), //纯白婚纱(女)
    Array(1050296, 20000, "未定义", "永久"), //超级巨星服（男）
    Array(1051362, 20000, "未定义", "永久"), //超级巨星（女）
    Array(1050300, 20000, "未定义", "永久"), //蓝色雪糕帅锅装
    Array(1051367, 20000, "未定义", "永久"), //蓝色雪糕MM装
    Array(1050145, 20000, "未定义", "永久"), //粉露肩晚礼服（男）
    Array(1051123, 20000, "未定义", "永久"), //粉露肩晚礼服（女）
    Array(1051372, 20000, "未定义", "永久"), //巧克力女孩
    Array(1050304, 20000, "未定义", "永久"), //巧克力男孩
    Array(1051368, 20000, "未定义", "永久"), //粉格纹假日装（女）
    Array(1050301, 20000, "未定义", "永久"), //蓝色格纹假日服（男）
    Array(1000070, 20000, "未定义", "永久"), //贵族骑手帽(男)
    Array(1001093, 20000, "未定义", "永久"), //贵族骑手帽（女）
    Array(1050312, 20000, "未定义", "永久"), //贵族骑手装(男)
    Array(1051384, 20000, "未定义", "永久")//贵族骑手装（女）

    );

var stxz = Array(
    Array(1082511, 3000, "未定义", "永久"), //小恐龙绿豆手套
    Array(1082519, 3000, "未定义", "永久"), //小恐龙云豆手套
    Array(1082312, 3000, "未定义", "永久"), //彩虹护腕
    Array(1082493, 3000, "未定义", "永久"), //海豹白白手套
    Array(1082581, 3000, "未定义", "永久"), //巧克力发带装饰
    Array(1082549, 3000, "未定义", "永久"), //咯咯嗒手套
    Array(1082503, 3000, "未定义", "永久"), //圣洁天使手镯
    Array(1082548, 3000, "未定义", "永久"), //星星手镯
    Array(1082502, 3000, "未定义", "永久"), //蓝缎带猫咪爪
    Array(1072336, 3000, "未定义", "永久"), //足球钉鞋
    Array(1072869, 3000, "未定义", "永久"), //时间旅行者的高跟鞋
    Array(1072924, 3000, "未定义", "永久"), //未来天使靴
    Array(1072913, 3000, "未定义", "永久"), //制服皮鞋
    Array(1072931, 3000, "未定义", "永久"), //爱丽丝鞋子
    Array(1072911, 3000, "未定义", "永久"), //肃清者暗靴
    Array(1072897, 3000, "未定义", "永久"), //蓝色鹿皮鞋
    Array(1072901, 3000, "未定义", "永久"), //五彩珠鞋
    Array(1072876, 3000, "未定义", "永久"), //卡卡奥熊掌鞋
    Array(1072917, 3000, "未定义", "永久"), //小马乖乖鞋
    Array(1072662, 3000, "未定义", "永久"), //明星闪耀
    Array(1072820, 3000, "未定义", "永久"), //明星熊仔鞋
    Array(1072852, 3000, "未定义", "永久"), //超级巨星鞋子
    Array(1072821, 3000, "未定义", "永久"), //金铃排队鞋
    Array(1072816, 3000, "未定义", "永久"), //女妖鞋子
    Array(1072908, 3000, "未定义", "永久"), //骑马靴
    Array(1072919, 3000, "未定义", "永久"), //蓝色蝴蝶鞋
    Array(1072918, 3000, "未定义", "永久"), //粉色蝴蝶鞋
    Array(1072858, 3000, "未定义", "永久"), //黑天鹅芭蕾鞋
    Array(1072857, 3000, "未定义", "永久"), //白天鹅芭蕾鞋
    Array(1072803, 3000, "未定义", "永久"), //小恐龙云豆爪爪
    Array(1072662, 3000, "未定义", "永久"), //小恐龙绿豆爪爪
    Array(1072791, 3000, "未定义", "永久"), //蓝缎带猫咪鞋
    Array(1072388, 3000, "未定义", "永久"), //女仆礼鞋 
    Array(1072439, 3000, "未定义", "永久"), //采草莓礼鞋
    Array(1072923, 3000, "未定义", "永久"), //波点娃娃鞋
    Array(1072848, 3000, "未定义", "永久"), //血腥吊带袜
    Array(1070057, 3000, "未定义", "永久"), //岩炎拖鞋
    Array(1071026, 3000, "未定义", "永久"), //巨星潮流靴
    Array(1072662, 3000, "未定义", "永久"), //露西亚运动鞋
    Array(1072407, 3000, "未定义", "永久"), //HELLO喵喵拖
    Array(1072438, 3000, "未定义", "永久"), //小嫩叶鞋
    Array(1072437, 3000, "未定义", "永久"), //PB拖拖
    Array(1072482, 3000, "未定义", "永久"), //熊猫拖
    Array(1072483, 3000, "未定义", "永久"), //白色登山鞋
    Array(1072484, 3000, "未定义", "永久"), //黑猫拖
    Array(1072507, 3000, "未定义", "永久"), //银色脚链
    Array(1072514, 3000, "未定义", "永久"), //天使翅膀帆布鞋
    Array(1072515, 3000, "未定义", "永久"), //狮子宝宝拖
    Array(1072516, 3000, "未定义", "永久"), //新手小鸡拖
    Array(1072517, 3000, "未定义", "永久"), //天使羽翼
    Array(1072531, 3000, "未定义", "永久"), //考拉拖鞋
    Array(1072663, 3000, "未定义", "永久"), //蓝色天使鞋
    Array(1072749, 3000, "未定义", "永久"), //泡泡巧克力鞋子
    Array(1072448, 3000, "未定义", "永久")//皇家彩虹鞋

    );


var status = 0;
var xx = -1;
var jiage = -1;

function start() {
    status = -1;
    action(1, 0, 0);
}


function action(mode, type, selection) {
    if (mode == -1) {
        cm.sendOk("#b好的,下次再见.");
        cm.dispose();
    } else {

        if (mode == 0) {
            cm.sendOk("#b好的,下次再见.");
            cm.dispose();
            return;
        }

        if (mode == 1) {
            status++;
        } else {
            status--;
        }

        //---------------------------------------------------------------------------------

        if (status == 0) {

            var add = "#r钓鱼积分换购区：\r\n\r\n";

            //add += "   您当前位置:#b商城首页#k#r\r\n\r\n\r\n";

            //add += "" + sss + "\r\n   ";

            add += "#L0##e#k钓鱼积分商城#l ";

            cm.sendSimple(add);

        ///////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 1) {

            if (selection == 0) {

                var add = "欢迎来到#r#eMapleStory#k,这里是钓鱼积分兑换区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城#k\r\n\r\n";

                //add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#b";

             //   add += "#L1#消耗用品#l ";

                add += "#L2#精美道具#l ";

                //		add += "#L3#本周推荐#l ";

                add += "#L4#兑换母矿#l ";

                //add += "#L5#购买矿石#l ";

                add += "#L6#精品椅子#l ";

                //add += "#L7#精美披风#l \r\n";

                //add += "#L8#精美帽子#l ";

                //add += "#L9#精美饰品#l ";

                //add += "#L10#其他物品#l ";

                //add += "#L13#情侣套装#l \r\n";

                //add += "#L12#我是女神#l ";

                //add += "#L11#我是土豪#l ";

                //add += "#L14#手套鞋子#l \r\n";

                cm.sendSimple(add);

            }

        //////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 2) {

            if (selection == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美时装#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jmsz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsz[i][0] + "##z" + jmsz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jmsz[i][1] + " #d    使用期限:#r " + jmsz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 1

            } else if (selection == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美名片#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jzmp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jzmp[i][0] + "##z" + jzmp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jzmp[i][1] + " #d    使用期限:#r " + jzmp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 2


            } else if (selection == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b本周推荐#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "\r\n#b";

                for (var i = 0; i < tjId.length; i++) {

                    add += "\r\n#L" + i + "##v" + tjId[i][0] + "##z" + tjId[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + tjId[i][1] + " #d    使用期限:#r " + tjId[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 3;

            } else if (selection == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b使用消耗#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "\r\n#b";

                for (var i = 0; i < syxh.length; i++) {

                    add += "\r\n#L" + i + "##v" + syxh[i][0] + "##z" + syxh[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + syxh[i][1] + " #d    购买数量:#r " + syxh[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 4;

            } else if (selection == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b宠物系列#k\r\n\r\n";
                add += "   宠物内容如果有加BUFF.增益效果.加攻击力的一律是无效技能！\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "\r\n#b";

                for (var i = 0; i < xswp.length; i++) {

                    add += "\r\n#L" + i + "##v" + xswp[i][0] + "##z" + xswp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + xswp[i][1] + " #d    购买数量:#r " + xswp[i][2] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 5


            } else if (selection == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美武器#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jmwq.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmwq[i][0] + "##z" + jmwq[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jmwq[i][1] + " #d    使用期限:#r " + jmwq[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 6


            } else if (selection == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美披风#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jmpf.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmpf[i][0] + "##z" + jmpf[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jmpf[i][1] + " #d    使用期限:#r " + jmpf[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 7


            } else if (selection == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美帽子#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jmmz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmmz[i][0] + "##z" + jmmz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jmmz[i][1] + " #d    使用期限:#r " + jmmz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 8

            } else if (selection == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美饰品#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < jmsp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsp[i][0] + "##z" + jmsp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + jmsp[i][1] + " #d    使用期限:#r " + jmsp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 9


            } else if (selection == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>其他物品#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < qtwp.length; i++) {

                    add += "\r\n#L" + i + "##v" + qtwp[i][0] + "##z" + qtwp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + qtwp[i][1] + " #d    使用期限:#r " + qtwp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 10

            } else if (selection == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>我是高富帅#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < gfs.length; i++) {

                    add += "\r\n#L" + i + "##v" + gfs[i][0] + "##z" + gfs[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + gfs[i][1] + " #d    使用期限:#r " + gfs[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 11


            } else if (selection == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>我是女神#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < ns.length; i++) {

                    add += "\r\n#L" + i + "##v" + ns[i][0] + "##z" + ns[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + ns[i][1] + " #d    使用期限:#r " + ns[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 12


            } else if (selection == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>情侣套装#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < qltz.length; i++) {

                    add += "\r\n#L" + i + "##v" + qltz[i][0] + "##z" + qltz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + qltz[i][1] + " #d    使用期限:#r " + qltz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 13


            } else if (selection == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>手套鞋子#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n#b";

                for (var i = 0; i < stxz.length; i++) {

                    add += "\r\n#L" + i + "##v" + stxz[i][0] + "##z" + stxz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要钓鱼积分:#r " + stxz[i][1] + " #d    使用期限:#r " + stxz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 14

            }

        ////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 3) {

            if (xx == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美时装#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsz[selection][0] + "# #z" + jmsz[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jmsz[selection][1] + " #d    使用期限:#r " + jmsz[selection][3] + "\r\n                              ";

                add += "   #L1#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美名片#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jzmp[selection][0] + "# #z" + jzmp[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jzmp[selection][1] + " #d    使用期限:#r " + jzmp[selection][3] + "\r\n                              ";

                add += "   #L2#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b本周推荐#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "\r\n\r\n#d";

                add += "   物品:#v" + tjId[selection][0] + "# #z" + tjId[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r" + tjId[selection][1] + " #d    使用期限:#r " + tjId[selection][3] + "\r\n                              ";

                add += "   #L3#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b使用消耗#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "\r\n\r\n#d";

                add += "   物品:#v" + syxh[selection][0] + "# #z" + syxh[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r" + syxh[selection][1] + " #d    购买数量:#r " + syxh[selection][3] + "\r\n                              ";

                add += "   #L4#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b限时物品#k\r\n\r\n";

                add += "   物品:#v" + xswp[selection][0] + "# #z" + xswp[selection][0] + "##k\r\n\r\n";

                add += "   需要钓鱼积分:#r" + xswp[selection][1] + " #d        使用期限:#r " + xswp[selection][2] + "\r\n";

                add += "   #L5#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }


            if (xx == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美武器#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmwq[selection][0] + "# #z" + jmwq[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jmwq[selection][1] + " #d    使用期限:#r " + jmwq[selection][3] + "\r\n                              ";

                add += "   #L6#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美披风#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmpf[selection][0] + "# #z" + jmpf[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jmpf[selection][1] + " #d    使用期限:#r " + jmpf[selection][3] + "\r\n                              ";

                add += "   #L7#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }


            if (xx == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美帽子#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmmz[selection][0] + "# #z" + jmmz[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jmmz[selection][1] + " #d    使用期限:#r " + jmmz[selection][3] + "\r\n                              ";

                add += "   #L8#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>精美饰品#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsp[selection][0] + "# #z" + jmsp[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + jmsp[selection][1] + " #d    使用期限:#r " + jmsp[selection][3] + "\r\n                              ";

                add += "   #L9#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>其他物品#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + qtwp[selection][0] + "# #z" + qtwp[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + qtwp[selection][1] + " #d    使用期限:#r " + qtwp[selection][3] + "\r\n                              ";

                add += "   #L10#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>我要当高富帅#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + gfs[selection][0] + "# #z" + gfs[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + gfs[selection][1] + " #d    使用期限:#r " + gfs[selection][3] + "\r\n                              ";

                add += "   #L11#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>我是女神#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + ns[selection][0] + "# #z" + ns[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + ns[selection][1] + " #d    使用期限:#r " + ns[selection][3] + "\r\n                              ";

                add += "   #L12#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>情侣套装#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + qltz[selection][0] + "# #z" + qltz[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + qltz[selection][1] + " #d    使用期限:#r " + qltz[selection][3] + "\r\n                              ";

                add += "   #L13#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b钓鱼积分商城>>手套鞋子#k\r\n\r\n";

                add += "   当前钓鱼积分余额:#r" + cm.getFishingJF() + "#k\r\n\r\n#d";

                add += "   物品:#v" + stxz[selection][0] + "# #z" + stxz[selection][0] + "#\r\n\r\n";

                add += "   需要钓鱼积分:#r " + stxz[selection][1] + " #d    使用期限:#r " + stxz[selection][3] + "\r\n                              ";

                add += "   #L14#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

        ///////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 4) {


            if (selection == 1) {
                if (cm.getFishingJF() >= jmsz[jiage][1]) {
                    //cm.gainItem(jmsz[jiage][0], 1);
					item = cm.gainGachaponItem(jmsz[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jmsz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 2) {
                if (cm.getFishingJF() >= jzmp[jiage][1]) {
					item = cm.gainGachaponItem(jzmp[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jzmp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 3) {
                if (cm.getFishingJF() >= tjId[jiage][1]) {
                    cm.addFishingJF(tjId[jiage][1]);
                    var ii = server.MapleItemInformationProvider.getInstance();
                    var type = ii.getInventoryType(tjId[jiage][0]);
                    var toDrop = ii.randomizeStats(ii.getEquipById(tjId[jiage][0])).copy();
                    var temptime = new java.sql.Timestamp(java.lang.System.currentTimeMillis() + tjId[jiage][4]);
                    toDrop.setExpiration(temptime);
                    toDrop.setLocked(1);
                    cm.getPlayer().getInventory(type).addItem(toDrop);
                    cm.getC().getSession().write(tools.MaplePacketCreator.addInventorySlot(type, toDrop));
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 4) {
                if (cm.getFishingJF() >= syxh[jiage][1]) {
					item = cm.gainGachaponItem(syxh[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(syxh[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请登陆网站冲值.");
                    cm.dispose();
                }


            } else if (selection == 5) {
                if (cm.getFishingJF() >= xswp[jiage][1]) {
                    cm.addFishingJF(xswp[jiage][1]);
					cm.gainPet(xswp[jiage][0],xswp[jiage][2],1,100,100,90);
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 6) {
                if (cm.getFishingJF() >= jmwq[jiage][1]) {
					item = cm.gainGachaponItem(jmwq[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jmwq[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 7) {
                if (cm.getFishingJF() >= jmpf[jiage][1]) {
					item = cm.gainGachaponItem(jmpf[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jmpf[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 8) {
                if (cm.getFishingJF() >= jmmz[jiage][1]) {
					item = cm.gainGachaponItem(jmmz[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jmmz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 9) {
                if (cm.getFishingJF() >= jmsp[jiage][1]) {
					item = cm.gainGachaponItem(jmsp[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(jmsp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 10) {
                if (cm.getFishingJF() >= qtwp[jiage][1]) {
					item = cm.gainGachaponItem(qtwp[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(qtwp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 11) {
                if (cm.getFishingJF() >= gfs[jiage][1]) {
					item = cm.gainGachaponItem(gfs[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(gfs[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 12) {
                if (cm.getFishingJF() >= ns[jiage][1]) {
					item = cm.gainGachaponItem(ns[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(ns[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 13) {
                if (cm.getFishingJF() >= qltz[jiage][1]) {
					item = cm.gainGachaponItem(qltz[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(qltz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 14) {
                if (cm.getFishingJF() >= stxz[jiage][1]) {
					item = cm.gainGachaponItem(stxz[jiage][0], 1, "钓鱼积分商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.addFishingJF(stxz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的钓鱼积分进行购买,请充值.");
                    cm.dispose();
                }
            }
        }
    }

}
