var status = 0;
var item = 
Array(     
			Array(1492023,50,1,1), //七星剑
			Array(1492025,50,1,1), //七星剑
			Array(1302031,110,1,1), //七星剑
			Array(1422039,110,1,1), //圣诞六翼天使武器(双手钝器)
			Array(1442023,300,1,1), //黑拖把
			Array(1302049,25,1,1), //光线鞭子
			Array(1302064,300,1,1), //枫叶突击剑
			Array(1302063,60,1,1), //火焰刀
			Array(1302080,200,1,1), //霓虹鞭子
			Array(1302084,200,1,1), //火柴
			Array(1302085,200,1,1), //叉子
			Array(1302087,200,1,1), //火炬
			Array(1302128,200,1,1), //蓝火柴
			Array(1302129,200,1,1), //蛋糕叉子
			Array(1322051,100,1,1), //七夕
			Array(1332021,200,1,1), //乌龙茶
			Array(1332032,100,1,1), //圣诞树
			Array(1332053,100,1,1), //野外
			Array(1372017,100,1,1), //路灯
			Array(1382015,100,1,1), //毒蘑菇
			Array(1382016,100,1,1), //毒菇
			Array(1402013,100,1,1), //白日剑
			Array(1402029,100,1,1), //鬼次
			Array(1402044,105,1,1), //南瓜灯
			Array(1402063,10,1,1), //樱花伞
			Array(1432008,200,1,1), //海神叉
			Array(1432009,200,1,1), //精灵枪
			Array(1432013,200,1,1), //南瓜枪
			Array(1302061,150,1,1),//蔓藤鞭子
			Array(2040017,80,1,1), //头盔命中率卷轴60%
			Array(2040014,80,1,1), //头盔命中率诅咒卷轴70% 
			Array(2040013,80,1,1), //头盔智力卷轴30
			Array(2040012,80,1,1), //头盔智力卷轴70
			Array(2040105,80,1,1), //脸部装饰回避率卷轴10%
			Array(2040106,80,1,1), //脸部装饰回避率卷轴60%
			Array(2040108,80,1,1), //脸部装饰回避率诅咒卷轴30% 
			Array(2040109,80,1,1), //脸部装饰回避率诅咒卷轴70% 
			Array(2040200,80,1,1), //眼部装饰命中率卷轴10%
			Array(2040201,80,1,1), //眼部装饰命中率卷轴60%
			Array(2040203,80,1,1), //眼部装饰命中率诅咒卷轴30% 
			Array(2040204,80,1,1), //眼部装饰命中率诅咒卷轴70%
			Array(2040205,80,1,1), //眼部装饰智力卷轴10%
			Array(2040206,80,1,1), //眼部装饰智力卷轴60%
			Array(2040208,80,1,1), // 眼部装饰智力诅咒卷轴30%
			Array(2040209,80,1,1), //眼部装饰智力诅咒卷轴70%
			Array(2040301,80,1,1), //耳环智力卷轴 60
			Array(2040302,80,1,1), //耳环智力卷轴 10
			Array(2040303,10,1,1), //耳环智力诅咒卷轴必成
			Array(2040304,80,1,1), //耳环智力诅咒卷轴70
			Array(2040305,80,1,1), //耳环智力诅咒卷轴30
			Array(2040306,80,1,1), //耳环敏捷卷轴70
			Array(2040307,80,1,1), //耳环敏捷卷轴30
			Array(2040406,80,1,1), //上衣力量卷轴70%
			Array(2040407,80,1,1), //上衣力量卷轴30
			Array(2040410,80,1,1), //上衣运气诅咒卷轴70%
			Array(2040411,80,1,1), //上衣运气诅咒卷轴30%
			Array(2040501,80,1,1), //全身铠甲敏捷卷轴60
			Array(2040506,10,1,1), //全身铠甲敏捷卷轴(必成)
			Array(2040509,80,1,1), //全身铠甲敏捷卷轴30
			Array(2040513,80,1,1), //全身铠甲智力卷轴60
			Array(2040518,80,1,1), //全身铠甲智力卷轴70
			Array(2040519,80,1,1), //全身铠甲智力卷轴30
			Array(2040610,80,1,1), //裤裙敏捷诅咒卷轴70
			Array(2040611,80,1,1), //裤裙敏捷诅咒卷轴30
			Array(2040613,80,1,1), //裤裙敏捷卷轴60%
			Array(2040704,80,1,1), //鞋子跳跃卷轴60
			Array(2040705,80,1,1), //鞋子跳跃卷轴10
			Array(2040710,60,1,1), //鞋子跳跃卷轴(必成)
			Array(2040715,80,1,1), //鞋子跳跃卷轴30
			Array(2040804,80,1,1), //手套攻击卷轴60
			Array(2040811,80,1,1), //手套攻击卷轴30
			Array(2040810,80,1,1), //手套攻击卷轴70
			Array(2040807,50,1,1), //手套攻击卷轴(必成)
			Array(2040805,80,1,1), //手套攻击卷轴10
			Array(2040816,80,1,1), // 手套魔力卷轴10%
			Array(2040817,80,1,1), //手套魔力卷轴60%
			Array(2040815,80,1,1), //手套魔力卷轴30%
			Array(2040922,80,1,1), //盾牌魔力诅咒卷轴30%
			Array(2040919,80,1,1), //盾牌魔力诅咒卷轴60%
			Array(2040921,80,1,1), //盾牌魔力诅咒卷轴70%
			Array(2040914,80,1,1), // 盾牌攻击卷轴60%
			Array(2040916,70,1,1), //盾牌攻击卷轴70%
			Array(2040917,70,1,1), //盾牌攻击诅咒卷轴30%
			Array(2041013,90,1,1), //披风力量卷轴60
			Array(2041016,90,1,1), //披风智力卷轴60
			Array(2041019,90,1,1), //披风敏捷卷轴60
			Array(2041022,80,1,1), //披风运气卷轴60
			Array(1402014,10,1,1), //温度计
			Array(2043005,80,1,1), //单手剑攻击诅咒卷轴30
			Array(2043003,20,1,1), //单手剑攻击诅咒卷轴(必成)
			Array(2044005,80,1,1), //双手剑攻击诅咒卷轴30
			Array(2044003,10,1,1), //双手剑攻击诅咒卷轴(必成)
			Array(2044305,80,1,1), //枪攻击诅咒卷轴30
			Array(2044303,20,1,1), //枪攻击诅咒卷轴(必成)
			Array(2044405,80,1,1), //矛攻击诅咒卷轴30
			Array(2044403,20,1,1), //矛攻击诅咒卷轴(必成)
			Array(2044503,20,1,1), //弓攻击诅咒卷轴(必成)
			Array(2044505,80,1,1), //弓攻击诅咒卷轴30
			Array(2044605,80,1,1), //弩攻击诅咒卷轴30
			Array(2044603,20,1,1), //弩攻击诅咒卷轴(必成)
			Array(2044705,80,1,1), //拳套攻击诅咒卷轴30
			Array(2044703,20,1,1), //拳套攻击诅咒卷轴(必成)
			Array(1082163,30,1,1), //红猎人手套
			Array(1082164,30,1,1), //蓝色元素手套
			Array(1082167,30,1,1), //黑色格丽纳手套
			Array(1082168,30,1,1), //青龙手套
			Array(1082175,300,1,1), //马绍尔手套(赤)
			Array(1082176,300,1,1), //马绍尔手套(青)
			Array(1082177,300,1,1), //马绍尔手套(紫
			Array(1082178,300,1,1), //马绍尔手套(桃)
			Array(1082179,30,1,1), //马绍尔手套(黄)
			Array(1082234,200,1,1), //永恒定边手套
			Array(1082235,200,1,1), //永恒逍遥手套
			Array(1082236,200,1,1), //永恒白云手套
			Array(1082237,200,1,1), //永恒探云手套
			Array(1082238,200,1,1), //永恒抚浪手套
			Array(1082239,200,1,1), //重生定边手套
			Array(1082240,200,1,1), //重生逍遥手套
			Array(1082241,200,1,1), //重生白云手套
			Array(1082242,200,1,1), //重生探云手套
			Array(1082243,200,1,1), //重生抚浪手套
                        Array(1302032,300,1,1), //烈焰之剑
                        Array(1302059,100,1,1), //狂龙闪电剑
			Array(1302081,10,1,1), //永恒破甲剑
			Array(1302086,10,1,1), //重生破甲剑
			Array(1302104,100,1,1), //鱿鱼剑
			Array(1302105,100,1,1), //圣诞六翼天使武器(单手剑)
			Array(1312037,10,1,1), //永恒断蚺斧
			Array(1312038,10,1,1), //重生断蚺斧
			Array(1312039,100,1,1), //圣诞六翼天使武器(单手斧)
			Array(1332047,300,1,1), //黑精灵拳刃
			Array(1332049,100,1,1), //蝉翼龙牙破
			Array(1332050,100,1,1), //半月龙鳞裂
			Array(1332051,100,1,1), //黄金双牙钩
			Array(1332052,100,1,1), //阴风碎魂刃
			Array(1332053,100,1,1), //野外烧烤串
			Array(1332054,100,1,1), //闪电飞刀
			Array(1332055,100,1,1), //枫叶锁魄铗
			Array(1332056,100,1,1), //枫叶追魂刺
			Array(1332074,10,1,1), //永恒断首刃
			Array(1332075,10,1,1), //重生狂鲨锯
			Array(1332076,10,1,1), //重生断首刃
			Array(1332081,100,1,1), //圣诞六翼天使武器(短剑)
			Array(1372009,300,1,1), //慈悲为怀
			Array(1372010,300,1,1), //嗜魂法杖
			Array(1372030,300,1,1), //天使之翼
			Array(1372031,300,1,1), //圣贤短杖
			Array(1372032,100,1,1), //佘太君龙杖
			Array(1372033,300,1,1), //圣贤短杖
			Array(1372034,300,1,1), //枫叶仙姬杖
			Array(1372035,100,1,1), //火灵珠短杖
			Array(1372036,100,1,1), //毒灵珠短杖
			Array(1372037,100,1,1), //冰灵珠短杖
			Array(1372038,100,1,1), //雷灵珠短杖
			Array(1372039,100,1,1), //爆炎之杖
			Array(1372040,100,1,1), //剧毒之杖
			Array(1372041,100,1,1), //寒冰之杖
			Array(1372042,100,1,1), //狂雷之杖
			Array(1372043,300,1,1), //初级魔法师的杖
			Array(1372044,10,1,1), //永恒蝶翼杖
			Array(1372045,10,1,1), //重生蝶翼杖
			Array(1372046,300,1,1), //圣诞六翼天使武器(短杖)
			Array(1382045,100,1,1), //火灵珠长杖
			Array(1382046,100,1,1), //毒灵珠长杖
			Array(1382047,100,1,1), //冰灵珠长杖
			Array(1382048,100,1,1), //雷灵珠长杖
			Array(1382049,10,1,1), //朱雀长杖
			Array(1382050,10,1,1), //玄武长杖
			Array(1382051,10,1,1), //白虎长杖
			Array(1382052,10,1,1), //青龙长杖
			Array(1382057,10,1,1), //永恒冰轮杖
			Array(1382059,10,1,1), //重生冰轮杖
			Array(1382062,300,1,1), //圣诞六翼天使武器(长杖)
			Array(1402033,300,1,1), //霸王剑
			Array(1402034,300,1,1), //亚历山大之剑
			Array(1402035,300,1,1), //斩天刀
			Array(1402036,50,1,1), //飞龙巨剑
			Array(1402037,10,1,1), //龙背刃
			Array(1402039,100,1,1), //枫叶枭首剑
			Array(1402040,300,1,1), //枫叶3年旗
			Array(1402044,100,1,1), //南瓜灯笼
			Array(1402046,10,1,1), //永恒玄冥剑
			Array(1402047,10,1,1), //重生玄冥剑
			Array(1402053,100,1,1), //圣诞六翼天使武器(双手剑)
			Array(1442067,10,1,1), //重生神光戟
			Array(1452022,300,1,1), //枫叶弓
			Array(1452023,300,1,1), //曹家之弓
			Array(1452025,300,1,1), //蓝色梅杜斯
			Array(1452026,300,1,1), //黑色梅杜斯
			Array(1452044,100,1,1), //金龙振翅弓
			Array(1452045,300,1,1), //枫叶HAPPY弓
			Array(1452057,10,1,1), //永恒惊电弓
			Array(1452059,10,1,1), //重生惊电弓
			Array(1452062,300,1,1), //圣诞六翼天使武器(弓)
			Array(1462037,300,1,1), //黑暗弩弓
			Array(1462039,100,1,1), //黄金飞龙弩
			Array(1462040,300,1,1), //枫叶击星弩
			Array(1462041,300,1,1), //枫叶3年旗
			Array(1462043,300,1,1), //粉色花边游泳圈
			Array(1462050,10,1,1), //永恒冥雷弩
			Array(1462051,10,1,1), //重生冥雷弩
			Array(1462056,300,1,1), //圣诞六翼天使武器(弩)
			Array(1472049,300,1,1), //龙之拳
			Array(1472051,100,1,1), //寒木升龙拳
			Array(1472052,50,1,1), //碧水落龙拳
			Array(1472053,300,1,1), //逆龙咆哮拳
			Array(1472054,300,1,1), //信玄
			Array(1472055,300,1,1), //枫叶定天拳
			Array(1472068,10,1,1), //永恒大悲赋
			Array(1472071,100,1,1), //重生大悲赋
			Array(1472077,300,1,1), //圣诞六翼天使武器(拳套)
			Array(1482023,300,1,1), //永恒孔雀翎
			Array(1482024,300,1,1), //重生孔雀翎
			Array(1032026,40,1,1), //黄水晶耳环
			Array(1032028,100,1,1), //红水晶耳环
			Array(1032035,300,1,1), //枫叶耳环
			Array(1032047,200,1,1), //可乐耳环
			Array(1032055,300,1,1), //工作人员C的旧收信机
			Array(1032056,300,1,1), //工作人员C的旧收信机
			Array(1032057,300,1,1), //工作人员C的旧收信机
			Array(1032058,300,1,1), //工作人员C钛质收信机
			Array(1002695,10,1,1), //幽灵帽
			Array(1002699,10,1,1), //南瓜帽子
			Array(1002707,10,1,1), //假面绅士帽子
			Array(1002723,100,1,1), //月饼帽
			Array(1002760,10,1,1), //地球帽
			Array(1002761,10,1,1), //枫叶面具
			Array(1002773,10,1,1), //金龙头盔
			Array(1002776,10,1,1), //永恒冠军盔
			Array(1002777,10,1,1), //永恒玄妙帽
			Array(1002778,10,1,1), //永恒霓翎帽
			Array(1002779,10,1,1), //永恒迷踪帽
			Array(1002780,10,1,1), //永恒海王星
			Array(1002790,10,1,1), //重生冠军盔
			Array(1002791,10,1,1), //重生玄妙帽
			Array(1002792,10,1,1), //重生霓翎帽
			Array(1002793,10,1,1), //重生迷踪帽
			Array(1002794,10,1,1), //重生海王星
			Array(2280009,10,1,1), //金龙头盔
			Array(2280010,10,1,1), //永恒冠军盔
			Array(2290000,10,1,1), //永恒玄妙帽
			Array(2290001,10,1,1), //永恒霓翎帽
			Array(2290002,10,1,1), //永恒迷踪帽
			Array(2290003,10,1,1), //永恒海王星
			Array(2290004,10,1,1), //重生冠军盔
			Array(2290005,10,1,1), //重生玄妙帽
			Array(2290006,10,1,1), //重生霓翎帽
			Array(2290007,10,1,1), //重生迷踪帽
			Array(2290008,10,1,1), //重生海王星
			Array(2290009,50,1,1), //
			Array(2290010,50,1,1), //
			Array(2290011,50,1,1), //
			Array(2290012,50,1,1), //
			Array(2290013,50,1,1), //
			Array(2290014,50,1,1), //
			Array(2290015,50,1,1), //
			Array(2290016,50,1,1), //
			Array(2290017,50,1,1), //
			Array(2290022,50,1,1), //
			Array(2290026,50,1,1), //
			Array(2290027,50,1,1), //
			Array(2290031,50,1,1), //
			Array(2290032,50,1,1), //
			Array(2290033,50,1,1), //
			Array(2290036,50,1,1), //
			Array(2290037,50,1,1), //
			Array(2290040,50,1,1), //
			Array(2290041,50,1,1), //
			Array(2290046,50,1,1), //
			Array(2290047,50,1,1), //
			Array(2290048,50,1,1), //
			Array(2290049,50,1,1), //
			Array(2290050,50,1,1), //
			Array(2290051,50,1,1), //
			Array(2290052,50,1,1), //
			Array(2290053,50,1,1), //
			Array(2290060,50,1,1), //
			Array(2290061,50,1,1), //
			Array(2290076,50,1,1), //
			Array(2290077,50,1,1), //
			Array(2290078,50,1,1), //
			Array(2290079,50,1,1), //
			Array(2290084,50,1,1), //
			Array(2290085,50,1,1), //
			Array(2290088,50,1,1), //
			Array(2290089,50,1,1), //
			Array(2290090,50,1,1), //
			Array(2290091,50,1,1), //
			Array(2290092,50,1,1), //
			Array(2290093,50,1,1), //
			Array(2290094,50,1,1), //
			Array(2290095,50,1,1), //
			Array(2290096,50,1,1), //
			Array(2290062,50,1,1), //
			Array(2290063,50,1,1) //

);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			if (cm.haveItem(4032226)) {
var str1 = "";	
           for (var i = 0; i < item.length; i++){
                   str1 += "#v"+item[i][0]+"#";
            }
				cm.sendYesNo("这里是可以抽取许多好东西哦！首先,你需要有#v4032226#.(在线活动可以得到)即可进行.\r\n\r\n比赛所有奖品如下#r[真实,无欺骗,100%中奖]:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < item.length; i++){
                   str1 += "#v"+item[i][0]+"#";
            }
				cm.sendOk("这里是可以抽取许多好东西哦！首先,你需要有#v4032226#.(在线活动可以得到)即可进行.\r\n\r\n比赛所有奖品如下#r[真实,无欺骗,100%中奖]:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < item.length; i++) {
            if (item[i][1] >= chance) {
                finalitem.push(item[i]);
            }
        }
        if (finalitem.length != 0) {
            var itema;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            itema = cm.gainGachaponItem(itemId, quantity, "黄金猪抽奖", notice);
            if (itema != -1) {
                cm.gainItem(4032226, -1);
                cm.sendOk("你获得了 #b#t" + itema + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4032226##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
			} else {							
				cm.dispose();
			}
		}
	}
}
