//load("nashorn:mozilla_compat.js");

//importPackage(Packages.java.util);
//importPackage(Packages.client);
//importPackage(Packages.server);


var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var item;


var jmsz = Array(
    Array(1052997, 3000, "未定义", "永久"), //北极保暖套服 
    Array(1053006, 3000, "未定义", "永久"), //暖绒兔长裙
    Array(1052948, 3000, "未定义", "永久"), //奥尔卡的睡袍
    Array(1052940, 3000, "未定义", "永久"), //春日阳光套衫
    Array(1052925, 3000, "未定义", "永久"), //红粉飘飘连衣裙
    Array(1052924, 3000, "未定义", "永久"), //贵族花纹套服
    Array(1052923, 3000, "未定义", "永久"), //黑猫连帽衫
    Array(1052921, 3000, "未定义", "永久"), //蓝色金鱼全身服
    Array(1052922, 3000, "未定义", "永久"), //红色金鱼全身服
    Array(1052919, 3000, "未定义", "永久"), //西红柿外套
    Array(1052910, 3000, "未定义", "永久"), //水晶喵喵全身服
    Array(1052911, 3000, "未定义", "永久"), //水晶喵喵连衣裙
    Array(1052912, 3000, "未定义", "永久"), //夹棉时尚王
    Array(1052916, 3000, "未定义", "永久"), //弓凛的花衣裳
    Array(1052917, 3000, "未定义", "永久"), //红月的夜行衣
    Array(1052909, 3000, "未定义", "永久"), //蜜蜂外套
    Array(1052903, 3000, "未定义", "永久"), //白色管家礼服
    Array(1052901, 3000, "未定义", "永久"), //时髦的领结套服
    Array(1052899, 3000, "未定义", "永久"), //红色啵啵鼠连帽套服（黑色）
    Array(1052900, 3000, "未定义", "永久"), //红色啵啵鼠连帽套服（红色）
    Array(1052892, 3000, "未定义", "永久"), //呆萌兔背带裤
    Array(1052896, 3000, "未定义", "永久"), //可爱小绵羊服
    Array(1052865, 3000, "未定义", "永久"), //小恐龙套服
    Array(1052595, 3000, "未定义", "永久"), //小恐龙套服
    Array(1052852, 3000, "未定义", "永久"), //暴走斯乌连身服
    Array(1052853, 3000, "未定义", "永久"), //奥尔卡的病号服
    Array(1052850, 3000, "未定义", "永久"), //毛绒鼠鼠服
    Array(1052841, 3000, "未定义", "永久"), //甜柿服
    Array(1052842, 3000, "未定义", "永久"), //萌犬套装(裙)
    Array(1052843, 3000, "未定义", "永久"), //萌犬套装(裤)
    Array(1052844, 3000, "未定义", "永久"), //微笑玉米背带裤
    Array(1052845, 3000, "未定义", "永久"), //宽松运动服
    Array(1052846, 3000, "未定义", "永久"), //桃太郎的背带裤
    Array(1052781, 3000, "未定义", "永久"), //红色小马憨憨背带裤
    Array(1052782, 3000, "未定义", "永久"), //蓝色小马憨憨背带裤
    Array(1052772, 3000, "未定义", "永久"), //2014制服
    Array(1052762, 3000, "未定义", "永久"), //香蕉背带套装
    Array(1052754, 3000, "未定义", "永久"), //嘟嘟熊连体衣
    Array(1052726, 3000, "未定义", "永久"), //僵尸新娘全身装
    Array(1052727, 3000, "未定义", "永久"), //快乐连体衫
    Array(1052728, 3000, "未定义", "永久"), //快乐连衣裙
    Array(1052731, 3000, "未定义", "永久"), //黑色可爱游泳服
    Array(1052724, 3000, "未定义", "永久"), //小马乖乖套服
    Array(1052697, 3000, "未定义", "永久"), //雪之女神连身裙
    Array(1052675, 3000, "未定义", "永久"), //万圣节幻影帽子套服
    Array(1052671, 3000, "未定义", "永久"), //特大号白衬衫
    Array(1052661, 3000, "未定义", "永久"), //小鸡玩偶服
    Array(1052666, 3000, "未定义", "永久"), //巧克力绵羊玩偶服
    Array(1052667, 3000, "未定义", "永久"), //小绵羊朵朵玩偶服
    Array(1052656, 3000, "未定义", "永久"), //白天鹅芭蕾服
    Array(1052657, 3000, "未定义", "永久"), //黑天鹅芭蕾服
    Array(1052626, 3000, "未定义", "永久"), //海洋风条纹装
    Array(1052603, 3000, "未定义", "永久"), //武陵武道馆道服
    Array(1052601, 3000, "未定义", "永久"), //废都高校校服
    Array(1052587, 3000, "未定义", "永久"), //小海豹玩偶服
    Array(1052586, 3000, "未定义", "永久"), //伶俐猫咪服装
    Array(1052549, 3000, "未定义", "永久"), //[MS特制]红勇士马甲
    Array(1052536, 3000, "未定义", "永久"), //水手装
    Array(1052537, 3000, "未定义", "永久"), //超级星光蜜蜂服
    Array(1052539, 3000, "未定义", "永久"), //蓝道袍
    Array(1052503, 3000, "未定义", "永久"), //凉爽夏日全身装
    Array(1052474, 3000, "未定义", "永久"), //阴阳师的礼服
    Array(1052449, 3000, "未定义", "永久"), //时尚香肠套服
    Array(1052410, 3000, "未定义", "永久"), //粉嫩花仙裙
    Array(1052412, 3000, "未定义", "永久"), //淘气王子
    Array(1052419, 3000, "未定义", "永久"), //粉娃娃裙
    Array(1052356, 3000, "未定义", "永久"), //军队TOP星星
    Array(1052370, 3000, "未定义", "永久"), //格莱特服
    Array(1052346, 3000, "未定义", "永久"), //雪花情侣男棉衣
    Array(1052346, 3000, "未定义", "永久"), //雪花情侣女棉衣
    Array(1052340, 3000, "未定义", "永久"), //理科麻辣老师
    Array(1052298, 3000, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052291, 3000, "未定义", "永久"), //户外运动装
    Array(1052290, 3000, "未定义", "永久"), //唤灵斗师套装
    Array(1052286, 3000, "未定义", "永久"), //飞行猫猫服
    Array(1052275, 3000, "未定义", "永久"), //皇家彩虹夹克
    Array(1052248, 3000, "未定义", "永久"), //暗影双刀套服
    Array(1052245, 3000, "未定义", "永久"), //小嫩叶套服
    Array(1052253, 3000, "未定义", "永久"), //青草背带裤套装
    Array(1052229, 3000, "未定义", "永久"), //中国娃娃旗袍
    Array(1052225, 3000, "未定义", "永久"), //暗夜娃娃服
    Array(1052216, 3000, "未定义", "永久"), //嫦娥裙
    Array(1052209, 3000, "未定义", "永久"), //皇家海军制服
    Array(1052200, 3000, "未定义", "永久"), //罗丽粉色娃娃套服
    Array(1052201, 3000, "未定义", "永久"), //闪亮水手外套
    Array(1052135, 3000, "未定义", "永久"), //半人马装
    Array(1052085, 3000, "未定义", "永久"), //肚兜（红色）
    Array(1052086, 3000, "未定义", "永久"), //肚兜（蓝色）
    Array(1052078, 3000, "未定义", "永久"), //泡泡袍
    Array(1052067, 3000, "未定义", "永久"), //木乃伊服
    Array(1051456, 3000, "未定义", "永久"), //爱情蓝鸟连衣裙
    Array(1051457, 3000, "未定义", "永久"), //海军风校服
    Array(1051459, 3000, "未定义", "永久"), //农夫甜心派
    Array(1051464, 3000, "未定义", "永久"), //天蓝微笑裙
    Array(1051454, 3000, "未定义", "永久"), //小粉粉全身服
    Array(1051453, 3000, "未定义", "永久"), //小熊连衣裙
    Array(1051452, 3000, "未定义", "永久"), //橘色小短裙
    Array(1051448, 3000, "未定义", "永久"), //莲花学院指定校服
    Array(1051441, 3000, "未定义", "永久"), //精灵兔小妹
    Array(1051440, 3000, "未定义", "永久"), //人鱼传说
    Array(1050371, 3000, "未定义", "永久"), //人鱼传说
    Array(1051434, 3000, "未定义", "永久"), //花叶甜甜
    Array(1051435, 3000, "未定义", "永久"), //星光长袍女孩
    Array(1051426, 3000, "未定义", "永久"), //幻象贝拉
    Array(1051430, 3000, "未定义", "永久"), //闪耀之星纪念套服
    Array(1051425, 3000, "未定义", "永久"), //蝴蝶结黄色连衣裙
    Array(1051424, 3000, "未定义", "永久"), //圣诞女孩子服
    Array(1051407, 3000, "未定义", "永久"), //冒险岛学院女泳衣
    Array(1051408, 3000, "未定义", "永久"), //蝴蝶之恋套服
    Array(1051410, 3000, "未定义", "永久"), //森林露营服
    Array(1051415, 3000, "未定义", "永久"), //拉拉队服
    Array(1051389, 3000, "未定义", "永久"), //纯白婚纱
    Array(1051366, 3000, "未定义", "永久"), //黄色驯师服装
    Array(1051200, 3000, "未定义", "永久"), //邦妮女孩套服
    Array(1051192, 3000, "未定义", "永久"), //海洋裹裹短裙
    Array(1051180, 3000, "未定义", "永久"), //水兵服
    Array(1050384, 3000, "未定义", "永久"), //小蓝蓝全身服
    Array(1050387, 3000, "未定义", "永久"), //海军风校服
    Array(1050389, 3000, "未定义", "永久"), //农夫甜心派
    Array(1050393, 3000, "未定义", "永久"), //天蓝微笑套服
    Array(1050364, 3000, "未定义", "永久"), //草叶甜甜
    Array(1050353, 3000, "未定义", "永久"), //法式糕点服
    Array(1050341, 3000, "未定义", "永久"), //森林露营服
    Array(1050338, 3000, "未定义", "永久"), //冒险岛学院男泳裤
    Array(1050319, 3000, "未定义", "永久"), //秋游套装
    Array(1050293, 3000, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 3000, "未定义", "永久")//蓝色小背带服
    );


var jmwq = Array(
    Array(1702105, 3000, "未定义", "永久"), //通心钥匙
    Array(1702051, 3000, "未定义", "永久"), //灯笼
    Array(1702104, 3000, "未定义", "永久"), //巨无霸冰淇淋
    Array(1702374, 3000, "未定义", "永久"), //剑豪之刃
    Array(1702212, 3000, "未定义", "永久"), //异界之器
    Array(1702091, 3000, "未定义", "永久"), //网球拍
    Array(1702115, 3000, "未定义", "永久"), //玫瑰花
    Array(1702217, 3000, "未定义", "永久"), //黄鸭子游泳圈
    Array(1702228, 3000, "未定义", "永久"), //可可香蕉
    Array(1702230, 3000, "未定义", "永久"), //冰蓝雪糕
    Array(1702237, 3000, "未定义", "永久"), //千年白狐
    Array(1702256, 3000, "未定义", "永久"), //风灵使者娃娃
    Array(1702257, 3000, "未定义", "永久"), //魂骑士娃娃
    Array(1702258, 3000, "未定义", "永久"), //炎术士娃娃
    Array(1702259, 3000, "未定义", "永久"), //奇袭者娃娃
    Array(1702260, 3000, "未定义", "永久"), //夜行者娃娃
    Array(1702261, 3000, "未定义", "永久"), //樱花棒
    Array(1702194, 3000, "未定义", "永久"), //圣火火炬
    Array(1702288, 3000, "未定义", "永久"), //豹弩游侠弩
    Array(1702318, 3000, "未定义", "永久"), //暮光雷光剑
    Array(1702319, 3000, "未定义", "永久"), //苹果绿雷光剑
    Array(1702317, 3000, "未定义", "永久"), //血红宝石雷光剑
    Array(1702320, 3000, "未定义", "永久"), //蓝灰闪电雷光剑
    Array(1702321, 3000, "未定义", "永久"), //黑暗中子星雷光剑
    Array(1702322, 3000, "未定义", "永久"), //固态黑色雷光剑
    Array(1702323, 3000, "未定义", "永久"), //翁布拉&鲁切雷光剑
    Array(1702186, 3000, "未定义", "永久"), //迪波
    Array(1702209, 3000, "未定义", "永久"), //驯鹿拐杖
    Array(1702204, 3000, "未定义", "永久"), //日本铁扇
    Array(1702203, 3000, "未定义", "永久"), //万圣节泰迪熊
    Array(1702150, 3000, "未定义", "永久"), //冰凌刀
    Array(1702149, 3000, "未定义", "永久"), //熔岩刀
    Array(1702157, 3000, "未定义", "永久"), //火烤棉花糖
    Array(1702161, 3000, "未定义", "永久"), //凶恶的狗狗
    Array(1702136, 3000, "未定义", "永久"), //雪之花
    Array(1702120, 3000, "未定义", "永久"), //比耶莫特的剑
    Array(1702118, 3000, "未定义", "永久"), //亚努斯的剑
    Array(1702119, 3000, "未定义", "永久"), //夏奇尔的剑
    Array(1702296, 3000, "未定义", "永久"), //溜溜球
    Array(1702285, 3000, "未定义", "永久"), //蓝色蝴蝶结手提包
    Array(1702302, 3000, "未定义", "永久"), //杯具
    Array(1702208, 3000, "未定义", "永久"), //搞怪鳄鱼
    Array(1702305, 3000, "未定义", "永久"), //胡萝卜武器
    Array(1702310, 3000, "未定义", "永久"), //星光魔法棒
    Array(1702374, 3000, "未定义", "永久"), //剑豪之刃
    Array(1702306, 3000, "未定义", "永久"), //花风芭蕉扇
    Array(1702379, 3000, "未定义", "永久"), //阿拉伯魔术洋灯
    Array(1702378, 3000, "未定义", "永久"), //国庆闪亮之光
    Array(1702263, 3000, "未定义", "永久"), //小灰灰猫
    Array(1702308, 3000, "未定义", "永久"), //魔术师帽子
    Array(1702298, 3000, "未定义", "永久"), //暗影刀子
    Array(1702291, 3000, "未定义", "永久"), //玲珑扇
    Array(1702293, 3000, "未定义", "永久"), //秋天旅行者背包
    Array(1702299, 3000, "未定义", "永久"), //可爱巧克力棒
    Array(1702300, 3000, "未定义", "永久"), //电蚊拍
    Array(1702328, 3000, "未定义", "永久"), //粉红天使注射器
    Array(1702329, 3000, "未定义", "永久"), //喜欢草莓
    Array(1702233, 3000, "未定义", "永久"), //彩虹毛笔
    Array(1702187, 3000, "未定义", "永久"), //蓝色极光
    Array(1702188, 3000, "未定义", "永久"), //粉色极光
    Array(1702193, 3000, "未定义", "永久"), //湿抹布
    Array(1702248, 3000, "未定义", "永久"), //圣诞武器
    Array(1702252, 3000, "未定义", "永久"), //鹰的飞舞
    Array(1702276, 3000, "未定义", "永久"), //天际之弓
    Array(1702283, 3000, "未定义", "永久"), //天界圣战手镯
    Array(1702279, 3000, "未定义", "永久"), //天界圣战之剑
    Array(1702280, 3000, "未定义", "永久"), //天界圣战巨剑
    Array(1702281, 3000, "未定义", "永久"), //天界圣战法杖
    Array(1702282, 3000, "未定义", "永久"), //天界圣战藏弓
    Array(1702362, 3000, "未定义", "永久"), //我的好友品克缤
    Array(1702324, 3000, "未定义", "永久"), //冲击波
    Array(1702323, 3000, "未定义", "永久"), //鲁切雷光剑
    Array(1702313, 3000, "未定义", "永久"), //橙色极光
    Array(1702314, 3000, "未定义", "永久"), //天堂极光
    Array(1702315, 3000, "未定义", "永久"), //斯泰拉极光
    Array(1702316, 3000, "未定义", "永久"), //动态极光
    Array(1702295, 3000, "未定义", "永久"), //扑克牌
    Array(1702348, 3000, "未定义", "永久"), //雪片
    Array(1702274, 3000, "未定义", "永久"), //神龙手套
    Array(1702301, 3000, "未定义", "永久")//兔兔魔力棒
    );


var jzmp = Array(
    Array(1112197, 3000, "未定义", "永久"), //钻石聊天戒指
    Array(1115010, 3000, "未定义", "永久"), //钻石聊天戒指
    Array(1112198, 3000, "未定义", "永久"), //黄金聊天戒指
    Array(1115011, 3000, "未定义", "永久"), //小熊猫聊天戒指
    Array(1112199, 3000, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1115015, 3000, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1112144, 3000, "未定义", "永久"), //虎喵名片戒指
    Array(1112256, 3000, "未定义", "永久"), //虎喵聊天戒指
    Array(1112261, 3000, "未定义", "永久"), //Naver对话框戒指
    Array(1112149, 3000, "未定义", "永久"), //Naver名片戒指
    Array(1112120, 3000, "未定义", "永久"), //可乐(White) 名片戒指
    Array(1112230, 3000, "未定义", "永久"), //可乐(White)聊天戒
    Array(1112272, 3000, "未定义", "永久"), //西瓜物语聊天戒指
    Array(1112160, 3000, "未定义", "永久"), //西瓜物语名片戒指
    Array(1112268, 3000, "未定义", "永久"), //猪猪聊天戒指
    Array(1112156, 3000, "未定义", "永久"), //猪猪名片戒指
    Array(1112267, 3000, "未定义", "永久"), //青蛙聊天戒指
    Array(1112155, 3000, "未定义", "永久"), //青蛙名片戒指
    Array(1112277, 3000, "未定义", "永久"), //绿光森林聊天戒指
    Array(1112165, 3000, "未定义", "永久"), //绿光森林名片戒指
    Array(1112270, 3000, "未定义", "永久"), //我爱胡子聊天戒指(红色)
    Array(1112158, 3000, "未定义", "永久"), //我爱胡子名片戒指(红色)
    Array(1112269, 3000, "未定义", "永久"), //我爱胡子聊天戒指(蓝色)
    Array(1112157, 3000, "未定义", "永久"), //我爱胡子名片戒指(蓝色)
    Array(1112278, 3000, "未定义", "永久"), //乖宝贝聊天戒指
    Array(1112166, 3000, "未定义", "永久"), //乖宝贝名片戒指
    Array(1112253, 3000, "未定义", "永久"), //木乃伊聊天戒指
    Array(1112142, 3000, "未定义", "永久"), //木乃伊名片戒指
    Array(1112257, 3000, "未定义", "永久"), //浪漫花边聊天戒指
    Array(1112145, 3000, "未定义", "永久"), //浪漫花边名片戒指
    Array(1112258, 3000, "未定义", "永久"), //青苹果之恋聊天戒指
    Array(1112146, 3000, "未定义", "永久"), //青苹果之恋名片戒指
    Array(1112263, 3000, "未定义", "永久"), //美味蛋糕聊天戒指
    Array(1112151, 3000, "未定义", "永久"), //美味蛋糕名片戒指
    Array(1112171, 3000, "未定义", "永久"), //狗狗名片戒指
    Array(1112172, 3000, "未定义", "永久"), // 狗狗名片戒指
    Array(1112173, 3000, "未定义", "永久"), //奶白兔名片戒指
    Array(1112285, 3000, "未定义", "永久"), //奶白兔LT戒指
    Array(1112174, 3000, "未定义", "永久"), //足球聊天戒指
    Array(1112175, 3000, "未定义", "永久"), //足球MP戒指
    Array(1112176, 3000, "未定义", "永久"), //旋律戒指
    Array(1112288, 3000, "未定义", "永久"), //旋律戒指
    Array(1112177, 3000, "未定义", "永久"), //进击聊天戒指
    Array(1112289, 3000, "未定义", "永久"), //进击聊天戒指
    Array(1112283, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112171, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112284, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112172, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112276, 3000, "未定义", "永久"), //XR聊天戒指
    Array(1112164, 3000, "未定义", "永久"), //XR聊天戒指
    Array(1112290, 3000, "未定义", "永久"), //MH聊天戒指
    Array(1112178, 3000, "未定义", "永久"), //MH聊天戒指
    Array(1112291, 3000, "未定义", "永久"), //XH聊天戒指
    Array(1112179, 3000, "未定义", "永久"), //XH聊天戒指
    Array(1112190, 3000, "未定义", "永久"), //AC聊天戒指
    Array(1115003, 3000, "未定义", "永久"), //AC聊天戒指
    Array(1112191, 3000, "未定义", "永久"), //MF聊天戒指
    Array(1115004, 3000, "未定义", "永久"), //MF聊天戒指
    Array(1112192, 3000, "未定义", "永久"), //BL聊天戒指
    Array(1115005, 3000, "未定义", "永久"), //BL聊天戒指
    Array(1112193, 3000, "未定义", "永久"), //gz聊天戒指
    Array(1115006, 3000, "未定义", "永久"), //gz聊天戒指
    Array(1112194, 3000, "未定义", "永久"), //GL聊天戒指
    Array(1115007, 3000, "未定义", "永久"), //GL聊天戒指
    Array(1112195, 3000, "未定义", "永久"), //KL聊天戒指
    Array(1115008, 3000, "未定义", "永久"), //KL聊天戒指
    Array(1112196, 3000, "未定义", "永久"), //CT聊天戒指
    Array(1115009, 3000, "未定义", "永久"), //CT聊天戒指
    Array(1112237, 3000, "未定义", "永久"), //小竹林聊天戒指
    Array(1112134, 3000, "未定义", "永久")//小竹林名片戒指
    );

var tjId = Array(
    Array(3010163, 2000, "未定义", "10天", 60000 * 60 * 24 * 10, 1)//满月椅子
    );

var syxh = Array(
    Array(5220040, 500, "未定义", 1) //祝福卷轴
  //  Array(5220040, 20000, "未定义", 100) //混沌卷轴60%
    //Array(2340000, 10000, "未定义", 5), //祝福卷轴
    //Array(2049100, 10000, "未定义", 10)//混沌卷轴60%
    );

var tscl = Array(
    Array(4000151, 1000, 100), //时间门神的轴标
    Array(4001109, 1000, 5)//强化玻璃瓶
    );

var xswp = Array(
    Array(5000191, 20000, "神马", 60000 * 60 * 90 * 1, 1),
    Array(5000212, 10000, "火红小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000213, 10000, "幽青小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000214, 10000, "雷黄小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000244, 10000, "冰龙", 60000 * 60 * 90 * 1, 1),
    Array(5000013, 10000, "大象", 60000 * 60 * 90 * 1, 1),
    Array(5000014, 10000, "圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000055, 10000, "水晶银圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000053, 10000, "大猩猩机器人", 60000 * 60 * 90 * 1, 1),
    Array(5000038, 10000, "萌太郎", 60000 * 60 * 90 * 1, 1),
    Array(5000072, 10000, "臭鼬", 60000 * 60 * 90 * 1, 1),
    Array(5000075, 10000, "小象宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000076, 10000, "威尔士柯基狗", 60000 * 60 * 90 * 1, 1),
    Array(5000077, 10000, "波斯猫", 60000 * 60 * 90 * 1, 1),
    Array(5000081, 10000, "飞行小鲸鱼", 60000 * 60 * 90 * 1, 1),
    Array(5000084, 10000, "独角兽安塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000085, 10000, "蛋糕宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000086, 10000, "馅饼宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000089, 10000, "独角兽迪埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000090, 10000, "独角兽吉尼", 60000 * 60 * 90 * 1, 1),
    Array(5000091, 10000, "独角兽埃塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000096, 10000, "稀有白色小象", 60000 * 60 * 90 * 1, 1),
    Array(5000250, 10000, "粉小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000251, 10000, "蓝小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000252, 10000, "艾克索", 60000 * 60 * 90 * 1, 1),
    Array(5000253, 10000, "阿黛尔", 60000 * 60 * 90 * 1, 1),
    Array(5000264, 10000, "跳跳袋鼠", 60000 * 60 * 90 * 1, 1),
    Array(5000271, 10000, "绿色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000272, 10000, "黄色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000273, 10000, "粉色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000274, 10000, "豆豆蛇", 60000 * 60 * 90 * 1, 1),
    Array(5000284, 10000, "冰骑士", 60000 * 60 * 90 * 1, 1),
    Array(5000287, 10000, "血腥皇后", 60000 * 60 * 90 * 1, 1),
    Array(5000288, 10000, "半半", 60000 * 60 * 90 * 1, 1),
    Array(5000289, 10000, "皮埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000290, 10000, "天使提尔", 60000 * 60 * 90 * 1, 1),
    Array(5000291, 10000, "天使拉尔", 60000 * 60 * 90 * 1, 1),
    Array(5000292, 10000, "天使米尔", 60000 * 60 * 90 * 1, 1),
    Array(5000293, 10000, "蜜桃鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000294, 10000, "薄荷鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000295, 10000, "紫色鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000320, 10000, "铠鼠爱因", 60000 * 60 * 90 * 1, 1),
    Array(5000321, 10000, "铠鼠居里", 60000 * 60 * 90 * 1, 1),
    Array(5000322, 10000, "铠鼠牛顿", 60000 * 60 * 90 * 1, 1),
    Array(5000324, 10000, "火柴人宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000330, 10000, "MINI班雷昂", 60000 * 60 * 90 * 1, 1),
    Array(5000331, 10000, "MINI奥尔卡", 60000 * 60 * 90 * 1, 1),
    Array(5000332, 10000, "MINI希拉", 60000 * 60 * 90 * 1, 1),
    Array(5000369, 10000, "小拉伊", 60000 * 60 * 90 * 1, 1),
    Array(5000370, 10000, "小波波", 60000 * 60 * 90 * 1, 1),
    Array(5000371, 10000, "小阿尔", 60000 * 60 * 90 * 1, 1),
    Array(5000391, 10000, "黄金虾", 60000 * 60 * 90 * 1, 1),
    Array(5000528, 10000, "猫鼬家族", 60000 * 60 * 90 * 1, 1),
    Array(5000402, 10000, "芭蕾女孩丽恩", 60000 * 60 * 90 * 1, 1)
    );


var jmpf = Array(
    Array(1102665, 3000, "未定义", "永久"), //狐狸围脖
    Array(1102217, 3000, "未定义", "永久"), //九尾披风
    Array(1102625, 3000, "未定义", "永久"), //红色蜗牛壳
    Array(1102651, 13000, "未定义", "永久"), //小浣熊尾巴
    Array(1102652, 13000, "未定义", "永久"), //松鼠尾巴
    Array(1102654, 13000, "未定义", "永久"), //狗狗尾巴
    Array(1102655, 13000, "未定义", "永久"), //熊熊尾巴
    Array(1102188, 3000, "未定义", "永久"), //银色狐狸尾巴
    Array(1102187, 3000, "未定义", "永久"), //金色狐狸尾巴
    Array(1102648, 3000, "未定义", "永久"), //K君的猫尾巴
    Array(1102387, 3000, "未定义", "永久"), //海龙尾巴
    Array(1102388, 3000, "未定义", "永久"), //炎龙尾巴
    Array(1102292, 3000, "未定义", "永久"), //尾巴
    Array(1102296, 3000, "未定义", "永久"), //夜叉尾巴（黑色）
    Array(1102656, 3000, "未定义", "永久"), //动物尾巴6
    Array(1102622, 3000, "未定义", "永久"), //时间旅行者的怀表
    Array(1102692, 3000, "未定义", "永久"), //寿司团
    Array(1102574, 3000, "未定义", "永久"), //小鸡叽叽叽
    Array(1102380, 3000, "未定义", "永久"), //我的朋友青蛙酱
    Array(1102549, 3000, "未定义", "永久"), //管家的猫咪
    Array(1102705, 3000, "未定义", "永久"), //企鹅书包
    Array(1102683, 3000, "未定义", "永久"), //兔兔熊背包
    Array(1102684, 3000, "未定义", "永久"), //未来医生听诊器
    Array(1102682, 3000, "未定义", "永久"), //未来天使注射器
    Array(1102593, 3000, "未定义", "永久"), //浮漾的翅膀
    Array(1102668, 3000, "未定义", "永久"), //夜天使之翼
    Array(1102353, 3000, "未定义", "永久"), //自由的翅膀
    Array(1102554, 3000, "未定义", "永久"), //女妖之翼
    Array(1102391, 3000, "未定义", "永久"), //小蜜蜂翅膀
    Array(1102325, 3000, "未定义", "永久"), //紫天使羽翼
    Array(1102326, 3000, "未定义", "永久"), //蓝天使羽翼
    Array(1102389, 3000, "未定义", "永久"), //金色天使
    Array(1102390, 3000, "未定义", "永久"), //银色天使
    Array(1102273, 3000, "未定义", "永久"), //路西法之翼
    Array(1102349, 3000, "未定义", "永久"), //发光精灵翅膀
    Array(1102293, 3000, "未定义", "永久"), //羁绊之翼
    Array(1102152, 3000, "未定义", "永久"), //黑骷髅海盗旗
    Array(1102300, 3000, "未定义", "永久"), //派对舞会灯
    Array(1102288, 3000, "未定义", "永久"), //背背雪人
    Array(1102274, 3000, "未定义", "永久"), //刺柏刀
    Array(1102310, 3000, "未定义", "永久"), //精灵披风
    Array(1102461, 3000, "未定义", "永久"), //粉嫩披风
    Array(1102222, 3000, "未定义", "永久"), //死神披风
    Array(1102583, 3000, "未定义", "永久"), //宝贝龙波比
    Array(1102232, 3000, "未定义", "永久"), //小王子的星星
    Array(1102218, 3000, "未定义", "永久"), //仙女飘飘
    Array(1102356, 3000, "未定义", "永久"), //天使祖母绿
    Array(1102270, 3000, "未定义", "永久"), //风和日丽
    Array(1102261, 3000, "未定义", "永久"), //音符围脖
    Array(1102251, 3000, "未定义", "永久"), //世界杯手巾
    Array(1102373, 3000, "未定义", "永久"), //露西娅披风
    Array(1102301, 3000, "未定义", "永久"), //旅行者披风
    Array(1102255, 3000, "未定义", "永久"), //唤灵斗师披风
    Array(1102254, 3000, "未定义", "永久"), //豹弩游侠披风
    Array(1102242, 3000, "未定义", "永久"), //胡克的船长披风
    Array(1102249, 3000, "未定义", "永久"), //奥兹魔法披风
    Array(1102239, 3000, "未定义", "永久"), //暗影双刀披风
    Array(1102355, 3000, "未定义", "永久"), //怪盗幻影披风
    Array(1102673, 3000, "未定义", "永久"), //僵尸新娘披风
    Array(1102324, 3000, "未定义", "永久"), //传说双层气球
    Array(1102212, 3000, "未定义", "永久"), //丢失的小孩
    Array(1102233, 3000, "未定义", "永久"), //雪娃娃披风
    Array(1102230, 3000, "未定义", "永久"), //企企雪橇披风
    Array(1102245, 3000, "未定义", "永久"), //太阳披风
    Array(1102258, 3000, "未定义", "永久"), //玩具熊气球
    Array(1102215, 3000, "未定义", "永久"), //气球串
    Array(1102271, 3000, "未定义", "永久"), //可爱巧克力棒气球
    Array(1102488, 3000, "未定义", "永久"), //蛋糕杯气球
    Array(1102285, 3000, "未定义", "永久"), //晴天娃娃(粉色)
    Array(1102286, 3000, "未定义", "永久"), //晴天娃娃(天蓝色)
    Array(1102287, 3000, "未定义", "永久")//晴天娃娃(淡黄色)
    );


var jmmz = Array(
    Array(1002960, 3000, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1004639, 3000, "未定义", "永久"), //北极罩帽
    Array(1004665, 3000, "未定义", "永久"), //暖绒兔兔帽
    Array(1004638, 3000, "未定义", "永久"), //茅山道士帽
    Array(1004592, 3000, "未定义", "永久"), //紫色时间
    Array(1004592, 3000, "未定义", "永久"), //粉色时间
    Array(1004590, 3000, "未定义", "永久"), //蓝莓宝石头饰
    Array(1004589, 3000, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570, 3000, "未定义", "永久"), //黑色海魂帽
    Array(1004571, 3000, "未定义", "永久"), //海贼团贝雷帽
    Array(1004541, 3000, "未定义", "永久"), //茶会大蝴蝶结
    Array(1004540, 3000, "未定义", "永久"), //奥尔卡的睡帽
    Array(1004506, 3000, "未定义", "永久"), //白色兔耳发带
    Array(1004504, 3000, "未定义", "永久"), //贵族花纹帽子
    Array(1004499, 3000, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004500, 3000, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004491, 3000, "未定义", "永久"), //西红柿帽子
    Array(1004481, 3000, "未定义", "永久"), //反抗者护目镜
    Array(1004480, 3000, "未定义", "永久"), //小淘气的飞行帽
    Array(1004470, 3000, "未定义", "永久"), //毛绒雷锋帽
    Array(1004469, 3000, "未定义", "永久"), //爱情宣言
    Array(1004463, 3000, "未定义", "永久"), //方块兔帽子
    Array(1004448, 3000, "未定义", "永久"), //黑色啵啵鼠帽
    Array(1004414, 3000, "未定义", "永久"), //热腾腾包子帽
    Array(1004409, 3000, "未定义", "永久"), //松鼠的休闲帽
    Array(1004403, 3000, "未定义", "永久"), //嘻哈兔子
    Array(1004405, 3000, "未定义", "永久"), //睡虎休闲帽
    Array(1004397, 3000, "未定义", "永久"), //清扫头巾
    Array(1004336, 3000, "未定义", "永久"), //暴走斯乌假发
    Array(1004332, 3000, "未定义", "永久"), //我爱小狗
    Array(1004330, 3000, "未定义", "永久"), //奢华羊绒小礼帽
    Array(1004328, 3000, "未定义", "永久"), //粉色棒球帽
    Array(1004329, 3000, "未定义", "永久"), //蓝色棒球帽发夹
    Array(1004324, 3000, "未定义", "永久"), //防毒面罩
    Array(1004294, 3000, "未定义", "永久"), //甜柿帽
    Array(1004295, 3000, "未定义", "永久"), //音乐飞天小鸡帽
    Array(1004296, 3000, "未定义", "永久"), //萌动飞天小鸡帽
    Array(1004298, 3000, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004299, 3000, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004275, 3000, "未定义", "永久"), //幸运帽
    Array(1004269, 3000, "未定义", "永久"), //苹果蒂风情帽
    Array(1004239, 3000, "未定义", "永久"), //桃太郎帽子
    Array(1004212, 3000, "未定义", "永久"), //晶莹精致丝带
    Array(1004211, 3000, "未定义", "永久"), //哈尼绒绒耳
    Array(1004204, 3000, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004205, 3000, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004202, 3000, "未定义", "永久"), //隐武士战盔
    Array(1004200, 3000, "未定义", "永久"), //夏日兔草帽
    Array(1004198, 3000, "未定义", "永久"), //太极发箍
    Array(1004196, 3000, "未定义", "永久"), //风车头箍
    Array(1004194, 3000, "未定义", "永久"), //蝴蝶结贝雷帽
    Array(1004169, 3000, "未定义", "永久"), //美味荷包蛋帽
    Array(1004171, 3000, "未定义", "永久"), //旋转木马帽
    Array(1004163, 3000, "未定义", "永久"), //爱丽丝表丝带
    Array(1004158, 3000, "未定义", "永久"), //鼠鼠派对发箍
    Array(1004137, 3000, "未定义", "永久"), //兔兔熊帽
    Array(1004025, 3000, "未定义", "永久"), //绿猫猫帽子
    Array(1004026, 3000, "未定义", "永久"), //黑猫无边帽
    Array(1004027, 3000, "未定义", "永久"), //白猫无边帽
    Array(1004028, 3000, "未定义", "永久"), //黄猫无边帽
    Array(1004029, 3000, "未定义", "永久"), //北极熊无边帽
    Array(1004033, 3000, "未定义", "永久"), //红猫猫帽子
    Array(1004003, 3000, "未定义", "永久"), //粉红猫耳套头帽
    Array(1004004, 3000, "未定义", "永久"), //粉红猫耳套头帽
    Array(1003967, 3000, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003968, 3000, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003951, 3000, "未定义", "永久"), //欧黛特头箍
    Array(1003952, 3000, "未定义", "永久"), //欧黛特头箍
    Array(1003937, 3000, "未定义", "永久"), //浪漫斗笠
    Array(1003919, 3000, "未定义", "永久"), //花花绒线帽
    Array(1003920, 3000, "未定义", "永久"), //夏威夷草帽
    Array(1003921, 3000, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003917, 3000, "未定义", "永久"), //粉红太阳镜帽
    Array(1003900, 3000, "未定义", "永久"), //蓝色桃心透明帽子
    Array(1003892, 3000, "未定义", "永久"), //树叶钻石
    Array(1003859, 3000, "未定义", "永久"), //满天星普赛克
    Array(1003847, 3000, "未定义", "永久"), //鬼剑士假发
    Array(1003831, 3000, "未定义", "永久"), //卷卷绵羊发卡
    Array(1003829, 3000, "未定义", "永久"), //兔耳管家礼帽
    Array(1003776, 3000, "未定义", "永久"), //海豹白白帽
    Array(1003777, 3000, "未定义", "永久"), //伶俐猫咪斗篷
    Array(1003778, 3000, "未定义", "永久"), //可爱猫咪斗篷
    Array(1003779, 3000, "未定义", "永久"), //爱丽丝兔兔帽
    Array(1003763, 3000, "未定义", "永久"), //黑色之翼首领帽
    Array(1003710, 3000, "未定义", "永久"), //[MS折扣]怪医黑杰克帽
    Array(1003596, 3000, "未定义", "永久"), //金属粉色棒球帽
    Array(1003594, 3000, "未定义", "永久"), //凉爽夏日潜水镜
    Array(1003586, 3000, "未定义", "永久"), //薄荷星海军帽
    Array(1003587, 3000, "未定义", "永久"), //薄荷星海军帽
    Array(1003508, 3000, "未定义", "永久"), //时尚香肠帽
    Array(1003509, 3000, "未定义", "永久"), //时尚香肠帽
    Array(1003417, 3000, "未定义", "永久"), //恐龙帽子
    Array(1003220, 3000, "未定义", "永久"), //尼龙花头绳
    Array(1003203, 3000, "未定义", "永久"), //小红帽
    Array(1003149, 3000, "未定义", "永久"), //洛比尔兔子斗篷
    Array(1003146, 3000, "未定义", "永久"), //蕾丝蝴蝶结发箍
    Array(1003147, 3000, "未定义", "永久"), //天蓝女仆头饰
    Array(1003131, 3000, "未定义", "永久"), //黑色精致丝带
    Array(1003132, 3000, "未定义", "永久"), //黑色精致丝带
    Array(1003133, 3000, "未定义", "永久"), //黑色精致丝带
    Array(1003122, 3000, "未定义", "永久"), //黄色兔兔巾
    Array(1003123, 3000, "未定义", "永久"), //黄色兔兔巾
    Array(1003109, 3000, "未定义", "永久"), //皇家彩虹斗篷
    Array(1003006, 3000, "未定义", "永久"), //猫猫野营帽
    Array(1002976, 3000, "未定义", "永久"), //女仆头饰
    Array(1002885, 3000, "未定义", "永久"), //心型蝴蝶结
    Array(1002721, 3000, "未定义", "永久"), //狸毛护耳
    Array(1002704, 3000, "未定义", "永久"), //黄独眼怪婴
    Array(1002691, 3000, "未定义", "永久"), //半人马假发(棕色)
    Array(1002695, 3000, "未定义", "永久"), //幽灵帽
    Array(1004636, 3000, "未定义", "永久"), //香蕉郊游帽
    Array(1004628, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004629, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004630, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004631, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004632, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004602, 3000, "未定义", "永久"), //农夫的瑰宝
    Array(1004601, 3000, "未定义", "永久"), //小企鹅帽子
    Array(1004589, 3000, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570, 3000, "未定义", "永久"), //黑色海魂帽
    Array(1004571, 3000, "未定义", "永久"), //海贼团贝雷帽
    Array(1004568, 3000, "未定义", "永久"), //呆萌鼠鼠帽
    Array(1004543, 3000, "未定义", "永久"), //复古头巾
    Array(1004544, 3000, "未定义", "永久"), //棒球帽
    Array(1004545, 3000, "未定义", "永久"), //棒球帽
    Array(1004546, 3000, "未定义", "永久"), //棒球帽
    Array(1004547, 3000, "未定义", "永久"), //棒球帽
    Array(1004548, 3000, "未定义", "永久"), //棒球帽
    Array(1004532, 3000, "未定义", "永久"), //女皇关注
    Array(1004533, 3000, "未定义", "永久"), //女皇关注
    Array(1004535, 3000, "未定义", "永久"), //女皇关注
    Array(1004540, 3000, "未定义", "永久"), //女皇关注
    Array(1004541, 3000, "未定义", "永久"), //女皇关注
    Array(1004542, 3000, "未定义", "永久"), //女皇关注
    Array(1004530, 3000, "未定义", "永久"), //蓝色熊猫玩偶帽子
    Array(1004510, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004511, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004512, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004513, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004514, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004503, 3000, "未定义", "永久"), //黑猫
    Array(1004504, 3000, "未定义", "永久"), //黑猫
    Array(1004505, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1004499, 3000, "未定义", "永久"), //蓝鱼帽子
    Array(1004500, 3000, "未定义", "永久"), //黑猫
    Array(1004491, 3000, "未定义", "永久"), //西红柿
    Array(1004486, 3000, "未定义", "永久"), //春之主人
    Array(1004463, 3000, "未定义", "永久"), //方块兔子
    Array(1004467, 3000, "未定义", "永久"), //方块兔子
    Array(1004469, 3000, "未定义", "永久"), //方块兔子
    Array(1004470, 3000, "未定义", "永久"), //方块兔子
    Array(1004471, 3000, "未定义", "永久"), //方块兔子
    Array(1004472, 3000, "未定义", "永久"), //黑猫
    Array(1004473, 3000, "未定义", "永久"), //黑猫
    Array(1004478, 3000, "未定义", "永久"), //黑猫
    Array(1004480, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1003084, 3000, "未定义", "永久"), //帝国皇冠
    Array(1003861, 3000, "未定义", "永久"), //明星小皇冠
    Array(1003401, 3000, "未定义", "永久"), //黑暗伊卡尔特
    Array(1003402, 3000, "未定义", "永久"), //黑暗胡克
    Array(1003458, 3000, "未定义", "永久"), //茅山道士帽
    Array(1003104, 3000, "未定义", "永久"), //巨型蛋糕帽
    Array(1003246, 3000, "未定义", "永久"), //可爱兔子帽
    Array(1004112, 3000, "未定义", "永久"), //刀马旦花帽
    Array(1003776, 3000, "未定义", "永久"), //海豹白白帽
    Array(1003392, 3000, "未定义", "永久"), //小蜜蜂帽子
    Array(1003802, 3000, "未定义", "永久"), //小恐龙绿豆帽子
    Array(1003803, 3000, "未定义", "永久"), //小恐龙云豆帽子
    Array(1003728, 3000, "未定义", "永久"), //蓝色精灵帽
    Array(1003727, 3000, "未定义", "永久"), //红色精灵帽
    Array(1003509, 3000, "未定义", "永久"), //时尚香肠帽
    Array(1003508, 3000, "未定义", "永久"), //西红柿帽子
    Array(1004124, 3000, "未定义", "永久"), //恋爱小草莓帽
    Array(1004125, 3000, "未定义", "永久"), //歌唱大菠萝帽
    Array(1003829, 3000, "未定义", "永久"), //兔耳管家礼帽
    Array(1003541, 3000, "未定义", "永久"), //逆转兔帽子
    Array(1004126, 3000, "未定义", "永久"), //彩塘熊耳帽
    Array(1004092, 3000, "未定义", "永久"), //小马乖乖帽
    Array(1003842, 3000, "未定义", "永久"), //女妖帽子
    Array(1003921, 3000, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003588, 3000, "未定义", "永久"), //玩具粉熊帽子
    Array(1003909, 3000, "未定义", "永久"), //活力苏打帽
    Array(1003596, 3000, "未定义", "永久"), //金属粉色棒球帽
    Array(1003597, 3000, "未定义", "永久"), //金属冠棒球帽
    Array(1003462, 3000, "未定义", "永久"), //Kitty猫猫帽
    Array(1003268, 3000, "未定义", "永久"), //按键狂人糖果帽
    Array(1003269, 3000, "未定义", "永久"), //按键狂人玩具帽
    Array(1003241, 3000, "未定义", "永久"), //摇滚歌手帽
    Array(1003533, 3000, "未定义", "永久"), //黑暗奥尔卡军官帽
    Array(1002524, 3000, "未定义", "永久"), //可乐帽
    Array(1003790, 3000, "未定义", "永久"), //高尔夫遮阳帽
    Array(1004137, 3000, "未定义", "永久"), //兔兔熊帽
    Array(1003919, 3000, "未定义", "永久"), //花花绒线帽
    Array(1003077, 3000, "未定义", "永久"), //花别针尼龙帽
    Array(1003215, 3000, "未定义", "永久"), //粉色雪花帽
    Array(1003387, 3000, "未定义", "永久"), //耳机毛线帽
    Array(1003210, 3000, "未定义", "永久"), //绒球遮耳帽
    Array(1002422, 3000, "未定义", "永久"), //点点星光帽
    Array(1003920, 3000, "未定义", "永久"), //夏威夷草帽
    Array(1003519, 3000, "未定义", "永久"), //霞光草帽
    Array(1003141, 3000, "未定义", "永久"), //稻草编织帽
    Array(1003531, 3000, "未定义", "永久"), //西式风情帽
    Array(1003539, 3000, "未定义", "永久"), //蓝色天使帽
    Array(1004136, 3000, "未定义", "永久"), //未来天使帽
    Array(1003793, 3000, "未定义", "永久"), //杜鹃花发簪
    Array(1004203, 3000, "未定义", "永久"), //喵星人的秘密
    Array(1004014, 3000, "未定义", "永久"), //阿宅守护精灵
    Array(1003967, 3000, "未定义", "永久"), //巧可羊帽子
    Array(1004204, 3000, "未定义", "永久"), //小蓝马
    Array(1004205, 3000, "未定义", "永久"), //小红马
    Array(1003234, 3000, "未定义", "永久"), //粉色卓别林帽子
    Array(1003235, 3000, "未定义", "永久"), //珠宝蓝卓别林帽子
    Array(1002920, 3000, "未定义", "永久"), //粉红淑女帽
    Array(1001042, 3000, "未定义", "永久"), //紫环头纱
    Array(1004113, 3000, "未定义", "永久"), //僵尸新娘的面纱
    Array(1004123, 3000, "未定义", "永久"), //时尚小圆帽
    Array(1002885, 3000, "未定义", "永久"), //新型蝴蝶结
    Array(1003133, 3000, "未定义", "永久"), //雪姬蝴蝶结
    Array(1003233, 3000, "未定义", "永久"), //最爱兔子发夹
    Array(1003222, 3000, "未定义", "永久"), //冰蓝蝴蝶卡子
    Array(1003362, 3000, "未定义", "永久"), //玫瑰粉双蝴蝶结
    Array(1003862, 3000, "未定义", "永久"), //熊宝宝发带
    Array(1003132, 3000, "未定义", "永久"), //红色精致丝带
    Array(1004111, 3000, "未定义", "永久"), //粉色波点发箍
    Array(1004110, 3000, "未定义", "永久"), //蓝色波点发箍
    Array(1003071, 3000, "未定义", "永久"), //淘气女孩粉色发箍
    Array(1003072, 3000, "未定义", "永久"), //黑蕾丝蝴蝶发箍
    Array(1003459, 3000, "未定义", "永久"), //露西娅帽子
    Array(1003750, 3000, "未定义", "永久"), //绸带猫耳
    Array(1003760, 3000, "未定义", "永久"), //猫咪耳机
    Array(1003505, 3000, "未定义", "永久"), //炎龙角
    Array(1003278, 3000, "未定义", "永久"), //孔雀羽毛
    Array(1003503, 3000, "未定义", "永久"), //爱丽丝的茶杯
    Array(1003223, 3000, "未定义", "永久"), //寻找妈咪的小鸡
    Array(1003510, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003202, 3000, "未定义", "永久"), //黄金甲壳虫
    Array(1003367, 3000, "未定义", "永久"), //彩色花环
    Array(1003761, 3000, "未定义", "永久"), //圣洁天使帽
    Array(1003461, 3000, "未定义", "永久"), //秀秀
    Array(1003277, 3000, "未定义", "永久"), //草业妖精帽
    Array(1000051, 3000, "未定义", "永久"), //精灵精神发带
    Array(1003520, 3000, "未定义", "永久"), //可爱丝线发带
    Array(1003860, 3000, "未定义", "永久"), //赛利亚假发
    Array(1003807, 3000, "未定义", "永久"), //桃心太阳眼镜
    Array(1003264, 3000, "未定义", "永久"), //太阳镜
    Array(1003265, 3000, "未定义", "永久"), //水手太阳镜
    Array(1003594, 3000, "未定义", "永久"), //凉爽夏日潜水镜
    Array(1003043, 3000, "未定义", "永久"), //叮当鹿角
    Array(1003078, 3000, "未定义", "永久"), //灵异蝴蝶
    Array(1003581, 3000, "未定义", "永久"), //蝴蝶伴舞头饰
    Array(1003586, 3000, "未定义", "永久"), //薄荷海军帽
    Array(1003587, 3000, "未定义", "永久"), //粉红丝带海军帽
    Array(1003079, 3000, "未定义", "永久"), //小嫩叶帽
    Array(1003083, 3000, "未定义", "永久"), //小嫩苗
    Array(1002888, 3000, "未定义", "永久"), //丝带发箍（红色）
    Array(1002890, 3000, "未定义", "永久"), //丝带发箍（蓝色）
    Array(1003639, 3000, "未定义", "永久"), //荧光发箍-粉色
    Array(1003640, 3000, "未定义", "永久"), //荧光发箍-蓝色
    Array(1003641, 3000, "未定义", "永久"), //荧光发箍-绿色
    Array(1003642, 3000, "未定义", "永久"), //荧光发箍-金色
    Array(1003249, 3000, "未定义", "永久"), //8周年音符黄晶
    Array(1003250, 3000, "未定义", "永久"), //8周年音符红宝石
    Array(1003251, 3000, "未定义", "永久"), //8周年音符黄水晶
    Array(1003252, 3000, "未定义", "永久"), //8周年音符紫水晶
    Array(1003548, 3000, "未定义", "永久"), //魔术师黑色礼帽
    Array(1003549, 3000, "未定义", "永久"), //魔术师黑色缎带
    Array(1003607, 3000, "未定义", "永久"), //蓝宝石羽毛发饰
    Array(1003636, 3000, "未定义", "永久"), //水神帽
    Array(1003865, 3000, "未定义", "永久"), //星光飘带帽子
    Array(1003516, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003461, 3000, "未定义", "永久"), //玫瑰秀秀
    Array(1000053, 3000, "未定义", "永久"), //贵族晚宴帽(男)
    Array(1000050, 3000, "未定义", "永久"), //薄荷雪水晶(男)
    Array(1000045, 3000, "未定义", "永久"), //军团长假发-男
    Array(1000046, 3000, "未定义", "永久"), //精灵王假发-男
    Array(1000071, 3000, "未定义", "永久"), //蓝色蝴蝶结礼帽（男）
    Array(1003460, 3000, "未定义", "永久"), //奶油巧克力帽子
    Array(1003796, 3000, "未定义", "永久"), //甜蜜冰淇淋帽
    Array(1003542, 3000, "未定义", "永久"), //草莓杏仁饼发卡
    Array(1003543, 3000, "未定义", "永久"), //杏仁饼发卡
    Array(1003544, 3000, "未定义", "永久"), //草莓纸杯蛋糕发卡
    Array(1003545, 3000, "未定义", "永久"), //哈密瓜纸杯蛋糕发卡
    Array(1003546, 3000, "未定义", "永久"), //巧克力纸杯蛋糕发卡
    Array(1003547, 3000, "未定义", "永久"), //冰激淋纸杯蛋糕发卡
    Array(1003595, 3000, "未定义", "永久")//卷发兔子
    );



var jmsp = Array(
    Array(1022184, 3000, "未定义", "永久"), //烈焰之瞳(蓝)
    Array(1022183, 3000, "未定义", "永久"), //烈焰之瞳(红) 
    Array(1012450, 3000, "未定义", "永久"), //巧克力彩豆曲奇
    Array(1012412, 3000, "未定义", "永久"), //血泪 
    Array(1012099, 3000, "未定义", "永久"), //蓝色腮红 
    Array(1012253, 3000, "未定义", "永久"), //心跳唇彩
    Array(1012160, 3000, "未定义", "永久"), //烈焰红唇
    Array(1012208, 3000, "未定义", "永久"), //害羞了 
    Array(1012131, 3000, "未定义", "永久"), //好白的牙
    Array(1012165, 3000, "未定义", "永久"), //小丑鼻子
    Array(1012176, 3000, "未定义", "永久"), //娃娃脸
    Array(1012179, 3000, "未定义", "永久"), //鹿鼻子
    Array(1012135, 3000, "未定义", "永久"), //吐舌头
    Array(1022059, 3000, "未定义", "永久"), //经典黑色墨镜
    Array(1022057, 3000, "未定义", "永久"), //POP眼镜
    Array(1022064, 3000, "未定义", "永久"), //时尚大太阳镜
    Array(1022063, 3000, "未定义", "永久"), //无框小圆眼镜
    Array(1022104, 3000, "未定义", "永久"), //3D炫彩眼镜
    Array(1022102, 3000, "未定义", "永久"), //LED炫光眼镜
    Array(1022108, 3000, "未定义", "永久"), //柠檬黄潮流眼镜
    Array(1022109, 3000, "未定义", "永久"), //玫瑰红潮流眼镜
    Array(1003265, 3000, "未定义", "永久"), //爱心天蓝墨镜
    Array(1022110, 3000, "未定义", "永久"), //非主流墨镜
    Array(1022122, 3000, "未定义", "永久"), //DJ眼镜
    Array(1032029, 3000, "未定义", "永久"), //925银耳环
    Array(1032181, 3000, "未定义", "永久"), //杜鹃花耳环
    Array(1032034, 3000, "未定义", "永久"), //可乐耳环
    Array(1032094, 3000, "未定义", "永久"), //胡萝卜耳环
    Array(1032088, 3000, "未定义", "永久"), //体力猎犬耳环
    Array(1032145, 3000, "未定义", "永久")//螃蟹耳环
    );


var qtwp = Array(
    Array(5010082, 5000, "未定义", "永久"), //新星效果
    Array(4290004, 5000, "未定义", "永久"), //2010庚延年纪念品
    Array(4290003, 5000, "未定义", "永久"), //幻想妖精
    Array(4290001, 5000, "未定义", "永久"), //倒霉效果 
    Array(4290000, 5000, "未定义", "永久"), //金鸡效果
    Array(5010080, 5000, "未定义", "永久"), //（效果）下雨
    Array(5160017, 5000, "未定义", "永久"), //哼哼
    Array(5160015, 5000, "未定义", "永久"), //晕乎乎
    Array(5010015, 5000, "未定义", "永久"), //777效果
    Array(5010008, 5000, "未定义", "永久"), //幸运儿效果
    Array(5021011, 3000, "未定义", "永久"), //骷髅飞镖
    Array(5021012, 3000, "未定义", "永久"), //南瓜派
    Array(5021013, 3000, "未定义", "永久"), //海盗炸弹
    Array(5021026, 3000, "未定义", "永久")//开心的圣诞老人
    );

var gfs = Array(
    Array(1003393, 15000, "未定义", "永久"), //帝国伯爵冠
    Array(1102381, 15000, "未定义", "永久"), //皇家公爵翅膀
    Array(1032233, 5000, "未定义", "永久"), //粉色桃心耳环
    Array(1002839, 6666, "未定义", "永久"), //南瓜棒球帽
    Array(1112928, 5000, "未定义", "永久"), //粉色流星戒指90天
    Array(1112924, 5000, "未定义", "永久"), //黄色流星戒指90天
    Array(1112930, 5000, "未定义", "永久"), //西红柿效果-90天
    Array(1112937, 5000, "未定义", "永久"), //催眠曲戒指(90天)
    Array(1112916, 5000, "未定义", "永久"), //寂寞单身戒指
    Array(1112148, 5000, "未定义", "永久"), //胡子先生名片戒指
    Array(1112266, 5000, "未定义", "永久"), //胡子先生对话框戒指
    Array(1112154, 5000, "未定义", "永久"), //压岁钱防御战名片戒指
    Array(1112259, 5000, "未定义", "永久"), //压岁钱防御战聊天戒指
    Array(1112274, 5000, "未定义", "永久"), //鸥巴聊天戒指
    Array(1112162, 5000, "未定义", "永久"), //鸥巴名片戒指
    Array(1112276, 5000, "未定义", "永久"), //夏日甜心聊天戒指
    Array(1112164, 5000, "未定义", "永久"), //夏日甜心名片戒指
    Array(1112273, 5000, "未定义", "永久"), //黄小丫聊天戒指
    Array(1112161, 5000, "未定义", "永久"), //黄小丫名片戒指
    Array(1112271, 5000, "未定义", "永久"), //非洲之星聊天戒指
    Array(1112159, 5000, "未定义", "永久"), //非洲之星名片戒指
    Array(1112252, 5000, "未定义", "永久"), //红玫瑰聊天戒指
    Array(1112141, 5000, "未定义", "永久"), //红玫瑰名片戒指
    Array(1112135, 5000, "未定义", "永久"), //水墨花名片戒指
    Array(1112238, 5000, "未定义", "永久"), //水墨花聊天戒指
    Array(1112143, 5000, "未定义", "永久"), //豪华珍珠名片戒指
    Array(1112254, 5000, "未定义", "永久"), //豪华珍珠聊天戒指
    Array(1112262, 5000, "未定义", "永久"), //天使降临聊天戒指
    Array(1112150, 5000, "未定义", "永久"), //天使降临名片戒指
    Array(5010069, 5000, "未定义", "永久"), //死神之翼
    Array(1042271, 5000, "未定义", "永久"), //外星人拼色T恤
    Array(1042321, 5000, "未定义", "永久"), //心花怒放T恤
    Array(1042260, 5000, "未定义", "永久"), //点点星光羊毛上衣
    Array(1050284, 5000, "未定义", "永久"), //派对公子服(男)
    Array(1050302, 5000, "未定义", "永久"), //执事之品格(男)
    Array(1000052, 5000, "未定义", "永久"), //公主冠（男）
    Array(1052731, 5000, "未定义", "永久"), //黑色可爱游泳服
    Array(1052634, 5000, "未定义", "永久"), //简洁白衬衫
    Array(1052209, 5000, "未定义", "永久"), //皇家海军制服
    Array(1050152, 5000, "未定义", "永久"), //水兵服男
    Array(1052201, 5000, "未定义", "永久"), //闪亮水手外套
    Array(1004108, 5000, "未定义", "永久"), //幻夜蝶华礼帽
    Array(1003247, 5000, "未定义", "永久"), //杂技团老板帽
    Array(1003272, 5000, "未定义", "永久"), //格莱特帽
    Array(1003276, 5000, "未定义", "永久"), //蓝心透明帽子
    Array(1003271, 5000, "未定义", "永久"), //红心透明帽子
    Array(1003918, 5000, "未定义", "永久"), //翅膀帽
    Array(1004029, 5000, "未定义", "永久"), //小白熊便帽
    Array(1004026, 5000, "未定义", "永久"), //小黑猫便帽
    Array(1004028, 5000, "未定义", "永久"), //小花猫便帽
    Array(1004027, 5000, "未定义", "永久"), //白猫无边帽 
    Array(1003955, 5000, "未定义", "永久"), //浪漫玫瑰
    Array(1004094, 5000, "未定义", "永久"), //白巧克力兔子发箍
    Array(1004193, 5000, "未定义", "永久"), //护目镜帽子
    Array(1003892, 5000, "未定义", "永久"), //树叶钻石
    Array(1002846, 5000, "未定义", "永久"), //蓝天贝雷帽
    Array(1002995, 5000, "未定义", "永久"), //皇家海军帽
    Array(1003748, 5000, "未定义", "永久"), //皇家天使帽
    Array(1702168, 5000, "未定义", "永久"), //闪亮圣诞树
    Array(1702278, 5000, "未定义", "永久"), //枫之武器
    Array(1702211, 5000, "未定义", "永久"), //亮丽雪片
    Array(1702289, 5000, "未定义", "永久"), //皇家海军旗帜
    Array(1702287, 5000, "未定义", "永久"), //唤灵斗师长杖
    Array(1702277, 5000, "未定义", "永久"), //密码签字笔
    Array(1702309, 5000, "未定义", "永久"), //多味棒棒糖
    Array(1702155, 5000, "未定义", "永久"), //绚丽彩虹
    Array(1102605, 5000, "未定义", "永久"), //暗炎赎罪者
    Array(1102671, 5000, "未定义", "永久"), //肃清者的荆翼
    Array(1102564, 5000, "未定义", "永久"), //天衣无缝
    Array(1102653, 15000, "未定义", "永久"), //兔尾巴
    Array(1102267, 5000, "未定义", "永久")//我的朋友九尾狐尾巴

    );



var ns = Array(
    Array(1051311, 5000, "未定义", "永久"), //黑暗力量连身衣(女)
    Array(1051199, 5000, "未定义", "永久"), //樱花服
    Array(1051173, 5000, "未定义", "永久"), //条纹淑女连衣裙
    Array(1051118, 5000, "未定义", "永久"), //粉红可爱游泳服
    Array(1051189, 5000, "未定义", "永久"), //怦然心动装
    Array(1051233, 5000, "未定义", "永久"), //车模装
    Array(1052410, 5000, "未定义", "永久"), //粉嫩花仙裙
    Array(1051350, 5000, "未定义", "永久"), //派对名媛裙
    Array(1051376, 5000, "未定义", "永久"), //万圣节机器人裙
    Array(1051375, 5000, "未定义", "永久"), //欧迪尔芭蕾裙
    Array(1051349, 5000, "未定义", "永久"), //女妖
    Array(1051387, 5000, "未定义", "永久"), //春游连衣裙
    Array(1051296, 5000, "未定义", "永久"), //玩世不恭裙装
    Array(1051295, 5000, "未定义", "永久"), //魔法裙装
    Array(1051294, 5000, "未定义", "永久"), //抒情裙装 
    Array(1051192, 5000, "未定义", "永久"), //海洋裹裹短裙  
    Array(1051160, 5000, "未定义", "永久"), //裹裹短裙
    Array(1052593, 5000, "未定义", "永久"), //粉红缎带冰淇淋服
    Array(1051303, 5000, "未定义", "永久"), //抹胸礼裙
    Array(1051261, 5000, "未定义", "永久"), //童话幻想
    Array(1052419, 5000, "未定义", "永久"), //粉娃娃群
    Array(1051180, 5000, "未定义", "永久"), //水兵服女
    Array(1051363, 5000, "未定义", "永久"), //开场天使
    Array(1051278, 5000, "未定义", "永久"), //樱桃雪套服
    Array(1051219, 5000, "未定义", "永久"), //彩虹mini连衣裙
    Array(1051211, 5000, "未定义", "永久"), //伊丽莎白礼服
    Array(1051221, 5000, "未定义", "永久"), //圣诞节套服-女
    Array(1051228, 5000, "未定义", "永久"), //粉红色雪花休闲装
    Array(1051229, 5000, "未定义", "永久"), //花少女韩服
    Array(1051231, 5000, "未定义", "永久"), //阿尔卑斯山少女装
    Array(1051232, 5000, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1052656, 5000, "未定义", "永久"), //白天鹅芭蕾服
    Array(1051235, 5000, "未定义", "永久"), //橙色小鸡裙子
    Array(1051252, 5000, "未定义", "永久"), //粉红天使制服
    Array(1051253, 5000, "未定义", "永久"), //红帽迷你裙
    Array(1051254, 5000, "未定义", "永久"), //萝莉学生装
    Array(1052295, 5000, "未定义", "永久"), //粉红色女仆装
    Array(1052296, 5000, "未定义", "永久"), //天蓝色女仆装
    Array(1052298, 5000, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052225, 5000, "未定义", "永久"), //暗夜娃娃服
    Array(1052306, 5000, "未定义", "永久"), //雪姬和服
    Array(1041142, 5000, "未定义", "永久"), //巨星蛋糕吊带
    Array(1041127, 5000, "未定义", "永久"), //爱心背心
    Array(1041189, 5000, "未定义", "永久"), //女牛仔衬衫
    Array(1001076, 5000, "未定义", "永久"), //樱桃雪水晶
    Array(1001064, 5000, "未定义", "永久"), //闪耀Girl帽子
    Array(1001083, 5000, "未定义", "永久"), //爆莉萌天使发卡
    Array(1001044, 5000, "未定义", "永久"), //绿色婚纱头纱
    Array(1001061, 5000, "未定义", "永久"), //伊丽莎白假发(女)
    Array(1001068, 5000, "未定义", "永久"), //军团长假发-女
    Array(1001069, 5000, "未定义", "永久"), //精灵王假发-女
    Array(1001094, 5000, "未定义", "永久"), //蓝色蕾丝头巾
    Array(1001089, 5000, "未定义", "永久"), //兔子胡萝卜绒线帽
    Array(1001085, 5000, "未定义", "永久"), //粉蝴蝶发卡
    Array(1061148, 5000, "未定义", "永久"), //巨星粉色短裙
    Array(1061001, 5000, "未定义", "永久"), //蓝超短裙
    Array(1061007, 5000, "未定义", "永久"), //红超短裙 
    Array(1061126, 5000, "未定义", "永久"), //白色超短裙
    Array(1061067, 5000, "未定义", "永久"), //热裤
    Array(1081007, 5000, "未定义", "永久")//伊丽莎白手套
    );

var qltz = Array(
    Array(1051200, 20000, "未定义", "永久"), //邦妮女孩套服
    Array(1050161, 20000, "未定义", "永久"), //邦妮男孩套服
    Array(1050177, 20000, "未定义", "永久"), //MapleBoy套服
    Array(1051218, 20000, "未定义", "永久"), //MapleGirl套服
    Array(1052727, 20000, "未定义", "永久"), //快乐连体衫
    Array(1052728, 20000, "未定义", "永久"), //快乐连衣裙
    Array(1051357, 20000, "未定义", "永久"), //可爱棒球服（女）
    Array(1050291, 20000, "未定义", "永久"), //可爱棒球服（男）
    Array(1000072, 20000, "未定义", "永久"), //蓝色钱包君（男）
    Array(1001095, 20000, "未定义", "永久"), //粉色钱包君（女）
    Array(1050299, 20000, "未定义", "永久"), //小娃娃普卡（男）
    Array(1051366, 20000, "未定义", "永久"), //小娃娃皮卡（女）
    Array(1050293, 20000, "未定义", "永久"), //海滩帅锅装（男）
    Array(1051359, 20000, "未定义", "永久"), //海滩美眉装
    Array(1050293, 20000, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 20000, "未定义", "永久"), //蓝色小背带服
    Array(1051256, 20000, "未定义", "永久"), //蓝色小背带裙
    Array(1050209, 20000, "未定义", "永久"), //黄色晚礼服-男款
    Array(1051255, 20000, "未定义", "永久"), //黄色晚礼服-女款
    Array(1042213, 3000, "未定义", "永久"), //粉色雪花卫衣
    Array(1042212, 3000, "未定义", "永久"), //蓝色点点外套
    Array(1042216, 20000, "未定义", "永久"), //红色枫叶网球服
    Array(1042217, 20000, "未定义", "永久"), //黑色枫叶网球服
    Array(1048001, 20000, "未定义", "永久"), //兔兔情侣衫  
    Array(1048002, 20000, "未定义", "永久"), //胡萝卜情侣衫 
    Array(1042313, 20000, "未定义", "永久"), //魔蘑菇T恤（柠檬黄）
    Array(1042312, 20000, "未定义", "永久"), //魔蘑菇T恤（冰雪蓝）
    Array(1042316, 20000, "未定义", "永久"), //粉色萌萌象
    Array(1042315, 20000, "未定义", "永久"), //蓝色萌萌象
    Array(1050190, 20000, "未定义", "永久"), //闪烁之星男生礼服
    Array(1051232, 20000, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1050310, 20000, "未定义", "永久"), //天生购物狂（男）
    Array(1051382, 20000, "未定义", "永久"), //天生购物狂（女）
    Array(1050318, 20000, "未定义", "永久"), //纯白礼服（男）
    Array(1051389, 20000, "未定义", "永久"), //纯白婚纱(女)
    Array(1050296, 20000, "未定义", "永久"), //超级巨星服（男）
    Array(1051362, 20000, "未定义", "永久"), //超级巨星（女）
    Array(1050300, 20000, "未定义", "永久"), //蓝色雪糕帅锅装
    Array(1051367, 20000, "未定义", "永久"), //蓝色雪糕MM装
    Array(1050145, 20000, "未定义", "永久"), //粉露肩晚礼服（男）
    Array(1051123, 20000, "未定义", "永久"), //粉露肩晚礼服（女）
    Array(1051372, 20000, "未定义", "永久"), //巧克力女孩
    Array(1050304, 20000, "未定义", "永久"), //巧克力男孩
    Array(1051368, 20000, "未定义", "永久"), //粉格纹假日装（女）
    Array(1050301, 20000, "未定义", "永久"), //蓝色格纹假日服（男）
    Array(1000070, 20000, "未定义", "永久"), //贵族骑手帽(男)
    Array(1001093, 20000, "未定义", "永久"), //贵族骑手帽（女）
    Array(1050312, 20000, "未定义", "永久"), //贵族骑手装(男)
    Array(1051384, 20000, "未定义", "永久")//贵族骑手装（女）

    );

var stxz = Array(
    Array(1082511, 3000, "未定义", "永久"), //小恐龙绿豆手套
    Array(1082519, 3000, "未定义", "永久"), //小恐龙云豆手套
    Array(1082312, 3000, "未定义", "永久"), //彩虹护腕
    Array(1082493, 3000, "未定义", "永久"), //海豹白白手套
    Array(1082581, 3000, "未定义", "永久"), //巧克力发带装饰
    Array(1082549, 3000, "未定义", "永久"), //咯咯嗒手套
    Array(1082503, 3000, "未定义", "永久"), //圣洁天使手镯
    Array(1082548, 3000, "未定义", "永久"), //星星手镯
    Array(1082502, 3000, "未定义", "永久"), //蓝缎带猫咪爪
    Array(1072336, 3000, "未定义", "永久"), //足球钉鞋
    Array(1072869, 3000, "未定义", "永久"), //时间旅行者的高跟鞋
    Array(1072924, 3000, "未定义", "永久"), //未来天使靴
    Array(1072913, 3000, "未定义", "永久"), //制服皮鞋
    Array(1072931, 3000, "未定义", "永久"), //爱丽丝鞋子
    Array(1072911, 3000, "未定义", "永久"), //肃清者暗靴
    Array(1072897, 3000, "未定义", "永久"), //蓝色鹿皮鞋
    Array(1072901, 3000, "未定义", "永久"), //五彩珠鞋
    Array(1072876, 3000, "未定义", "永久"), //卡卡奥熊掌鞋
    Array(1072917, 3000, "未定义", "永久"), //小马乖乖鞋
    Array(1072662, 3000, "未定义", "永久"), //明星闪耀
    Array(1072820, 3000, "未定义", "永久"), //明星熊仔鞋
    Array(1072852, 3000, "未定义", "永久"), //超级巨星鞋子
    Array(1072821, 3000, "未定义", "永久"), //金铃排队鞋
    Array(1072816, 3000, "未定义", "永久"), //女妖鞋子
    Array(1072908, 3000, "未定义", "永久"), //骑马靴
    Array(1072919, 3000, "未定义", "永久"), //蓝色蝴蝶鞋
    Array(1072918, 3000, "未定义", "永久"), //粉色蝴蝶鞋
    Array(1072858, 3000, "未定义", "永久"), //黑天鹅芭蕾鞋
    Array(1072857, 3000, "未定义", "永久"), //白天鹅芭蕾鞋
    Array(1072803, 3000, "未定义", "永久"), //小恐龙云豆爪爪
    Array(1072662, 3000, "未定义", "永久"), //小恐龙绿豆爪爪
    Array(1072791, 3000, "未定义", "永久"), //蓝缎带猫咪鞋
    Array(1072388, 3000, "未定义", "永久"), //女仆礼鞋 
    Array(1072439, 3000, "未定义", "永久"), //采草莓礼鞋
    Array(1072923, 3000, "未定义", "永久"), //波点娃娃鞋
    Array(1072848, 3000, "未定义", "永久"), //血腥吊带袜
    Array(1070057, 3000, "未定义", "永久"), //岩炎拖鞋
    Array(1071026, 3000, "未定义", "永久"), //巨星潮流靴
    Array(1072662, 3000, "未定义", "永久"), //露西亚运动鞋
    Array(1072407, 3000, "未定义", "永久"), //HELLO喵喵拖
    Array(1072438, 3000, "未定义", "永久"), //小嫩叶鞋
    Array(1072437, 3000, "未定义", "永久"), //PB拖拖
    Array(1072482, 3000, "未定义", "永久"), //熊猫拖
    Array(1072483, 3000, "未定义", "永久"), //白色登山鞋
    Array(1072484, 3000, "未定义", "永久"), //黑猫拖
    Array(1072507, 3000, "未定义", "永久"), //银色脚链
    Array(1072514, 3000, "未定义", "永久"), //天使翅膀帆布鞋
    Array(1072515, 3000, "未定义", "永久"), //狮子宝宝拖
    Array(1072516, 3000, "未定义", "永久"), //新手小鸡拖
    Array(1072517, 3000, "未定义", "永久"), //天使羽翼
    Array(1072531, 3000, "未定义", "永久"), //考拉拖鞋
    Array(1072663, 3000, "未定义", "永久"), //蓝色天使鞋
    Array(1072749, 3000, "未定义", "永久"), //泡泡巧克力鞋子
    Array(1072448, 3000, "未定义", "永久")//皇家彩虹鞋

    );


var status = 0;
var xx = -1;
var jiage = -1;

function start() {
    status = -1;
    action(1, 0, 0);
}


function action(mode, type, selection) {
    if (mode == -1) {
        cm.sendOk("#b好的,下次再见.");
        cm.dispose();
    } else {

        if (mode == 0) {
            cm.sendOk("#b好的,下次再见.");
            cm.dispose();
            return;
        }

        if (mode == 1) {
            status++;
        } else {
            status--;
        }

        //---------------------------------------------------------------------------------

        if (status == 0) {

            var add = "#rMapleStory#k,下面是本服的游戏商城区,\r\n\r\n";

            add += "   您当前位置:#b商城首页#k#r\r\n\r\n\r\n";

            add += "" + sss + "\r\n   ";

            add += "#L0##e#r点卷商城（该商场购买的物品无法放入商城背包）#l ";

            cm.sendSimple(add);

        ///////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 1) {

            if (selection == 0) {

                var add = "欢迎来到#r#eMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#b";

                add += "#L1#精美时装#l ";

                add += "#L2#戒指名片#l ";

                //		add += "#L3#本周推荐#l ";

                add += "#L4#飞天猪蛋#l \r\n";

                add += "#L5#宠物系列#l ";

                add += "#L6#精美武器#l ";

                add += "#L7#精美披风#l \r\n";

                add += "#L8#精美帽子#l ";

                add += "#L9#精美饰品#l ";

                //add += "#L10#其他物品#l ";

                add += "#L13#情侣套装#l \r\n";

                add += "#L12#我是女神#l ";

                add += "#L11#我是土豪#l ";

                add += "#L14#手套鞋子#l \r\n";

                cm.sendSimple(add);

            }

        //////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 2) {

            if (selection == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美时装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmsz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsz[i][0] + "##z" + jmsz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmsz[i][1] + " #d    使用期限:#r " + jmsz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 1

            } else if (selection == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jzmp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jzmp[i][0] + "##z" + jzmp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jzmp[i][1] + " #d    使用期限:#r " + jzmp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 2


            } else if (selection == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>本周推荐#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < tjId.length; i++) {

                    add += "\r\n#L" + i + "##v" + tjId[i][0] + "##z" + tjId[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + tjId[i][1] + " #d    使用期限:#r " + tjId[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 3;

            } else if (selection == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < syxh.length; i++) {

                    add += "\r\n#L" + i + "##v" + syxh[i][0] + "##z" + syxh[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + syxh[i][1] + " #d    购买数量:#r " + syxh[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 4;

            } else if (selection == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>宠物系列#k\r\n\r\n";
                add += "   宠物内容如果有加BUFF.增益效果.加攻击力的一律是无效技能！\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < xswp.length; i++) {

                    add += "\r\n#L" + i + "##v" + xswp[i][0] + "##z" + xswp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + xswp[i][1] + " #d    购买数量:#r " + xswp[i][2] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 5


            } else if (selection == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmwq.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmwq[i][0] + "##z" + jmwq[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmwq[i][1] + " #d    使用期限:#r " + jmwq[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 6


            } else if (selection == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmpf.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmpf[i][0] + "##z" + jmpf[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmpf[i][1] + " #d    使用期限:#r " + jmpf[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 7


            } else if (selection == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmmz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmmz[i][0] + "##z" + jmmz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmmz[i][1] + " #d    使用期限:#r " + jmmz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 8

            } else if (selection == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmsp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsp[i][0] + "##z" + jmsp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmsp[i][1] + " #d    使用期限:#r " + jmsp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 9


            } else if (selection == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>其他物品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < qtwp.length; i++) {

                    add += "\r\n#L" + i + "##v" + qtwp[i][0] + "##z" + qtwp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + qtwp[i][1] + " #d    使用期限:#r " + qtwp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 10

            } else if (selection == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是高富帅#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < gfs.length; i++) {

                    add += "\r\n#L" + i + "##v" + gfs[i][0] + "##z" + gfs[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + gfs[i][1] + " #d    使用期限:#r " + gfs[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 11


            } else if (selection == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是女神#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < ns.length; i++) {

                    add += "\r\n#L" + i + "##v" + ns[i][0] + "##z" + ns[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + ns[i][1] + " #d    使用期限:#r " + ns[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 12


            } else if (selection == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>情侣套装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < qltz.length; i++) {

                    add += "\r\n#L" + i + "##v" + qltz[i][0] + "##z" + qltz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + qltz[i][1] + " #d    使用期限:#r " + qltz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 13


            } else if (selection == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < stxz.length; i++) {

                    add += "\r\n#L" + i + "##v" + stxz[i][0] + "##z" + stxz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + stxz[i][1] + " #d    使用期限:#r " + stxz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 14

            }

        ////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 3) {

            if (xx == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美时装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsz[selection][0] + "# #z" + jmsz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsz[selection][1] + " #d    使用期限:#r " + jmsz[selection][3] + "\r\n                              ";

                add += "   #L1#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jzmp[selection][0] + "# #z" + jzmp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jzmp[selection][1] + " #d    使用期限:#r " + jzmp[selection][3] + "\r\n                              ";

                add += "   #L2#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>本周推荐#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + tjId[selection][0] + "# #z" + tjId[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + tjId[selection][1] + " #d    使用期限:#r " + tjId[selection][3] + "\r\n                              ";

                add += "   #L3#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + syxh[selection][0] + "# #z" + syxh[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + syxh[selection][1] + " #d    购买数量:#r " + syxh[selection][3] + "\r\n                              ";

                add += "   #L4#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>限时物品#k\r\n\r\n";

                add += "   物品:#v" + xswp[selection][0] + "# #z" + xswp[selection][0] + "##k\r\n\r\n";

                add += "   需要点卷:#r" + xswp[selection][1] + " #d        使用期限:#r " + xswp[selection][2] + "\r\n";

                add += "   #L5#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }


            if (xx == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmwq[selection][0] + "# #z" + jmwq[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmwq[selection][1] + " #d    使用期限:#r " + jmwq[selection][3] + "\r\n                              ";

                add += "   #L6#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmpf[selection][0] + "# #z" + jmpf[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmpf[selection][1] + " #d    使用期限:#r " + jmpf[selection][3] + "\r\n                              ";

                add += "   #L7#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }


            if (xx == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmmz[selection][0] + "# #z" + jmmz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmmz[selection][1] + " #d    使用期限:#r " + jmmz[selection][3] + "\r\n                              ";

                add += "   #L8#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsp[selection][0] + "# #z" + jmsp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsp[selection][1] + " #d    使用期限:#r " + jmsp[selection][3] + "\r\n                              ";

                add += "   #L9#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>其他物品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qtwp[selection][0] + "# #z" + qtwp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qtwp[selection][1] + " #d    使用期限:#r " + qtwp[selection][3] + "\r\n                              ";

                add += "   #L10#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我要当高富帅#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + gfs[selection][0] + "# #z" + gfs[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + gfs[selection][1] + " #d    使用期限:#r " + gfs[selection][3] + "\r\n                              ";

                add += "   #L11#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是女神#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + ns[selection][0] + "# #z" + ns[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + ns[selection][1] + " #d    使用期限:#r " + ns[selection][3] + "\r\n                              ";

                add += "   #L12#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>情侣套装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qltz[selection][0] + "# #z" + qltz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qltz[selection][1] + " #d    使用期限:#r " + qltz[selection][3] + "\r\n                              ";

                add += "   #L13#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + stxz[selection][0] + "# #z" + stxz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + stxz[selection][1] + " #d    使用期限:#r " + stxz[selection][3] + "\r\n                              ";

                add += "   #L14#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

        ///////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 4) {


            if (selection == 1) {
                if (cm.getPlayer().getCSPoints(1) >= jmsz[jiage][1]) {
                    //cm.gainItem(jmsz[jiage][0], 1);
					item = cm.gainGachaponItem(jmsz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmsz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 2) {
                if (cm.getPlayer().getCSPoints(1) >= jzmp[jiage][1]) {
					item = cm.gainGachaponItem(jzmp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jzmp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 3) {
                if (cm.getPlayer().getCSPoints(1) >= tjId[jiage][1]) {
                    cm.getPlayer().modifyCSPoints(1, -tjId[jiage][1]);
                    var ii = server.MapleItemInformationProvider.getInstance();
                    var type = ii.getInventoryType(tjId[jiage][0]);
                    var toDrop = ii.randomizeStats(ii.getEquipById(tjId[jiage][0])).copy();
                    var temptime = new java.sql.Timestamp(java.lang.System.currentTimeMillis() + tjId[jiage][4]);
                    toDrop.setExpiration(temptime);
                    toDrop.setLocked(1);
                    cm.getPlayer().getInventory(type).addItem(toDrop);
                    cm.getC().getSession().write(tools.MaplePacketCreator.addInventorySlot(type, toDrop));
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 4) {
                if (cm.getPlayer().getCSPoints(1) >= syxh[jiage][1]) {
					item = cm.gainGachaponItem(syxh[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -syxh[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }


            } else if (selection == 5) {
                if (cm.getPlayer().getCSPoints(1) >= xswp[jiage][1]) {
                    cm.getPlayer().modifyCSPoints(1, -xswp[jiage][1]);
					cm.gainPet(xswp[jiage][0],xswp[jiage][2],1,100,100,90);
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 6) {
                if (cm.getPlayer().getCSPoints(1) >= jmwq[jiage][1]) {
					item = cm.gainGachaponItem(jmwq[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmwq[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 7) {
                if (cm.getPlayer().getCSPoints(1) >= jmpf[jiage][1]) {
					item = cm.gainGachaponItem(jmpf[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmpf[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 8) {
                if (cm.getPlayer().getCSPoints(1) >= jmmz[jiage][1]) {
					item = cm.gainGachaponItem(jmmz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmmz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 9) {
                if (cm.getPlayer().getCSPoints(1) >= jmsp[jiage][1]) {
					item = cm.gainGachaponItem(jmsp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmsp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 10) {
                if (cm.getPlayer().getCSPoints(1) >= qtwp[jiage][1]) {
					item = cm.gainGachaponItem(qtwp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -qtwp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 11) {
                if (cm.getPlayer().getCSPoints(1) >= gfs[jiage][1]) {
					item = cm.gainGachaponItem(gfs[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -gfs[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 12) {
                if (cm.getPlayer().getCSPoints(1) >= ns[jiage][1]) {
					item = cm.gainGachaponItem(ns[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -ns[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 13) {
                if (cm.getPlayer().getCSPoints(1) >= qltz[jiage][1]) {
					item = cm.gainGachaponItem(qltz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -qltz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 14) {
                if (cm.getPlayer().getCSPoints(1) >= stxz[jiage][1]) {
					item = cm.gainGachaponItem(stxz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -stxz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }
            }
        }
    }

}
//load("nashorn:mozilla_compat.js");

/*//importPackage(Packages.java.util);
//importPackage(Packages.client);
//importPackage(Packages.server);


var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var item;


var jmsz = Array(
    Array(1052142, 3000, "未定义", "永久"), //背带短裤套装 
    Array(1052599, 3000, "未定义", "永久"), //奥兹魔法长袍
    Array(1052598, 3000, "未定义", "永久"), //胡克的船长长袍
    Array(1052576, 3000, "未定义", "永久"), //斯乌黑色之翼制服
    Array(1052290, 3000, "未定义", "永久"), //唤灵斗师套装
    Array(1052675, 3000, "未定义", "永久"), //万圣节幻影帽子套服
    Array(1052605, 3000, "未定义", "永久"), //舒适绵羊睡衣
    Array(1052749, 3000, "未定义", "永久"), //未来天使服
    Array(1052750, 3000, "未定义", "永久"), //未来医生套服
    Array(1052550, 3000, "未定义", "永久"), //时间旅行者的礼服
    Array(1052643, 3000, "未定义", "永久"), //血腥珍妮
    Array(1052655, 3000, "未定义", "永久"), //熊宝宝全身装
    Array(1052253, 3000, "未定义", "永久"), //青草背带裤套装
    Array(1052549, 3000, "未定义", "永久"), //红勇士马甲
    Array(1052757, 3000, "未定义", "永久"), //爱丽丝礼服
    Array(1050113, 3000, "未定义", "永久"), //燕尾服(男)
    Array(1052234, 3000, "未定义", "永久"), //绅士套服
    Array(1052439, 3000, "未定义", "永久"), //魔法学校校服
    Array(1052536, 3000, "未定义", "永久"), //水手装
    Array(1052568, 3000, "未定义", "永久"), //华丽圣诞套服
    Array(1052601, 3000, "未定义", "永久"), //废都高校校服
    Array(1052628, 3000, "未定义", "永久"), //蓝色制服
    Array(1052629, 3000, "未定义", "永久"), //银色制服
    Array(1052630, 3000, "未定义", "永久"), //黑色制服
    Array(1052438, 3000, "未定义", "永久"), //麻薯巧克力衣服
    Array(1052539, 3000, "未定义", "永久"), //蓝道服
    Array(1052538, 3000, "未定义", "永久"), //鬼怪服
    Array(1052449, 3000, "未定义", "永久"), //时尚香肠套服
    Array(1052455, 3000, "未定义", "永久"), //小蜜蜂外套
    Array(1052668, 3000, "未定义", "永久"), //海豹白白服
    Array(1052594, 3000, "未定义", "永久"), //小恐龙绿豆套服
    Array(1052595, 3000, "未定义", "永久"), //小恐龙云豆套服
    Array(1052661, 3000, "未定义", "永久"), //咯咯哒娃娃装
    Array(1052602, 3000, "未定义", "永久"), //黑色管家礼服
    Array(1052726, 3000, "未定义", "永久"), //僵尸新娘全身装
    Array(1052724, 3000, "未定义", "永久"), //小马乖乖套服
    Array(1052661, 3000, "未定义", "永久"), //小鸡玩偶服 
    Array(1052660, 3000, "未定义", "永久"), //蓬松背带裤
    Array(1052571, 3000, "未定义", "永久"), //黑暗小恶魔全身装
    Array(1052275, 3000, "未定义", "永久"), //皇家彩虹夹克
    Array(1052626, 3000, "未定义", "永久"), //海洋风条纹装
    Array(1052604, 3000, "未定义", "永久"), //苍恋玫瑰礼服
    Array(1052458, 3000, "未定义", "永久"), //露西亚全身装
    Array(1050227, 3000, "未定义", "永久"), //薄荷雪套服
    Array(1052245, 3000, "未定义", "永久"), //小嫩叶套服
    Array(1050170, 3000, "未定义", "永久"), //拿破仑制服-男
    Array(1052193, 3000, "未定义", "永久"), //蜜蜂服
    Array(1050232, 3000, "未定义", "永久"), //甘菊下午茶
    Array(1050234, 3000, "未定义", "永久"), //魔术师晚礼服
    Array(1050242, 3000, "未定义", "永久"), //开场男星
    Array(1052423, 3000, "未定义", "永久"), //魔族高贵外套
    Array(1052448, 3000, "未定义", "永久"), //西红柿外套
    Array(1052503, 3000, "未定义", "永久"), //冰爽夏日全身装
    Array(1052203, 3000, "未定义", "永久"), //购物狂休闲装
    Array(1052231, 3000, "未定义", "永久"), //小王子礼服
    Array(1042242, 3000, "未定义", "永久"), //夏季野餐
    Array(1042172, 3000, "未定义", "永久"), //高尔夫上衣
    Array(1042194, 3000, "未定义", "永久"), //经典款T恤 
    Array(1042314, 3000, "未定义", "永久"), //兔兔熊T恤
    Array(1042170, 3000, "未定义", "永久"), //酷夏T恤
    Array(1042329, 3000, "未定义", "永久"), //糖果色T恤
    Array(1042320, 3000, "未定义", "永久"), //海鸥印花T恤
    Array(1042102, 3000, "未定义", "永久"), //海军T恤
    Array(1042221, 3000, "未定义", "永久"), //白色篮球T恤
    Array(1042103, 3000, "未定义", "永久"), //白色随意T恤
    Array(1042130, 3000, "未定义", "永久"), //长金链短T
    Array(1042138, 3000, "未定义", "永久"), //银链街头背心
    Array(1042134, 3000, "未定义", "永久"), //黄色半袖T恤
    Array(1042133, 3000, "未定义", "永久"), //蓝条纹两件套
    Array(1042140, 3000, "未定义", "永久"), //探险家衬衫
    Array(1042141, 3000, "未定义", "永久"), //粉星短袖T恤
    Array(1042146, 3000, "未定义", "永久"), //星星连帽衫
    Array(1042144, 3000, "未定义", "永久"), //蓝格子短袖衬衫
    Array(1042153, 3000, "未定义", "永久"), //红呢绒格子外套
    Array(1042162, 3000, "未定义", "永久"), //蓝条纹棉背心
    Array(1042164, 3000, "未定义", "永久"), //绿领带衬衫
    Array(1042177, 3000, "未定义", "永久"), //修身小外套
    Array(1042207, 3000, "未定义", "永久"), //星纹运动服
    Array(1042220, 3000, "未定义", "永久"), //亮片表演上装
    Array(1042263, 3000, "未定义", "永久"), //明星熊仔夹克
    Array(1042279, 3000, "未定义", "永久"), //训字T恤
    Array(1042280, 3000, "未定义", "永久"), //民字T恤
    Array(1042281, 3000, "未定义", "永久"), //正字T恤
    Array(1042282, 3000, "未定义", "永久"), //音字T恤
    Array(1042287, 3000, "未定义", "永久"), //红格骑士服
    Array(1042290, 3000, "未定义", "永久"), //白色背带编织服
    Array(1042292, 3000, "未定义", "永久"), //香蕉羊毛衫
    Array(1042293, 3000, "未定义", "永久"), //林之灵上衣
    Array(1042242, 3000, "未定义", "永久"), //无袖水手上衣
    Array(1042265, 3000, "未定义", "永久"), //草莓围脖小上衣
    Array(1042275, 3000, "未定义", "永久"), //青蛙雨衣
    Array(1042241, 3000, "未定义", "永久"), //飞翔紫罗兰
    Array(1042199, 3000, "未定义", "永久"), //粉色笑脸T恤
    Array(1042200, 3000, "未定义", "永久"), //蓝色笑脸T恤
    Array(1042202, 3000, "未定义", "永久"), //小企企卷边T恤
    Array(1042107, 3000, "未定义", "永久"), //紫印花T恤
    Array(1042204, 3000, "未定义", "永久"), //汉堡T恤
    Array(1042193, 3000, "未定义", "永久"), //休闲风两件套
    Array(1042198, 3000, "未定义", "永久"), //彩虹T恤
    Array(1042214, 3000, "未定义", "永久"), //粉条文两件套
    Array(1042219, 3000, "未定义", "永久"), //蓝莓糖果套头衫
    Array(1042218, 3000, "未定义", "永久"), //木莓糖果套头衫
    Array(1042222, 3000, "未定义", "永久"), //柠檬色可爱T恤
    Array(1042187, 3000, "未定义", "永久"), //粉红绒绒衫
    Array(1042189, 3000, "未定义", "永久"), //羊羊上衣
    Array(1040186, 3000, "未定义", "永久"), //牛仔衬衫
    Array(1042230, 3000, "未定义", "永久"), //防水外套
    Array(1042235, 3000, "未定义", "永久"), //爱丽丝兔子上衣
    Array(1042236, 3000, "未定义", "永久"), //苹果绿毛上衣
    Array(1042237, 3000, "未定义", "永久"), //黑白潮人马甲
    Array(1042238, 3000, "未定义", "永久"), //粉红兔毛衣
    Array(1042108, 3000, "未定义", "永久"), //水印闪星背心
    Array(1042096, 3000, "未定义", "永久"), //超人T恤
    Array(1042097, 3000, "未定义", "永久"), //印花休闲套头T恤
    Array(1042104, 3000, "未定义", "永久"), //小绿叶T恤
    Array(1042105, 3000, "未定义", "永久"), //小红叶T恤
    Array(1042142, 3000, "未定义", "永久"), //彩虹条背心
    Array(1040144, 3000, "未定义", "永久"), //巨星摩登上装（男）
    Array(1062137, 3000, "未定义", "永久"), //POP短裤（紫）
    Array(1062138, 3000, "未定义", "永久"), //POP短裤（蓝）
    Array(1062135, 3000, "未定义", "永久"), //精英裤子
    Array(1062151, 3000, "未定义", "永久"), //爱丽丝兔子裤
    Array(1062085, 3000, "未定义", "永久"), //修身小西裤
    Array(1062084, 3000, "未定义", "永久"), //细身牛仔裤
    Array(1062153, 3000, "未定义", "永久"), //假日斜纹短裤
    Array(1062130, 3000, "未定义", "永久"), //点点蓝休闲裤  
    Array(1062129, 3000, "未定义", "永久"), //点点红休闲裤 
    Array(1062054, 3000, "未定义", "永久"), //南瓜裤
    Array(1062053, 3000, "未定义", "永久"), //粉边白短裤
    Array(1062066, 3000, "未定义", "永久"), //白色破颇牛仔裤
    Array(1062110, 3000, "未定义", "永久"), //baby粉色灯笼裤
    Array(1062111, 3000, "未定义", "永久"), //蓝色蝴蝶结短裤
    Array(1062113, 3000, "未定义", "永久"), //彩铅短裤
    Array(1062114, 3000, "未定义", "永久"), //心心相映短裤
    Array(1062152, 3000, "未定义", "永久"), //荧光粉色短裤
    Array(1062154, 3000, "未定义", "永久"), //分层斜纹短裤
    Array(1062156, 3000, "未定义", "永久"), //紫色马赛克短裤
    Array(1062157, 3000, "未定义", "永久")//草莓巧克力短裤
    );


var jmwq = Array(
    Array(1702640, 10000, "未定义", "永久"), //兔儿雪绒绒
    Array(1702633, 10000, "未定义", "永久"), //小猴
    Array(1702630, 10000, "未定义", "永久"), //吊兰花灯
    Array(1702626, 10000, "未定义", "永久"), //海洋提包
    Array(1702625, 10000, "未定义", "永久"), //蓝鸟
    Array(1702611, 10000, "未定义", "永久"), //鸭子
    Array(1702617, 10000, "未定义", "永久"), //莲花
    Array(1702608, 10000, "未定义", "永久"), //伞
    Array(1702607, 10000, "未定义", "永久"), //萝卜
    Array(1702598, 10000, "未定义", "永久"), //枫叶
    Array(1702595, 10000, "未定义", "永久"), //下午茶
    Array(1702581, 10000, "未定义", "永久"), //三色
    Array(1702576, 10000, "未定义", "永久"), //锤子
    Array(1702571, 10000, "未定义", "永久"), //下午茶
    Array(1702577, 10000, "未定义", "永久"), //渔网
    Array(1702553, 10000, "未定义", "永久"), //毒瓶子
    Array(1702557, 10000, "未定义", "永久"), //清扫
    Array(1702550, 10000, "未定义", "永久"), //桃太郎
    Array(1702549, 10000, "未定义", "永久"), //啦啦队
    Array(1702555, 10000, "未定义", "永久"), //黑山自
    Array(1702548, 10000, "未定义", "永久"), //香蕉
    Array(1702529, 10000, "未定义", "永久"), //影子
    Array(1702530, 10000, "未定义", "永久"), //糖果
    Array(1702523, 10000, "未定义", "永久"), //彩虹
    Array(1702455, 10000, "未定义", "永久"), //油漆
    Array(1702447, 10000, "未定义", "永久"), //炎蛇
    Array(1702374, 3000, "未定义", "永久"), //剑豪之刃
    Array(1702212, 3000, "未定义", "永久"), //异界之器
    Array(1702091, 3000, "未定义", "永久"), //网球拍
    Array(1702115, 3000, "未定义", "永久"), //玫瑰花
    Array(1702217, 3000, "未定义", "永久"), //黄鸭子游泳圈
    Array(1702228, 3000, "未定义", "永久"), //可可香蕉
    Array(1702230, 3000, "未定义", "永久"), //冰蓝雪糕
    Array(1702237, 3000, "未定义", "永久"), //千年白狐
    Array(1702256, 3000, "未定义", "永久"), //风灵使者娃娃
    Array(1702257, 3000, "未定义", "永久"), //魂骑士娃娃
    Array(1702258, 3000, "未定义", "永久"), //炎术士娃娃
    Array(1702259, 3000, "未定义", "永久"), //奇袭者娃娃
    Array(1702260, 3000, "未定义", "永久"), //夜行者娃娃
    Array(1702261, 3000, "未定义", "永久"), //樱花棒
    Array(1702194, 3000, "未定义", "永久"), //圣火火炬
    Array(1702288, 3000, "未定义", "永久"), //豹弩游侠弩
    Array(1702318, 3000, "未定义", "永久"), //暮光雷光剑
    Array(1702319, 3000, "未定义", "永久"), //苹果绿雷光剑
    Array(1702317, 3000, "未定义", "永久"), //血红宝石雷光剑
    Array(1702320, 3000, "未定义", "永久"), //蓝灰闪电雷光剑
    Array(1702321, 3000, "未定义", "永久"), //黑暗中子星雷光剑
    Array(1702322, 3000, "未定义", "永久"), //固态黑色雷光剑
    Array(1702323, 3000, "未定义", "永久"), //翁布拉&鲁切雷光剑
    Array(1702186, 3000, "未定义", "永久"), //迪波
    Array(1702209, 3000, "未定义", "永久"), //驯鹿拐杖
    Array(1702204, 3000, "未定义", "永久"), //日本铁扇
    Array(1702203, 3000, "未定义", "永久"), //万圣节泰迪熊
    Array(1702150, 3000, "未定义", "永久"), //冰凌刀
    Array(1702149, 3000, "未定义", "永久"), //熔岩刀
    Array(1702157, 3000, "未定义", "永久"), //火烤棉花糖
    Array(1702161, 3000, "未定义", "永久"), //凶恶的狗狗
    Array(1702136, 3000, "未定义", "永久"), //雪之花
    Array(1702120, 3000, "未定义", "永久"), //比耶莫特的剑
    Array(1702118, 3000, "未定义", "永久"), //亚努斯的剑
    Array(1702119, 3000, "未定义", "永久"), //夏奇尔的剑
    Array(1702296, 3000, "未定义", "永久"), //溜溜球
    Array(1702285, 3000, "未定义", "永久"), //蓝色蝴蝶结手提包
    Array(1702302, 3000, "未定义", "永久"), //杯具
    Array(1702208, 3000, "未定义", "永久"), //搞怪鳄鱼
    Array(1702305, 3000, "未定义", "永久"), //胡萝卜武器
    Array(1702310, 3000, "未定义", "永久"), //星光魔法棒
    Array(1702374, 3000, "未定义", "永久"), //剑豪之刃
    Array(1702306, 3000, "未定义", "永久"), //花风芭蕉扇
    Array(1702379, 3000, "未定义", "永久"), //阿拉伯魔术洋灯
    Array(1702378, 3000, "未定义", "永久"), //国庆闪亮之光
    Array(1702263, 3000, "未定义", "永久"), //小灰灰猫
    Array(1702308, 3000, "未定义", "永久"), //魔术师帽子
    Array(1702298, 3000, "未定义", "永久"), //暗影刀子
    Array(1702291, 3000, "未定义", "永久"), //玲珑扇
    Array(1702293, 3000, "未定义", "永久"), //秋天旅行者背包
    Array(1702299, 3000, "未定义", "永久"), //可爱巧克力棒
    Array(1702300, 3000, "未定义", "永久"), //电蚊拍
    Array(1702328, 3000, "未定义", "永久"), //粉红天使注射器
    Array(1702329, 3000, "未定义", "永久"), //喜欢草莓
    Array(1702233, 3000, "未定义", "永久"), //彩虹毛笔
    Array(1702187, 3000, "未定义", "永久"), //蓝色极光
    Array(1702188, 3000, "未定义", "永久"), //粉色极光
    Array(1702193, 3000, "未定义", "永久"), //湿抹布
    Array(1702248, 3000, "未定义", "永久"), //圣诞武器
    Array(1702252, 3000, "未定义", "永久"), //鹰的飞舞
    Array(1702276, 3000, "未定义", "永久"), //天际之弓
    Array(1702283, 3000, "未定义", "永久"), //天界圣战手镯
    Array(1702279, 3000, "未定义", "永久"), //天界圣战之剑
    Array(1702280, 3000, "未定义", "永久"), //天界圣战巨剑
    Array(1702281, 3000, "未定义", "永久"), //天界圣战法杖
    Array(1702282, 3000, "未定义", "永久"), //天界圣战藏弓
    Array(1702362, 3000, "未定义", "永久"), //我的好友品克缤
    Array(1702324, 3000, "未定义", "永久"), //冲击波
    Array(1702323, 3000, "未定义", "永久"), //鲁切雷光剑
    Array(1702313, 3000, "未定义", "永久"), //橙色极光
    Array(1702314, 3000, "未定义", "永久"), //天堂极光
    Array(1702315, 3000, "未定义", "永久"), //斯泰拉极光
    Array(1702316, 3000, "未定义", "永久"), //动态极光
    Array(1702295, 3000, "未定义", "永久"), //扑克牌
    Array(1702348, 3000, "未定义", "永久"), //雪片
    Array(1702274, 3000, "未定义", "永久"), //神龙手套
    Array(1702301, 3000, "未定义", "永久")//兔兔魔力棒
    );


var jzmp = Array(
    Array(1112197, 3000, "未定义", "永久"), //钻石聊天戒指
    Array(1115010, 3000, "未定义", "永久"), //钻石聊天戒指
    Array(1112198, 3000, "未定义", "永久"), //黄金聊天戒指
    Array(1115011, 3000, "未定义", "永久"), //小熊猫聊天戒指
    Array(1112199, 3000, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1115015, 3000, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1112144, 3000, "未定义", "永久"), //虎喵名片戒指
    Array(1112256, 3000, "未定义", "永久"), //虎喵聊天戒指
    Array(1112261, 3000, "未定义", "永久"), //Naver对话框戒指
    Array(1112149, 3000, "未定义", "永久"), //Naver名片戒指
    Array(1112120, 3000, "未定义", "永久"), //可乐(White) 名片戒指
    Array(1112230, 3000, "未定义", "永久"), //可乐(White)聊天戒
    Array(1112272, 3000, "未定义", "永久"), //西瓜物语聊天戒指
    Array(1112160, 3000, "未定义", "永久"), //西瓜物语名片戒指
    Array(1112268, 3000, "未定义", "永久"), //猪猪聊天戒指
    Array(1112156, 3000, "未定义", "永久"), //猪猪名片戒指
    Array(1112267, 3000, "未定义", "永久"), //青蛙聊天戒指
    Array(1112155, 3000, "未定义", "永久"), //青蛙名片戒指
    Array(1112277, 3000, "未定义", "永久"), //绿光森林聊天戒指
    Array(1112165, 3000, "未定义", "永久"), //绿光森林名片戒指
    Array(1112270, 3000, "未定义", "永久"), //我爱胡子聊天戒指(红色)
    Array(1112158, 3000, "未定义", "永久"), //我爱胡子名片戒指(红色)
    Array(1112269, 3000, "未定义", "永久"), //我爱胡子聊天戒指(蓝色)
    Array(1112157, 3000, "未定义", "永久"), //我爱胡子名片戒指(蓝色)
    Array(1112278, 3000, "未定义", "永久"), //乖宝贝聊天戒指
    Array(1112166, 3000, "未定义", "永久"), //乖宝贝名片戒指
    Array(1112253, 3000, "未定义", "永久"), //木乃伊聊天戒指
    Array(1112142, 3000, "未定义", "永久"), //木乃伊名片戒指
    Array(1112257, 3000, "未定义", "永久"), //浪漫花边聊天戒指
    Array(1112145, 3000, "未定义", "永久"), //浪漫花边名片戒指
    Array(1112258, 3000, "未定义", "永久"), //青苹果之恋聊天戒指
    Array(1112146, 3000, "未定义", "永久"), //青苹果之恋名片戒指
    Array(1112263, 3000, "未定义", "永久"), //美味蛋糕聊天戒指
    Array(1112151, 3000, "未定义", "永久"), //美味蛋糕名片戒指
    Array(1112171, 3000, "未定义", "永久"), //狗狗名片戒指
    Array(1112172, 3000, "未定义", "永久"), // 狗狗名片戒指
    Array(1112173, 3000, "未定义", "永久"), //奶白兔名片戒指
    Array(1112285, 3000, "未定义", "永久"), //奶白兔LT戒指
    Array(1112174, 3000, "未定义", "永久"), //足球聊天戒指
    Array(1112175, 3000, "未定义", "永久"), //足球MP戒指
    Array(1112176, 3000, "未定义", "永久"), //旋律戒指
    Array(1112288, 3000, "未定义", "永久"), //旋律戒指
    Array(1112177, 3000, "未定义", "永久"), //进击聊天戒指
    Array(1112289, 3000, "未定义", "永久"), //进击聊天戒指
    Array(1112283, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112171, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112284, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112172, 3000, "未定义", "永久"), //GG聊天戒指
    Array(1112276, 3000, "未定义", "永久"), //XR聊天戒指
    Array(1112164, 3000, "未定义", "永久"), //XR聊天戒指
    Array(1112290, 3000, "未定义", "永久"), //MH聊天戒指
    Array(1112178, 3000, "未定义", "永久"), //MH聊天戒指
    Array(1112291, 3000, "未定义", "永久"), //XH聊天戒指
    Array(1112179, 3000, "未定义", "永久"), //XH聊天戒指
    Array(1112190, 3000, "未定义", "永久"), //AC聊天戒指
    Array(1115003, 3000, "未定义", "永久"), //AC聊天戒指
    Array(1112191, 3000, "未定义", "永久"), //MF聊天戒指
    Array(1115004, 3000, "未定义", "永久"), //MF聊天戒指
    Array(1112192, 3000, "未定义", "永久"), //BL聊天戒指
    Array(1115005, 3000, "未定义", "永久"), //BL聊天戒指
    Array(1112193, 3000, "未定义", "永久"), //gz聊天戒指
    Array(1115006, 3000, "未定义", "永久"), //gz聊天戒指
    Array(1112194, 3000, "未定义", "永久"), //GL聊天戒指
    Array(1115007, 3000, "未定义", "永久"), //GL聊天戒指
    Array(1112195, 3000, "未定义", "永久"), //KL聊天戒指
    Array(1115008, 3000, "未定义", "永久"), //KL聊天戒指
    Array(1112196, 3000, "未定义", "永久"), //CT聊天戒指
    Array(1115009, 3000, "未定义", "永久"), //CT聊天戒指
    Array(1112237, 3000, "未定义", "永久"), //小竹林聊天戒指
    Array(1112134, 3000, "未定义", "永久")//小竹林名片戒指
    );

var tjId = Array(
    Array(3010163, 2000, "未定义", "10天", 60000 * 60 * 24 * 10, 1)//满月椅子
    );

var syxh = Array(
    Array(2340000, 3000, "未定义", 1), //祝福卷轴
    Array(2049100, 2000, "未定义", 1), //混沌卷轴60%
    Array(2340000, 60000, "未定义", 6), //祝福卷轴
    Array(2049100, 19000, "未定义", 10)//混沌卷轴60%
    );

var tscl = Array(
    Array(4000151, 1000, 100), //时间门神的轴标
    Array(4001109, 1000, 5)//强化玻璃瓶
    );

var xswp = Array(
    Array(5000191, 66666, "神马", 60000 * 60 * 90 * 1, 1),
    Array(5000212, 20000, "火红小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000213, 20000, "幽青小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000214, 20000, "雷黄小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000244, 20000, "冰龙", 60000 * 60 * 90 * 1, 1),
    Array(5000013, 10000, "大象", 60000 * 60 * 90 * 1, 1),
    Array(5000014, 10000, "圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000055, 10000, "水晶银圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000053, 10000, "大猩猩机器人", 60000 * 60 * 90 * 1, 1),
    Array(5000038, 10000, "萌太郎", 60000 * 60 * 90 * 1, 1),
    Array(5000072, 10000, "臭鼬", 60000 * 60 * 90 * 1, 1),
    Array(5000075, 10000, "小象宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000076, 10000, "威尔士柯基狗", 60000 * 60 * 90 * 1, 1),
    Array(5000077, 10000, "波斯猫", 60000 * 60 * 90 * 1, 1),
    Array(5000081, 10000, "飞行小鲸鱼", 60000 * 60 * 90 * 1, 1),
    Array(5000084, 10000, "独角兽安塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000085, 10000, "蛋糕宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000086, 10000, "馅饼宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000089, 10000, "独角兽迪埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000090, 10000, "独角兽吉尼", 60000 * 60 * 90 * 1, 1),
    Array(5000091, 10000, "独角兽埃塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000096, 10000, "稀有白色小象", 60000 * 60 * 90 * 1, 1),
    Array(5000250, 10000, "粉小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000251, 10000, "蓝小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000252, 10000, "艾克索", 60000 * 60 * 90 * 1, 1),
    Array(5000253, 10000, "阿黛尔", 60000 * 60 * 90 * 1, 1),
    Array(5000264, 10000, "跳跳袋鼠", 60000 * 60 * 90 * 1, 1),
    Array(5000271, 10000, "绿色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000272, 10000, "黄色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000273, 10000, "粉色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000274, 10000, "豆豆蛇", 60000 * 60 * 90 * 1, 1),
    Array(5000284, 20000, "冰骑士", 60000 * 60 * 90 * 1, 1),
    Array(5000287, 20000, "血腥皇后", 60000 * 60 * 90 * 1, 1),
    Array(5000288, 20000, "半半", 60000 * 60 * 90 * 1, 1),
    Array(5000289, 20000, "皮埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000290, 20000, "天使提尔", 60000 * 60 * 90 * 1, 1),
    Array(5000291, 20000, "天使拉尔", 60000 * 60 * 90 * 1, 1),
    Array(5000292, 20000, "天使米尔", 60000 * 60 * 90 * 1, 1),
    Array(5000293, 20000, "蜜桃鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000294, 20000, "薄荷鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000295, 20000, "紫色鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000320, 20000, "铠鼠爱因", 60000 * 60 * 90 * 1, 1),
    Array(5000321, 20000, "铠鼠居里", 60000 * 60 * 90 * 1, 1),
    Array(5000322, 20000, "铠鼠牛顿", 60000 * 60 * 90 * 1, 1),
    Array(5000324, 20000, "火柴人宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000330, 20000, "MINI班雷昂", 60000 * 60 * 90 * 1, 1),
    Array(5000331, 20000, "MINI奥尔卡", 60000 * 60 * 90 * 1, 1),
    Array(5000332, 20000, "MINI希拉", 60000 * 60 * 90 * 1, 1),
    Array(5000369, 20000, "小拉伊", 60000 * 60 * 90 * 1, 1),
    Array(5000370, 20000, "小波波", 60000 * 60 * 90 * 1, 1),
    Array(5000371, 20000, "小阿尔", 60000 * 60 * 90 * 1, 1),
    Array(5000391, 20000, "黄金虾", 60000 * 60 * 90 * 1, 1),
    Array(5000528, 60000, "猫鼬家族", 60000 * 60 * 90 * 1, 1),
    Array(5000402, 20000, "芭蕾女孩丽恩", 60000 * 60 * 90 * 1, 1)
    );


var jmpf = Array(
    Array(1102665, 3000, "未定义", "永久"), //狐狸围脖
    Array(1102217, 3000, "未定义", "永久"), //九尾披风
    Array(1102625, 3000, "未定义", "永久"), //红色蜗牛壳
    Array(1102651, 13000, "未定义", "永久"), //小浣熊尾巴
    Array(1102652, 13000, "未定义", "永久"), //松鼠尾巴
    Array(1102654, 13000, "未定义", "永久"), //狗狗尾巴
    Array(1102655, 13000, "未定义", "永久"), //熊熊尾巴
    Array(1102188, 3000, "未定义", "永久"), //银色狐狸尾巴
    Array(1102187, 3000, "未定义", "永久"), //金色狐狸尾巴
    Array(1102648, 3000, "未定义", "永久"), //K君的猫尾巴
    Array(1102387, 3000, "未定义", "永久"), //海龙尾巴
    Array(1102388, 3000, "未定义", "永久"), //炎龙尾巴
    Array(1102292, 3000, "未定义", "永久"), //尾巴
    Array(1102296, 3000, "未定义", "永久"), //夜叉尾巴（黑色）
    Array(1102656, 3000, "未定义", "永久"), //动物尾巴6
    Array(1102622, 3000, "未定义", "永久"), //时间旅行者的怀表
    Array(1102692, 3000, "未定义", "永久"), //寿司团
    Array(1102574, 3000, "未定义", "永久"), //小鸡叽叽叽
    Array(1102380, 3000, "未定义", "永久"), //我的朋友青蛙酱
    Array(1102549, 3000, "未定义", "永久"), //管家的猫咪
    Array(1102705, 3000, "未定义", "永久"), //企鹅书包
    Array(1102683, 3000, "未定义", "永久"), //兔兔熊背包
    Array(1102684, 3000, "未定义", "永久"), //未来医生听诊器
    Array(1102682, 3000, "未定义", "永久"), //未来天使注射器
    Array(1102593, 3000, "未定义", "永久"), //浮漾的翅膀
    Array(1102668, 3000, "未定义", "永久"), //夜天使之翼
    Array(1102353, 3000, "未定义", "永久"), //自由的翅膀
    Array(1102554, 3000, "未定义", "永久"), //女妖之翼
    Array(1102391, 3000, "未定义", "永久"), //小蜜蜂翅膀
    Array(1102325, 3000, "未定义", "永久"), //紫天使羽翼
    Array(1102326, 3000, "未定义", "永久"), //蓝天使羽翼
    Array(1102389, 3000, "未定义", "永久"), //金色天使
    Array(1102390, 3000, "未定义", "永久"), //银色天使
    Array(1102273, 3000, "未定义", "永久"), //路西法之翼
    Array(1102349, 3000, "未定义", "永久"), //发光精灵翅膀
    Array(1102293, 3000, "未定义", "永久"), //羁绊之翼
    Array(1102152, 3000, "未定义", "永久"), //黑骷髅海盗旗
    Array(1102300, 3000, "未定义", "永久"), //派对舞会灯
    Array(1102288, 3000, "未定义", "永久"), //背背雪人
    Array(1102274, 3000, "未定义", "永久"), //刺柏刀
    Array(1102310, 3000, "未定义", "永久"), //精灵披风
    Array(1102461, 3000, "未定义", "永久"), //粉嫩披风
    Array(1102222, 3000, "未定义", "永久"), //死神披风
    Array(1102583, 3000, "未定义", "永久"), //宝贝龙波比
    Array(1102232, 3000, "未定义", "永久"), //小王子的星星
    Array(1102218, 3000, "未定义", "永久"), //仙女飘飘
    Array(1102356, 3000, "未定义", "永久"), //天使祖母绿
    Array(1102270, 3000, "未定义", "永久"), //风和日丽
    Array(1102261, 3000, "未定义", "永久"), //音符围脖
    Array(1102251, 3000, "未定义", "永久"), //世界杯手巾
    Array(1102373, 3000, "未定义", "永久"), //露西娅披风
    Array(1102301, 3000, "未定义", "永久"), //旅行者披风
    Array(1102255, 3000, "未定义", "永久"), //唤灵斗师披风
    Array(1102254, 3000, "未定义", "永久"), //豹弩游侠披风
    Array(1102242, 3000, "未定义", "永久"), //胡克的船长披风
    Array(1102249, 3000, "未定义", "永久"), //奥兹魔法披风
    Array(1102239, 3000, "未定义", "永久"), //暗影双刀披风
    Array(1102355, 3000, "未定义", "永久"), //怪盗幻影披风
    Array(1102673, 3000, "未定义", "永久"), //僵尸新娘披风
    Array(1102324, 3000, "未定义", "永久"), //传说双层气球
    Array(1102212, 3000, "未定义", "永久"), //丢失的小孩
    Array(1102233, 3000, "未定义", "永久"), //雪娃娃披风
    Array(1102230, 3000, "未定义", "永久"), //企企雪橇披风
    Array(1102245, 3000, "未定义", "永久"), //太阳披风
    Array(1102258, 3000, "未定义", "永久"), //玩具熊气球
    Array(1102215, 3000, "未定义", "永久"), //气球串
    Array(1102271, 3000, "未定义", "永久"), //可爱巧克力棒气球
    Array(1102488, 3000, "未定义", "永久"), //蛋糕杯气球
    Array(1102285, 3000, "未定义", "永久"), //晴天娃娃(粉色)
    Array(1102286, 3000, "未定义", "永久"), //晴天娃娃(天蓝色)
    Array(1102287, 3000, "未定义", "永久")//晴天娃娃(淡黄色)
    );


var jmmz = Array(
    Array(1002960, 3000, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1004639, 3000, "未定义", "永久"), //北极罩帽
    Array(1004636, 3000, "未定义", "永久"), //香蕉郊游帽
    Array(1004628, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004629, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004630, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004631, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004632, 3000, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004602, 3000, "未定义", "永久"), //农夫的瑰宝
    Array(1004601, 3000, "未定义", "永久"), //小企鹅帽子
    Array(1004589, 3000, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570, 3000, "未定义", "永久"), //黑色海魂帽
    Array(1004571, 3000, "未定义", "永久"), //海贼团贝雷帽
    Array(1004568, 3000, "未定义", "永久"), //呆萌鼠鼠帽
    Array(1004543, 3000, "未定义", "永久"), //复古头巾
    Array(1004544, 3000, "未定义", "永久"), //棒球帽
    Array(1004545, 3000, "未定义", "永久"), //棒球帽
    Array(1004546, 3000, "未定义", "永久"), //棒球帽
    Array(1004547, 3000, "未定义", "永久"), //棒球帽
    Array(1004548, 3000, "未定义", "永久"), //棒球帽
    Array(1004532, 3000, "未定义", "永久"), //女皇关注
    Array(1004533, 3000, "未定义", "永久"), //女皇关注
    Array(1004535, 3000, "未定义", "永久"), //女皇关注
    Array(1004540, 3000, "未定义", "永久"), //女皇关注
    Array(1004541, 3000, "未定义", "永久"), //女皇关注
    Array(1004542, 3000, "未定义", "永久"), //女皇关注
    Array(1004530, 3000, "未定义", "永久"), //蓝色熊猫玩偶帽子
    Array(1004510, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004511, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004512, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004513, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004514, 3000, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004503, 3000, "未定义", "永久"), //黑猫
    Array(1004504, 3000, "未定义", "永久"), //黑猫
    Array(1004505, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1004499, 3000, "未定义", "永久"), //蓝鱼帽子
    Array(1004500, 3000, "未定义", "永久"), //黑猫
    Array(1004491, 3000, "未定义", "永久"), //西红柿
    Array(1004486, 3000, "未定义", "永久"), //春之主人
    Array(1004463, 3000, "未定义", "永久"), //方块兔子
    Array(1004467, 3000, "未定义", "永久"), //方块兔子
    Array(1004469, 3000, "未定义", "永久"), //方块兔子
    Array(1004470, 3000, "未定义", "永久"), //方块兔子
    Array(1004471, 3000, "未定义", "永久"), //方块兔子
    Array(1004472, 3000, "未定义", "永久"), //黑猫
    Array(1004473, 3000, "未定义", "永久"), //黑猫
    Array(1004478, 3000, "未定义", "永久"), //黑猫
    Array(1004480, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004572, 3000, "未定义", "永久"), //黑猫
    Array(1004506, 3000, "未定义", "永久"), //黑猫
    Array(1003084, 3000, "未定义", "永久"), //帝国皇冠
    Array(1003861, 3000, "未定义", "永久"), //明星小皇冠
    Array(1003401, 3000, "未定义", "永久"), //黑暗伊卡尔特
    Array(1003402, 3000, "未定义", "永久"), //黑暗胡克
    Array(1003458, 3000, "未定义", "永久"), //茅山道士帽
    Array(1003104, 3000, "未定义", "永久"), //巨型蛋糕帽
    Array(1003246, 3000, "未定义", "永久"), //可爱兔子帽
    Array(1004112, 3000, "未定义", "永久"), //刀马旦花帽
    Array(1003776, 3000, "未定义", "永久"), //海豹白白帽
    Array(1003392, 3000, "未定义", "永久"), //小蜜蜂帽子
    Array(1003802, 3000, "未定义", "永久"), //小恐龙绿豆帽子
    Array(1003803, 3000, "未定义", "永久"), //小恐龙云豆帽子
    Array(1003728, 3000, "未定义", "永久"), //蓝色精灵帽
    Array(1003727, 3000, "未定义", "永久"), //红色精灵帽
    Array(1003509, 3000, "未定义", "永久"), //时尚香肠帽
    Array(1003508, 3000, "未定义", "永久"), //西红柿帽子
    Array(1004124, 3000, "未定义", "永久"), //恋爱小草莓帽
    Array(1004125, 3000, "未定义", "永久"), //歌唱大菠萝帽
    Array(1003829, 3000, "未定义", "永久"), //兔耳管家礼帽
    Array(1003541, 3000, "未定义", "永久"), //逆转兔帽子
    Array(1004126, 3000, "未定义", "永久"), //彩塘熊耳帽
    Array(1004092, 3000, "未定义", "永久"), //小马乖乖帽
    Array(1003842, 3000, "未定义", "永久"), //女妖帽子
    Array(1003921, 3000, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003588, 3000, "未定义", "永久"), //玩具粉熊帽子
    Array(1003909, 3000, "未定义", "永久"), //活力苏打帽
    Array(1003596, 3000, "未定义", "永久"), //金属粉色棒球帽
    Array(1003597, 3000, "未定义", "永久"), //金属冠棒球帽
    Array(1003462, 3000, "未定义", "永久"), //Kitty猫猫帽
    Array(1003268, 3000, "未定义", "永久"), //按键狂人糖果帽
    Array(1003269, 3000, "未定义", "永久"), //按键狂人玩具帽
    Array(1003241, 3000, "未定义", "永久"), //摇滚歌手帽
    Array(1003533, 3000, "未定义", "永久"), //黑暗奥尔卡军官帽
    Array(1002524, 3000, "未定义", "永久"), //可乐帽
    Array(1003790, 3000, "未定义", "永久"), //高尔夫遮阳帽
    Array(1004137, 3000, "未定义", "永久"), //兔兔熊帽
    Array(1003919, 3000, "未定义", "永久"), //花花绒线帽
    Array(1003077, 3000, "未定义", "永久"), //花别针尼龙帽
    Array(1003215, 3000, "未定义", "永久"), //粉色雪花帽
    Array(1003387, 3000, "未定义", "永久"), //耳机毛线帽
    Array(1003210, 3000, "未定义", "永久"), //绒球遮耳帽
    Array(1002422, 3000, "未定义", "永久"), //点点星光帽
    Array(1003920, 3000, "未定义", "永久"), //夏威夷草帽
    Array(1003519, 3000, "未定义", "永久"), //霞光草帽
    Array(1003141, 3000, "未定义", "永久"), //稻草编织帽
    Array(1003531, 3000, "未定义", "永久"), //西式风情帽
    Array(1003539, 3000, "未定义", "永久"), //蓝色天使帽
    Array(1004136, 3000, "未定义", "永久"), //未来天使帽
    Array(1003793, 3000, "未定义", "永久"), //杜鹃花发簪
    Array(1004203, 3000, "未定义", "永久"), //喵星人的秘密
    Array(1004014, 3000, "未定义", "永久"), //阿宅守护精灵
    Array(1003967, 3000, "未定义", "永久"), //巧可羊帽子
    Array(1004204, 3000, "未定义", "永久"), //小蓝马
    Array(1004205, 3000, "未定义", "永久"), //小红马
    Array(1003234, 3000, "未定义", "永久"), //粉色卓别林帽子
    Array(1003235, 3000, "未定义", "永久"), //珠宝蓝卓别林帽子
    Array(1002920, 3000, "未定义", "永久"), //粉红淑女帽
    Array(1001042, 3000, "未定义", "永久"), //紫环头纱
    Array(1004113, 3000, "未定义", "永久"), //僵尸新娘的面纱
    Array(1004123, 3000, "未定义", "永久"), //时尚小圆帽
    Array(1002885, 3000, "未定义", "永久"), //新型蝴蝶结
    Array(1003133, 3000, "未定义", "永久"), //雪姬蝴蝶结
    Array(1003233, 3000, "未定义", "永久"), //最爱兔子发夹
    Array(1003222, 3000, "未定义", "永久"), //冰蓝蝴蝶卡子
    Array(1003362, 3000, "未定义", "永久"), //玫瑰粉双蝴蝶结
    Array(1003862, 3000, "未定义", "永久"), //熊宝宝发带
    Array(1003132, 3000, "未定义", "永久"), //红色精致丝带
    Array(1004111, 3000, "未定义", "永久"), //粉色波点发箍
    Array(1004110, 3000, "未定义", "永久"), //蓝色波点发箍
    Array(1003071, 3000, "未定义", "永久"), //淘气女孩粉色发箍
    Array(1003072, 3000, "未定义", "永久"), //黑蕾丝蝴蝶发箍
    Array(1003459, 3000, "未定义", "永久"), //露西娅帽子
    Array(1003750, 3000, "未定义", "永久"), //绸带猫耳
    Array(1003760, 3000, "未定义", "永久"), //猫咪耳机
    Array(1003505, 3000, "未定义", "永久"), //炎龙角
    Array(1003278, 3000, "未定义", "永久"), //孔雀羽毛
    Array(1003503, 3000, "未定义", "永久"), //爱丽丝的茶杯
    Array(1003223, 3000, "未定义", "永久"), //寻找妈咪的小鸡
    Array(1003510, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003202, 3000, "未定义", "永久"), //黄金甲壳虫
    Array(1003367, 3000, "未定义", "永久"), //彩色花环
    Array(1003761, 3000, "未定义", "永久"), //圣洁天使帽
    Array(1003461, 3000, "未定义", "永久"), //秀秀
    Array(1003277, 3000, "未定义", "永久"), //草业妖精帽
    Array(1000051, 3000, "未定义", "永久"), //精灵精神发带
    Array(1003520, 3000, "未定义", "永久"), //可爱丝线发带
    Array(1003860, 3000, "未定义", "永久"), //赛利亚假发
    Array(1003807, 3000, "未定义", "永久"), //桃心太阳眼镜
    Array(1003264, 3000, "未定义", "永久"), //太阳镜
    Array(1003265, 3000, "未定义", "永久"), //水手太阳镜
    Array(1003594, 3000, "未定义", "永久"), //凉爽夏日潜水镜
    Array(1003043, 3000, "未定义", "永久"), //叮当鹿角
    Array(1003078, 3000, "未定义", "永久"), //灵异蝴蝶
    Array(1003581, 3000, "未定义", "永久"), //蝴蝶伴舞头饰
    Array(1003586, 3000, "未定义", "永久"), //薄荷海军帽
    Array(1003587, 3000, "未定义", "永久"), //粉红丝带海军帽
    Array(1003079, 3000, "未定义", "永久"), //小嫩叶帽
    Array(1003083, 3000, "未定义", "永久"), //小嫩苗
    Array(1002888, 3000, "未定义", "永久"), //丝带发箍（红色）
    Array(1002890, 3000, "未定义", "永久"), //丝带发箍（蓝色）
    Array(1003639, 3000, "未定义", "永久"), //荧光发箍-粉色
    Array(1003640, 3000, "未定义", "永久"), //荧光发箍-蓝色
    Array(1003641, 3000, "未定义", "永久"), //荧光发箍-绿色
    Array(1003642, 3000, "未定义", "永久"), //荧光发箍-金色
    Array(1003249, 3000, "未定义", "永久"), //8周年音符黄晶
    Array(1003250, 3000, "未定义", "永久"), //8周年音符红宝石
    Array(1003251, 3000, "未定义", "永久"), //8周年音符黄水晶
    Array(1003252, 3000, "未定义", "永久"), //8周年音符紫水晶
    Array(1003548, 3000, "未定义", "永久"), //魔术师黑色礼帽
    Array(1003549, 3000, "未定义", "永久"), //魔术师黑色缎带
    Array(1003607, 3000, "未定义", "永久"), //蓝宝石羽毛发饰
    Array(1003636, 3000, "未定义", "永久"), //水神帽
    Array(1003865, 3000, "未定义", "永久"), //星光飘带帽子
    Array(1003516, 3000, "未定义", "永久"), //爱丽丝兔子头饰
    Array(1003461, 3000, "未定义", "永久"), //玫瑰秀秀
    Array(1000053, 3000, "未定义", "永久"), //贵族晚宴帽(男)
    Array(1000050, 3000, "未定义", "永久"), //薄荷雪水晶(男)
    Array(1000045, 3000, "未定义", "永久"), //军团长假发-男
    Array(1000046, 3000, "未定义", "永久"), //精灵王假发-男
    Array(1000071, 3000, "未定义", "永久"), //蓝色蝴蝶结礼帽（男）
    Array(1003460, 3000, "未定义", "永久"), //奶油巧克力帽子
    Array(1003796, 3000, "未定义", "永久"), //甜蜜冰淇淋帽
    Array(1003542, 3000, "未定义", "永久"), //草莓杏仁饼发卡
    Array(1003543, 3000, "未定义", "永久"), //杏仁饼发卡
    Array(1003544, 3000, "未定义", "永久"), //草莓纸杯蛋糕发卡
    Array(1003545, 3000, "未定义", "永久"), //哈密瓜纸杯蛋糕发卡
    Array(1003546, 3000, "未定义", "永久"), //巧克力纸杯蛋糕发卡
    Array(1003547, 3000, "未定义", "永久"), //冰激淋纸杯蛋糕发卡
    Array(1003595, 3000, "未定义", "永久")//卷发兔子
    );



var jmsp = Array(
    Array(1012450, 3000, "未定义", "永久"), //巧克力彩豆曲奇
    Array(1012412, 3000, "未定义", "永久"), //血泪 
    Array(1012099, 3000, "未定义", "永久"), //蓝色腮红 
    Array(1012253, 3000, "未定义", "永久"), //心跳唇彩
    Array(1012160, 3000, "未定义", "永久"), //烈焰红唇
    Array(1012208, 3000, "未定义", "永久"), //害羞了 
    Array(1012131, 3000, "未定义", "永久"), //好白的牙
    Array(1012165, 3000, "未定义", "永久"), //小丑鼻子
    Array(1012176, 3000, "未定义", "永久"), //娃娃脸
    Array(1012179, 3000, "未定义", "永久"), //鹿鼻子
    Array(1012135, 3000, "未定义", "永久"), //吐舌头
    Array(1022059, 3000, "未定义", "永久"), //经典黑色墨镜
    Array(1022057, 3000, "未定义", "永久"), //POP眼镜
    Array(1022064, 3000, "未定义", "永久"), //时尚大太阳镜
    Array(1022063, 3000, "未定义", "永久"), //无框小圆眼镜
    Array(1022104, 3000, "未定义", "永久"), //3D炫彩眼镜
    Array(1022102, 3000, "未定义", "永久"), //LED炫光眼镜
    Array(1022108, 3000, "未定义", "永久"), //柠檬黄潮流眼镜
    Array(1022109, 3000, "未定义", "永久"), //玫瑰红潮流眼镜
    Array(1003265, 3000, "未定义", "永久"), //爱心天蓝墨镜
    Array(1022110, 3000, "未定义", "永久"), //非主流墨镜
    Array(1022122, 3000, "未定义", "永久"), //DJ眼镜
    Array(1032029, 3000, "未定义", "永久"), //925银耳环
    Array(1032181, 3000, "未定义", "永久"), //杜鹃花耳环
    Array(1032034, 3000, "未定义", "永久"), //可乐耳环
    Array(1032094, 3000, "未定义", "永久"), //胡萝卜耳环
    Array(1032088, 3000, "未定义", "永久"), //体力猎犬耳环
    Array(1032145, 3000, "未定义", "永久")//螃蟹耳环
    );


var qtwp = Array(
    Array(5010082, 5000, "未定义", "永久"), //新星效果
    Array(4290004, 5000, "未定义", "永久"), //2010庚延年纪念品
    Array(4290003, 5000, "未定义", "永久"), //幻想妖精
    Array(4290001, 5000, "未定义", "永久"), //倒霉效果 
    Array(4290000, 5000, "未定义", "永久"), //金鸡效果
    Array(5010080, 5000, "未定义", "永久"), //（效果）下雨
    Array(5160017, 5000, "未定义", "永久"), //哼哼
    Array(5160015, 5000, "未定义", "永久"), //晕乎乎
    Array(5010015, 5000, "未定义", "永久"), //777效果
    Array(5010008, 5000, "未定义", "永久"), //幸运儿效果
    Array(5021011, 3000, "未定义", "永久"), //骷髅飞镖
    Array(5021012, 3000, "未定义", "永久"), //南瓜派
    Array(5021013, 3000, "未定义", "永久"), //海盗炸弹
    Array(5021026, 3000, "未定义", "永久")//开心的圣诞老人
    );

var gfs = Array(
    Array(1003393, 15000, "未定义", "永久"), //帝国伯爵冠
    Array(1102381, 15000, "未定义", "永久"), //皇家公爵翅膀
    Array(1032233, 5000, "未定义", "永久"), //粉色桃心耳环
    Array(1002839, 6666, "未定义", "永久"), //南瓜棒球帽
    Array(1112928, 5000, "未定义", "永久"), //粉色流星戒指90天
    Array(1112924, 5000, "未定义", "永久"), //黄色流星戒指90天
    Array(1112930, 5000, "未定义", "永久"), //西红柿效果-90天
    Array(1112937, 5000, "未定义", "永久"), //催眠曲戒指(90天)
    Array(1112916, 5000, "未定义", "永久"), //寂寞单身戒指
    Array(1112148, 5000, "未定义", "永久"), //胡子先生名片戒指
    Array(1112266, 5000, "未定义", "永久"), //胡子先生对话框戒指
    Array(1112154, 5000, "未定义", "永久"), //压岁钱防御战名片戒指
    Array(1112259, 5000, "未定义", "永久"), //压岁钱防御战聊天戒指
    Array(1112274, 5000, "未定义", "永久"), //鸥巴聊天戒指
    Array(1112162, 5000, "未定义", "永久"), //鸥巴名片戒指
    Array(1112276, 5000, "未定义", "永久"), //夏日甜心聊天戒指
    Array(1112164, 5000, "未定义", "永久"), //夏日甜心名片戒指
    Array(1112273, 5000, "未定义", "永久"), //黄小丫聊天戒指
    Array(1112161, 5000, "未定义", "永久"), //黄小丫名片戒指
    Array(1112271, 5000, "未定义", "永久"), //非洲之星聊天戒指
    Array(1112159, 5000, "未定义", "永久"), //非洲之星名片戒指
    Array(1112252, 5000, "未定义", "永久"), //红玫瑰聊天戒指
    Array(1112141, 5000, "未定义", "永久"), //红玫瑰名片戒指
    Array(1112135, 5000, "未定义", "永久"), //水墨花名片戒指
    Array(1112238, 5000, "未定义", "永久"), //水墨花聊天戒指
    Array(1112143, 5000, "未定义", "永久"), //豪华珍珠名片戒指
    Array(1112254, 5000, "未定义", "永久"), //豪华珍珠聊天戒指
    Array(1112262, 5000, "未定义", "永久"), //天使降临聊天戒指
    Array(1112150, 5000, "未定义", "永久"), //天使降临名片戒指
    Array(5010069, 5000, "未定义", "永久"), //死神之翼
    Array(1042271, 5000, "未定义", "永久"), //外星人拼色T恤
    Array(1042321, 5000, "未定义", "永久"), //心花怒放T恤
    Array(1042260, 5000, "未定义", "永久"), //点点星光羊毛上衣
    Array(1050284, 5000, "未定义", "永久"), //派对公子服(男)
    Array(1050302, 5000, "未定义", "永久"), //执事之品格(男)
    Array(1000052, 5000, "未定义", "永久"), //公主冠（男）
    Array(1052731, 5000, "未定义", "永久"), //黑色可爱游泳服
    Array(1052634, 5000, "未定义", "永久"), //简洁白衬衫
    Array(1052209, 5000, "未定义", "永久"), //皇家海军制服
    Array(1050152, 5000, "未定义", "永久"), //水兵服男
    Array(1052201, 5000, "未定义", "永久"), //闪亮水手外套
    Array(1004108, 5000, "未定义", "永久"), //幻夜蝶华礼帽
    Array(1003247, 5000, "未定义", "永久"), //杂技团老板帽
    Array(1003272, 5000, "未定义", "永久"), //格莱特帽
    Array(1003276, 5000, "未定义", "永久"), //蓝心透明帽子
    Array(1003271, 5000, "未定义", "永久"), //红心透明帽子
    Array(1003918, 5000, "未定义", "永久"), //翅膀帽
    Array(1004029, 5000, "未定义", "永久"), //小白熊便帽
    Array(1004026, 5000, "未定义", "永久"), //小黑猫便帽
    Array(1004028, 5000, "未定义", "永久"), //小花猫便帽
    Array(1004027, 5000, "未定义", "永久"), //白猫无边帽 
    Array(1003955, 5000, "未定义", "永久"), //浪漫玫瑰
    Array(1004094, 5000, "未定义", "永久"), //白巧克力兔子发箍
    Array(1004193, 5000, "未定义", "永久"), //护目镜帽子
    Array(1003892, 5000, "未定义", "永久"), //树叶钻石
    Array(1002846, 5000, "未定义", "永久"), //蓝天贝雷帽
    Array(1002995, 5000, "未定义", "永久"), //皇家海军帽
    Array(1003748, 5000, "未定义", "永久"), //皇家天使帽
    Array(1702168, 5000, "未定义", "永久"), //闪亮圣诞树
    Array(1702278, 5000, "未定义", "永久"), //枫之武器
    Array(1702211, 5000, "未定义", "永久"), //亮丽雪片
    Array(1702289, 5000, "未定义", "永久"), //皇家海军旗帜
    Array(1702287, 5000, "未定义", "永久"), //唤灵斗师长杖
    Array(1702277, 5000, "未定义", "永久"), //密码签字笔
    Array(1702309, 5000, "未定义", "永久"), //多味棒棒糖
    Array(1702155, 5000, "未定义", "永久"), //绚丽彩虹
    Array(1102605, 5000, "未定义", "永久"), //暗炎赎罪者
    Array(1102671, 5000, "未定义", "永久"), //肃清者的荆翼
    Array(1102564, 5000, "未定义", "永久"), //天衣无缝
    Array(1102653, 15000, "未定义", "永久"), //兔尾巴
    Array(1102267, 5000, "未定义", "永久")//我的朋友九尾狐尾巴

    );



var ns = Array(
    Array(1003965, 5000, "未定义", "永久"), //黑暗力量连身衣(女)
    Array(1052661, 5000, "未定义", "永久"), //樱花服
    Array(1082549, 5000, "未定义", "永久")//伊丽莎白手套
    );

var qltz = Array(
    Array(1051200, 8000, "未定义", "永久"), //邦妮女孩套服
    Array(1050161, 8000, "未定义", "永久"), //邦妮男孩套服
    Array(1050177, 8000, "未定义", "永久"), //MapleBoy套服
    Array(1051218, 8000, "未定义", "永久"), //MapleGirl套服
    Array(1052727, 8000, "未定义", "永久"), //快乐连体衫
    Array(1052728, 8000, "未定义", "永久"), //快乐连衣裙
    Array(1051357, 8000, "未定义", "永久"), //可爱棒球服（女）
    Array(1050291, 8000, "未定义", "永久"), //可爱棒球服（男）
    Array(1000072, 8000, "未定义", "永久"), //蓝色钱包君（男）
    Array(1001095, 8000, "未定义", "永久"), //粉色钱包君（女）
    Array(1050299, 8000, "未定义", "永久"), //小娃娃普卡（男）
    Array(1051366, 8000, "未定义", "永久"), //小娃娃皮卡（女）
    Array(1050293, 8000, "未定义", "永久"), //海滩帅锅装（男）
    Array(1051359, 8000, "未定义", "永久"), //海滩美眉装
    Array(1050293, 8000, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 8000, "未定义", "永久"), //蓝色小背带服
    Array(1051256, 8000, "未定义", "永久"), //蓝色小背带裙
    Array(1050209, 8000, "未定义", "永久"), //黄色晚礼服-男款
    Array(1051255, 8000, "未定义", "永久"), //黄色晚礼服-女款
    Array(1042213, 8000, "未定义", "永久"), //粉色雪花卫衣
    Array(1042212, 8000, "未定义", "永久"), //蓝色点点外套
    Array(1042216, 8000, "未定义", "永久"), //红色枫叶网球服
    Array(1042217, 8000, "未定义", "永久"), //黑色枫叶网球服
    Array(1048001, 8000, "未定义", "永久"), //兔兔情侣衫  
    Array(1048002, 8000, "未定义", "永久"), //胡萝卜情侣衫 
    Array(1042313, 8000, "未定义", "永久"), //魔蘑菇T恤（柠檬黄）
    Array(1042312, 8000, "未定义", "永久"), //魔蘑菇T恤（冰雪蓝）
    Array(1042316, 8000, "未定义", "永久"), //粉色萌萌象
    Array(1042315, 8000, "未定义", "永久"), //蓝色萌萌象
    Array(1050190, 8000, "未定义", "永久"), //闪烁之星男生礼服
    Array(1051232, 8000, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1050310, 8000, "未定义", "永久"), //天生购物狂（男）
    Array(1051382, 8000, "未定义", "永久"), //天生购物狂（女）
    Array(1050318, 8000, "未定义", "永久"), //纯白礼服（男）
    Array(1051389, 8000, "未定义", "永久"), //纯白婚纱(女)
    Array(1050296, 8000, "未定义", "永久"), //超级巨星服（男）
    Array(1051362, 8000, "未定义", "永久"), //超级巨星（女）
    Array(1050300, 8000, "未定义", "永久"), //蓝色雪糕帅锅装
    Array(1051367, 8000, "未定义", "永久"), //蓝色雪糕MM装
    Array(1050145, 8000, "未定义", "永久"), //粉露肩晚礼服（男）
    Array(1051123, 8000, "未定义", "永久"), //粉露肩晚礼服（女）
    Array(1051372, 8000, "未定义", "永久"), //巧克力女孩
    Array(1050304, 8000, "未定义", "永久"), //巧克力男孩
    Array(1051368, 8000, "未定义", "永久"), //粉格纹假日装（女）
    Array(1050301, 8000, "未定义", "永久"), //蓝色格纹假日服（男）
    Array(1000070, 8000, "未定义", "永久"), //贵族骑手帽(男)
    Array(1001093, 8000, "未定义", "永久"), //贵族骑手帽（女）
    Array(1050312, 8000, "未定义", "永久"), //贵族骑手装(男)
    Array(1051384, 8000, "未定义", "永久")//贵族骑手装（女）

    );

var stxz = Array(
    Array(1082511, 3000, "未定义", "永久"), //小恐龙绿豆手套
    Array(1082519, 3000, "未定义", "永久"), //小恐龙云豆手套
    Array(1082312, 3000, "未定义", "永久"), //彩虹护腕
    Array(1082493, 3000, "未定义", "永久"), //海豹白白手套
    Array(1082581, 3000, "未定义", "永久"), //巧克力发带装饰
    Array(1082549, 3000, "未定义", "永久"), //咯咯嗒手套
    Array(1082503, 3000, "未定义", "永久"), //圣洁天使手镯
    Array(1082548, 3000, "未定义", "永久"), //星星手镯
    Array(1082502, 3000, "未定义", "永久"), //蓝缎带猫咪爪
    Array(1072336, 3000, "未定义", "永久"), //足球钉鞋
    Array(1072869, 3000, "未定义", "永久"), //时间旅行者的高跟鞋
    Array(1072924, 3000, "未定义", "永久"), //未来天使靴
    Array(1072913, 3000, "未定义", "永久"), //制服皮鞋
    Array(1072931, 3000, "未定义", "永久"), //爱丽丝鞋子
    Array(1072911, 3000, "未定义", "永久"), //肃清者暗靴
    Array(1072897, 3000, "未定义", "永久"), //蓝色鹿皮鞋
    Array(1072901, 3000, "未定义", "永久"), //五彩珠鞋
    Array(1072876, 3000, "未定义", "永久"), //卡卡奥熊掌鞋
    Array(1072917, 3000, "未定义", "永久"), //小马乖乖鞋
    Array(1072662, 3000, "未定义", "永久"), //明星闪耀
    Array(1072820, 3000, "未定义", "永久"), //明星熊仔鞋
    Array(1072852, 3000, "未定义", "永久"), //超级巨星鞋子
    Array(1072821, 3000, "未定义", "永久"), //金铃排队鞋
    Array(1072816, 3000, "未定义", "永久"), //女妖鞋子
    Array(1072908, 3000, "未定义", "永久"), //骑马靴
    Array(1072919, 3000, "未定义", "永久"), //蓝色蝴蝶鞋
    Array(1072918, 3000, "未定义", "永久"), //粉色蝴蝶鞋
    Array(1072858, 3000, "未定义", "永久"), //黑天鹅芭蕾鞋
    Array(1072857, 3000, "未定义", "永久"), //白天鹅芭蕾鞋
    Array(1072803, 3000, "未定义", "永久"), //小恐龙云豆爪爪
    Array(1072662, 3000, "未定义", "永久"), //小恐龙绿豆爪爪
    Array(1072791, 3000, "未定义", "永久"), //蓝缎带猫咪鞋
    Array(1072388, 3000, "未定义", "永久"), //女仆礼鞋 
    Array(1072439, 3000, "未定义", "永久"), //采草莓礼鞋
    Array(1072923, 3000, "未定义", "永久"), //波点娃娃鞋
    Array(1072848, 3000, "未定义", "永久"), //血腥吊带袜
    Array(1070057, 3000, "未定义", "永久"), //岩炎拖鞋
    Array(1071026, 3000, "未定义", "永久"), //巨星潮流靴
    Array(1072662, 3000, "未定义", "永久"), //露西亚运动鞋
    Array(1072407, 3000, "未定义", "永久"), //HELLO喵喵拖
    Array(1072438, 3000, "未定义", "永久"), //小嫩叶鞋
    Array(1072437, 3000, "未定义", "永久"), //PB拖拖
    Array(1072482, 3000, "未定义", "永久"), //熊猫拖
    Array(1072483, 3000, "未定义", "永久"), //白色登山鞋
    Array(1072484, 3000, "未定义", "永久"), //黑猫拖
    Array(1072507, 3000, "未定义", "永久"), //银色脚链
    Array(1072514, 3000, "未定义", "永久"), //天使翅膀帆布鞋
    Array(1072515, 3000, "未定义", "永久"), //狮子宝宝拖
    Array(1072516, 3000, "未定义", "永久"), //新手小鸡拖
    Array(1072517, 3000, "未定义", "永久"), //天使羽翼
    Array(1072531, 3000, "未定义", "永久"), //考拉拖鞋
    Array(1072663, 3000, "未定义", "永久"), //蓝色天使鞋
    Array(1072749, 3000, "未定义", "永久"), //泡泡巧克力鞋子
    Array(1072448, 3000, "未定义", "永久")//皇家彩虹鞋

    );


var status = 0;
var xx = -1;
var jiage = -1;

function start() {
    status = -1;
    action(1, 0, 0);
}


function action(mode, type, selection) {
    if (mode == -1) {
        cm.sendOk("#b好的,下次再见.");
        cm.dispose();
    } else {

        if (mode == 0) {
            cm.sendOk("#b好的,下次再见.");
            cm.dispose();
            return;
        }

        if (mode == 1) {
            status++;
        } else {
            status--;
        }

        //---------------------------------------------------------------------------------

        if (status == 0) {

            var add = "#rMapleStory#k,下面是本服的游戏商城区,\r\n\r\n";

            add += "   您当前位置:#b商城首页#k#r\r\n\r\n\r\n";

            add += "" + sss + "\r\n   ";

            add += "#L0##e#r点卷商城（该商场购买的物品无法放入商城背包）#l ";

            cm.sendSimple(add);

        ///////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 1) {

            if (selection == 0) {

                var add = "欢迎来到#r#eMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#b";

                add += "#L1#套服时装#l ";

                add += "#L2#戒指名片#l ";

               	add += "#L3#上衣裙裤#l ";

              //  add += "#L4#使用消耗#l \r\n";

                add += "#L5#宠物系列#l \r\n";

                add += "#L6#时尚武器#l ";

                add += "#L7#精美披风#l ";

                add += "#L8#精美帽子#l ";

                add += "#L9#精美饰品#l ";

                //add += "#L10#其他物品#l ";

                add += "#L13#情侣套装#l ";

                add += "#L12##r限时销售#l ";

                add += "#L11##b我是土豪#l ";

                add += "#L14#手套鞋子#l \r\n";

                cm.sendSimple(add);

            }

        //////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 2) {

            if (selection == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美时装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmsz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsz[i][0] + "##z" + jmsz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmsz[i][1] + " #d    使用期限:#r " + jmsz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 1

            } else if (selection == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jzmp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jzmp[i][0] + "##z" + jzmp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jzmp[i][1] + " #d    使用期限:#r " + jzmp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 2


            } else if (selection == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>本周推荐#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < tjId.length; i++) {

                    add += "\r\n#L" + i + "##v" + tjId[i][0] + "##z" + tjId[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + tjId[i][1] + " #d    使用期限:#r " + tjId[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 3;

            } else if (selection == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < syxh.length; i++) {

                    add += "\r\n#L" + i + "##v" + syxh[i][0] + "##z" + syxh[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + syxh[i][1] + " #d    购买数量:#r " + syxh[i][3] + "#k#b";


                }


                cm.sendSimple(add);

                xx = 4;

            } else if (selection == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>宠物系列#k\r\n\r\n";
                add += "   宠物内容如果有加BUFF.增益效果.加攻击力的一律是无效技能！\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n#b";

                for (var i = 0; i < xswp.length; i++) {

                    add += "\r\n#L" + i + "##v" + xswp[i][0] + "##z" + xswp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + xswp[i][1] + " #d    购买数量:#r " + xswp[i][2] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 5


            } else if (selection == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmwq.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmwq[i][0] + "##z" + jmwq[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmwq[i][1] + " #d    使用期限:#r " + jmwq[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 6


            } else if (selection == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmpf.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmpf[i][0] + "##z" + jmpf[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmpf[i][1] + " #d    使用期限:#r " + jmpf[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 7


            } else if (selection == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmmz.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmmz[i][0] + "##z" + jmmz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmmz[i][1] + " #d    使用期限:#r " + jmmz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 8

            } else if (selection == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < jmsp.length; i++) {

                    add += "\r\n#L" + i + "##v" + jmsp[i][0] + "##z" + jmsp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + jmsp[i][1] + " #d    使用期限:#r " + jmsp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 9


            } else if (selection == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>其他物品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < qtwp.length; i++) {

                    add += "\r\n#L" + i + "##v" + qtwp[i][0] + "##z" + qtwp[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + qtwp[i][1] + " #d    使用期限:#r " + qtwp[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 10

            } else if (selection == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是高富帅#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < gfs.length; i++) {

                    add += "\r\n#L" + i + "##v" + gfs[i][0] + "##z" + gfs[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + gfs[i][1] + " #d    使用期限:#r " + gfs[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 11


            } else if (selection == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是女神#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < ns.length; i++) {

                    add += "\r\n#L" + i + "##v" + ns[i][0] + "##z" + ns[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + ns[i][1] + " #d    使用期限:#r " + ns[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 12


            } else if (selection == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>情侣套装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < qltz.length; i++) {

                    add += "\r\n#L" + i + "##v" + qltz[i][0] + "##z" + qltz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + qltz[i][1] + " #d    使用期限:#r " + qltz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 13


            } else if (selection == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n#b";

                for (var i = 0; i < stxz.length; i++) {

                    add += "\r\n#L" + i + "##v" + stxz[i][0] + "##z" + stxz[i][0] + "##l#d\r\n\r\n		";

                    add += "需要点卷:#r " + stxz[i][1] + " #d    使用期限:#r " + stxz[i][3] + "#k#b";

                }

                cm.sendSimple(add);

                xx = 14

            }

        ////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 3) {

            if (xx == 1) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美时装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsz[selection][0] + "# #z" + jmsz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsz[selection][1] + " #d    使用期限:#r " + jmsz[selection][3] + "\r\n                              ";

                add += "   #L1#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 2) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jzmp[selection][0] + "# #z" + jzmp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jzmp[selection][1] + " #d    使用期限:#r " + jzmp[selection][3] + "\r\n                              ";

                add += "   #L2#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 3) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>本周推荐#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + tjId[selection][0] + "# #z" + tjId[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + tjId[selection][1] + " #d    使用期限:#r " + tjId[selection][3] + "\r\n                              ";

                add += "   #L3#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 4) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "\r\n\r\n#d";

                add += "   物品:#v" + syxh[selection][0] + "# #z" + syxh[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r" + syxh[selection][1] + " #d    购买数量:#r " + syxh[selection][3] + "\r\n                              ";

                add += "   #L4#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }

            if (xx == 5) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>限时物品#k\r\n\r\n";

                add += "   物品:#v" + xswp[selection][0] + "# #z" + xswp[selection][0] + "##k\r\n\r\n";

                add += "   需要点卷:#r" + xswp[selection][1] + " #d        使用期限:#r " + xswp[selection][2] + "\r\n";

                add += "   #L5#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;


            }


            if (xx == 6) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmwq[selection][0] + "# #z" + jmwq[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmwq[selection][1] + " #d    使用期限:#r " + jmwq[selection][3] + "\r\n                              ";

                add += "   #L6#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 7) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmpf[selection][0] + "# #z" + jmpf[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmpf[selection][1] + " #d    使用期限:#r " + jmpf[selection][3] + "\r\n                              ";

                add += "   #L7#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }


            if (xx == 8) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmmz[selection][0] + "# #z" + jmmz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmmz[selection][1] + " #d    使用期限:#r " + jmmz[selection][3] + "\r\n                              ";

                add += "   #L8#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 9) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + jmsp[selection][0] + "# #z" + jmsp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + jmsp[selection][1] + " #d    使用期限:#r " + jmsp[selection][3] + "\r\n                              ";

                add += "   #L9#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 10) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>其他物品#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qtwp[selection][0] + "# #z" + qtwp[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qtwp[selection][1] + " #d    使用期限:#r " + qtwp[selection][3] + "\r\n                              ";

                add += "   #L10#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 11) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我要当高富帅#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + gfs[selection][0] + "# #z" + gfs[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + gfs[selection][1] + " #d    使用期限:#r " + gfs[selection][3] + "\r\n                              ";

                add += "   #L11#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 12) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>我是女神#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + ns[selection][0] + "# #z" + ns[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + ns[selection][1] + " #d    使用期限:#r " + ns[selection][3] + "\r\n                              ";

                add += "   #L12#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 13) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>情侣套装#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + qltz[selection][0] + "# #z" + qltz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + qltz[selection][1] + " #d    使用期限:#r " + qltz[selection][3] + "\r\n                              ";

                add += "   #L13#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

            if (xx == 14) {

                var add = "欢迎来到#rMapleStory#k,下面是本服的游戏商城区.\r\n\r\n";

                add += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n\r\n";

                add += "   当前点卷余额:#r" + cm.getPlayer().getCSPoints(1) + "#k\r\n\r\n#d";

                add += "   物品:#v" + stxz[selection][0] + "# #z" + stxz[selection][0] + "#\r\n\r\n";

                add += "   需要点卷:#r " + stxz[selection][1] + " #d    使用期限:#r " + stxz[selection][3] + "\r\n                              ";

                add += "   #L14#立即购买#l";

                cm.sendSimple(add);

                jiage = selection;

            }

        ///////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 4) {


            if (selection == 1) {
                if (cm.getPlayer().getCSPoints(1) >= jmsz[jiage][1]) {
                    //cm.gainItem(jmsz[jiage][0], 1);
					item = cm.gainGachaponItem(jmsz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmsz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 2) {
                if (cm.getPlayer().getCSPoints(1) >= jzmp[jiage][1]) {
					item = cm.gainGachaponItem(jzmp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jzmp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 3) {
                if (cm.getPlayer().getCSPoints(1) >= tjId[jiage][1]) {
                    cm.getPlayer().modifyCSPoints(1, -tjId[jiage][1]);
                    var ii = server.MapleItemInformationProvider.getInstance();
                    var type = ii.getInventoryType(tjId[jiage][0]);
                    var toDrop = ii.randomizeStats(ii.getEquipById(tjId[jiage][0])).copy();
                    var temptime = new java.sql.Timestamp(java.lang.System.currentTimeMillis() + tjId[jiage][4]);
                    toDrop.setExpiration(temptime);
                    toDrop.setLocked(1);
                    cm.getPlayer().getInventory(type).addItem(toDrop);
                    cm.getC().getSession().write(tools.MaplePacketCreator.addInventorySlot(type, toDrop));
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 4) {
                if (cm.getPlayer().getCSPoints(1) >= syxh[jiage][1]) {
					item = cm.gainGachaponItem(syxh[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -syxh[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }


            } else if (selection == 5) {
                if (cm.getPlayer().getCSPoints(1) >= xswp[jiage][1]) {
                    cm.getPlayer().modifyCSPoints(1, -xswp[jiage][1]);
					cm.gainPet(xswp[jiage][0],xswp[jiage][2],1,100,100,90);
                    cm.sendOk("#b购买成功,请查看背包.");
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 6) {
                if (cm.getPlayer().getCSPoints(1) >= jmwq[jiage][1]) {
					item = cm.gainGachaponItem(jmwq[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmwq[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 7) {
                if (cm.getPlayer().getCSPoints(1) >= jmpf[jiage][1]) {
					item = cm.gainGachaponItem(jmpf[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmpf[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 8) {
                if (cm.getPlayer().getCSPoints(1) >= jmmz[jiage][1]) {
					item = cm.gainGachaponItem(jmmz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmmz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 9) {
                if (cm.getPlayer().getCSPoints(1) >= jmsp[jiage][1]) {
					item = cm.gainGachaponItem(jmsp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -jmsp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 10) {
                if (cm.getPlayer().getCSPoints(1) >= qtwp[jiage][1]) {
					item = cm.gainGachaponItem(qtwp[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -qtwp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 11) {
                if (cm.getPlayer().getCSPoints(1) >= gfs[jiage][1]) {
					item = cm.gainGachaponItem(gfs[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -gfs[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 12) {
                if (cm.getPlayer().getCSPoints(1) >= ns[jiage][1]) {
					item = cm.gainGachaponItem(ns[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -ns[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 13) {
                if (cm.getPlayer().getCSPoints(1) >= qltz[jiage][1]) {
					item = cm.gainGachaponItem(qltz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -qltz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 14) {
                if (cm.getPlayer().getCSPoints(1) >= stxz[jiage][1]) {
					item = cm.gainGachaponItem(stxz[jiage][0], 1, "现金商城", 1);
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -stxz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
                    cm.dispose();
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }
            }
        }
    }

}*/
